[
  {
    "slug": "level-1-global-dengue",
    "title": "Level 1 - Global Dengue",
    "category": "News",
    "date": "2025-08-30",
    "excerpt": "Global Dengue - Level 1 - Level 1 - Practice Usual Precautions - Travel Health Notices | Travelers&#39; Health | CDC --> Skip directly to site content Skip directly to page options Skip directly to A-Z link Skip directly to A-Z link Skip directly to A-Z link You are using an outdated browser. Upgrade your browser today or install Google Chrome Frame to better experience this site. Centers for Disease Control and Prevention. CDC twenty four seven. Saving Lives, Protecting People &nbsp;Travelers' Health Search Submit Note: Javascript is disabled or is not supported by your browser. For this reason, some items on this page will be unavailable. For more information about this message, please visit this page: About CDC.gov . Travelers' Health Facebook Twitter LinkedIn Syndicate Global Dengue Level 4 - Avoid All Travel Level 3 - Reconsider Nonessential Travel Level 2 - Practice Enhanced Precautions Level 1 - Practice Usual Precautions Key points&nbsp; Dengue is a year-round risk in many parts of the world, with outbreaks commonly occurring every 2&ndash;5 years. Some countries are reporting increased numbers of cases of the disease. Dengue is spread by mosquito bites. Travelers to risk areas should prevent mosquito bites by using an EPA-registered insect repellent , wearing long-sleeved shirts and long pants when outdoors, and sleeping in an air-conditioned room or room with window screens. Countries reporting higher-than-usual number of dengue cases ( View larger ) What is dengue? Dengue is a disease caused by a virus spread through mosquito bites. The disease can take up to 2 weeks to develop with illness generally lasting less than a week. Symptoms from dengue include fever, headache, nausea, vomiting, rash, muscle and joint pain, and minor bleeding. Dengue can become severe within a few hours. Severe dengue is a medical emergency, usually requiring hospitalization. In severe cases, health effects can include hemorrhage (uncontrolled bleeding), shock (seriously low blood pressure), organ failure, and death.&nbsp; What is the current situation? The countries listed below are reporting higher than usual numbers of cases, or CDC has identified a higher-than-expected number of dengue cases among U.S. travelers returning from those countries. Travelers visiting these countries may be at increased risk: Bangladesh Cook Islands Colombia Comoros Cuba El Salvador Fiji French Polynesia Guatemala Kiribati Mali Mexico Nauru Panama Philippines Samoa Tonga Tuvalu Countries are added to this list based on publicly available data. Not all countries with dengue transmission are on this list. Travelers should practice prevention measures for all areas with a risk of dengue . Traveler Information CDC dengue homepage Dengue Around the World Clinician Information Dengue in CDC&nbsp;Yellow Book Dengue information for health care professionals *Based on ArboNET modeling which considers historical data about dengue cases among travelers to each country, from 2010 to present. It calculates the expected number of travelers with dengue returning from each country monthly to account for dengue seasonality. If the number of dengue cases in travelers is higher than expected (using an 80% threshold) for that month, dengue transmission is considered &lsquo;high&rsquo;. ArboNET is the national arboviral surveillance system that maintains data on arboviral infections among humans, presumptive viremic blood doners, veterinary disease cases, mosquitoes, dead birds, and sentinel animals. ArboNET is managed by CDC and state health departments and relies on the clinical diagnoses, testing, and reporting of arboviral diseases to public health authorities. &nbsp; Page created: June 20, 2024 --> Page last updated: August 21, 2025 --> Page last reviewed: August 21, 2025 Content source: National Center for Emerging and Zoonotic Infectious Diseases (NCEZID) Division of Global Migration Health (DGMH) Home Travelers Health Destinations Travel Notices expand Global Dengue Advice for Travelers expand Adventure Travel After Travel Tips Allergies and Travel Avoid Animals Before You Travel Blood Clots Bug Bites Business Travel Cold Weather and Travel Counterfeit Medicines Cruise Ship Travel During Travel Tips Food Poisoning from Seafood Food and Drinks Health Care During Travel expand Obtención de atención médica en el extranjero High Altitudes Holiday Travel Heat Illnesses Humanitarian Aid Workers Travel Insurance Jet Lag Last-Minute Travel Long-Term Travel Mass Gatherings Medical Tourism Mental Health Motion Sickness Natural Disasters Older Adults Pack Smart Pregnant Travelers Road Safety Routine Vaccines Sex Tourism Spring Break Travel STIs Study Abroad Summer Travel Sun Exposure Tick Bites Travel Vaccines Traveler Survival Guide Traveling Abroad with Medicine Traveling with Children Traveling with Your Pet Travelers' Diarrhea Travelers with Chronic Illnesses Travelers with Disability Travelers with Weakened Immune Systems Visiting Friends or Relatives Avoid Contaminated Water During Travel Swimming and Diving Safety RSS Feeds Find a Clinic expand Yellow Fever Vaccination Clinics expand FAQ Clinician Resources expand Clinical Updates ICVP Yellow Fever Vaccine Course Cholera Information for Health Care Professionals Pre-Travel Quick Guide Think Travel Vaccine Guide Patient Counseling Training Courses CDC Yellow Book Research and Surveillance expand Traveler-based Genomic Surveillance Frequently Asked Questions expand Contact Us File Formats Help: How do I view different file formats (PDF, DOC, PPT, MPEG) on this site? Adobe PDF file Microsoft PowerPoint file Microsoft Word file Microsoft Excel file Audio/Video file Apple Quicktime file RealPlayer file Text file Zip Archive file SAS file ePub file CONTACT CDC-INFO Have questions? We have answers. 1-800-CDC-INFO (800-232-4636) TTY: 888-232-6348 Email CDC-INFO CDC INFORMATION About CDC Jobs Funding Policies File Viewers &amp; Players Privacy FOIA No Fear Act OIG Nondiscrimination CONNECT WITH CDC Facebook Twitter Youtube Instagram Syndicate CDC TV RSS Email U.S. Department of Health &amp; Human Services USA.gov CDC Website Exit Disclaimer Follow CDC Email Recommend Tweet Post RSS CDC Media Listen Watch eCards YouTube TOP",
    "cover": "https://images.unsplash.com/photo-1500534314209-a25ddb2bd429?auto=format&fit=crop&w=1600&q=60"
  },
  {
    "slug": "level-2-chikungunya-in-china",
    "title": "Level 2 - Chikungunya in China",
    "category": "News",
    "date": "2025-08-30",
    "excerpt": "Chikungunya in China - Level 2 - Level 2 - Practice Enhanced Precautions - Travel Health Notices | Travelers&#39; Health | CDC --> Skip directly to site content Skip directly to page options Skip directly to A-Z link Skip directly to A-Z link Skip directly to A-Z link You are using an outdated browser. Upgrade your browser today or install Google Chrome Frame to better experience this site. Centers for Disease Control and Prevention. CDC twenty four seven. Saving Lives, Protecting People &nbsp;Travelers' Health Search Submit Note: Javascript is disabled or is not supported by your browser. For this reason, some items on this page will be unavailable. For more information about this message, please visit this page: About CDC.gov . Travelers' Health Facebook Twitter LinkedIn Syndicate Chikungunya in China Level 4 - Avoid All Travel Level 3 - Reconsider Nonessential Travel Level 2 - Practice Enhanced Precautions Level 1 - Practice Usual Precautions Key points There is an outbreak of chikungunya in Guangdong Province, China. Most cases have been reported in Foshan city (see map). Mosquitoes spread the virus that causes chikungunya. You can protect yourself by preventing mosquito bites , which includes using insect repellent; wearing long-sleeved shirts and pants; and staying in places with air conditioning or that have screens on the windows and&nbsp;&nbsp;doors.&nbsp; Vaccination is recommended for travelers who are visiting an area with a chikungunya outbreak. &nbsp; If you are pregnant, reconsider travel to the affected areas, particularly if you are close to delivering your baby. Mothers infected around the time of delivery can pass the virus to their baby before or during delivery. Newborns infected in this way or by a mosquito bite are at risk for severe illness, including poor long-term&nbsp;outcomes. In general, vaccination against chikungunya should be deferred until after delivery. However, when the risk of infection is high and exposure cannot be avoided, pregnant travelers should discuss with their healthcare provider the potential risks (to themselves and their babies) of chikungunya virus infection and the potential benefits and risks of vaccination so that vaccination can be&nbsp;considered. Seek medical care immediately if you develop fever, joint pain, headache, muscle pain, joint swelling, or rash during or after travel. For Clinicians Review information on&nbsp; chikungunya vaccination .&nbsp; Healthcare providers should discuss the benefits and risks of vaccination with individual travelers based on their age, underlying health conditions, destination, trip duration, and planned activities. Traveler Information Health Information for Travelers to China CDC Chikungunya Website Chikungunya vaccines Avoid Bug Bites Clinician Information Chikungunya in the CDC Yellow Book (Health Information for International Travel) Treatment and Prevention of Chikungunya Virus Disease Chikungunya Vaccine Information for Healthcare Providers Map of Guangdong Province, China ( View larger ) What is chikungunya? Chikungunya disease is caused by the chikungunya virus and is spread to humans through mosquito bites. Outbreaks have occurred in countries in Africa, Americas, Asia, Europe, the Caribbean, and Indian and Pacific Oceans. Most people infected with chikungunya virus develop some symptoms. Symptoms of chikungunya usually begin 3 &ndash; 7 days after a bite by an infected mosquito. The most common symptoms are fever and joint pain. Other symptoms may include headache, muscle pain, joint swelling, or rash. Most people get better within a week; however, some can have severe joint pain for months to years following acute illness. People at risk for more severe disease include newborns infected around the time of birth, older adults (65 years or older), and people with medical conditions such as diabetes or heart disease. Death from chikungunya is&nbsp;rare.&nbsp; There&nbsp;is no specific treatment for chikungunya. &nbsp; Page created: August 01, 2025 --> Page last updated: August 26, 2025 --> Page last reviewed: August 26, 2025 Content source: National Center for Emerging and Zoonotic Infectious Diseases (NCEZID) Division of Global Migration Health (DGMH) Home Travelers Health Destinations Travel Notices expand Chikungunya in China Advice for Travelers expand Adventure Travel After Travel Tips Allergies and Travel Avoid Animals Before You Travel Blood Clots Bug Bites Business Travel Cold Weather and Travel Counterfeit Medicines Cruise Ship Travel During Travel Tips Food Poisoning from Seafood Food and Drinks Health Care During Travel expand Obtención de atención médica en el extranjero High Altitudes Holiday Travel Heat Illnesses Humanitarian Aid Workers Travel Insurance Jet Lag Last-Minute Travel Long-Term Travel Mass Gatherings Medical Tourism Mental Health Motion Sickness Natural Disasters Older Adults Pack Smart Pregnant Travelers Road Safety Routine Vaccines Sex Tourism Spring Break Travel STIs Study Abroad Summer Travel Sun Exposure Tick Bites Travel Vaccines Traveler Survival Guide Traveling Abroad with Medicine Traveling with Children Traveling with Your Pet Travelers' Diarrhea Travelers with Chronic Illnesses Travelers with Disability Travelers with Weakened Immune Systems Visiting Friends or Relatives Avoid Contaminated Water During Travel Swimming and Diving Safety RSS Feeds Find a Clinic expand Yellow Fever Vaccination Clinics expand FAQ Clinician Resources expand Clinical Updates ICVP Yellow Fever Vaccine Course Cholera Information for Health Care Professionals Pre-Travel Quick Guide Think Travel Vaccine Guide Patient Counseling Training Courses CDC Yellow Book Research and Surveillance expand Traveler-based Genomic Surveillance Frequently Asked Questions expand Contact Us File Formats Help: How do I view different file formats (PDF, DOC, PPT, MPEG) on this site? Adobe PDF file Microsoft PowerPoint file Microsoft Word file Microsoft Excel file Audio/Video file Apple Quicktime file RealPlayer file Text file Zip Archive file SAS file ePub file CONTACT CDC-INFO Have questions? We have answers. 1-800-CDC-INFO (800-232-4636) TTY: 888-232-6348 Email CDC-INFO CDC INFORMATION About CDC Jobs Funding Policies File Viewers &amp; Players Privacy FOIA No Fear Act OIG Nondiscrimination CONNECT WITH CDC Facebook Twitter Youtube Instagram Syndicate CDC TV RSS Email U.S. Department of Health &amp; Human Services USA.gov CDC Website Exit Disclaimer Follow CDC Email Recommend Tweet Post RSS CDC Media Listen Watch eCards YouTube TOP",
    "cover": "https://images.unsplash.com/photo-1531306728370-e2ebd9d7bb99?auto=format&fit=crop&w=1600&q=60"
  },
  {
    "slug": "level-2-chikungunya-in-the-region-of-the-indian-ocean",
    "title": "Level 2 - Chikungunya in the Region of the Indian Ocean",
    "category": "News",
    "date": "2025-08-30",
    "excerpt": "Chikungunya in the Region of the Indian Ocean - Level 2 - Level 2 - Practice Enhanced Precautions - Travel Health Notices | Travelers&#39; Health | CDC --> Skip directly to site content Skip directly to page options Skip directly to A-Z link Skip directly to A-Z link Skip directly to A-Z link You are using an outdated browser. Upgrade your browser today or install Google Chrome Frame to better experience this site. Centers for Disease Control and Prevention. CDC twenty four seven. Saving Lives, Protecting People &nbsp;Travelers' Health Search Submit Note: Javascript is disabled or is not supported by your browser. For this reason, some items on this page will be unavailable. For more information about this message, please visit this page: About CDC.gov . Travelers' Health Facebook Twitter LinkedIn Syndicate Chikungunya in the Region of the Indian Ocean Level 4 - Avoid All Travel Level 3 - Reconsider Nonessential Travel Level 2 - Practice Enhanced Precautions Level 1 - Practice Usual Precautions Map: Countries in the region with chikungunya outbreaks &nbsp;( see larger map ) What is&nbsp;chikungunya? Chikungunya disease is caused by the chikungunya virus and is spread to humans through mosquito bites. Outbreaks have occurred in countries in Africa, Americas, Asia, Europe, the Caribbean, and Indian and Pacific Oceans. Most people infected with chikungunya virus develop some symptoms. Symptoms of chikungunya usually begin 3&ndash;7 days after a bite by an infected mosquito. The most common symptoms are fever and joint pain. Other symptoms may include headache, muscle pain, joint swelling, or rash. Most people get better within a week; however, some can have severe joint pain for months to years following acute illness. People at risk for more severe disease include newborns infected around the time of birth, older adults (65 years or older), and people with medical conditions such as diabetes or heart disease. Death from chikungunya is rare. There is no specific treatment for chikungunya. Key points There are outbreaks of chikungunya in Kenya, Madagascar, Somalia, and Sri Lanka (see map). Mosquitoes spread the virus that causes chikungunya. You can protect yourself by preventing mosquito bites , which includes using insect repellent; wearing long-sleeved shirts and pants; and staying in places with air conditioning or that have screens on the windows and doors. Vaccination is recommended for travelers who are visiting an area with a chikungunya outbreak.&nbsp; If you are pregnant, reconsider travel to the affected areas, particularly if you are close to delivering your baby. Mothers infected around the time of delivery can pass the virus to their baby before or during delivery. Newborns infected in this way or by a mosquito bite are at risk for severe illness, including poor long-term outcomes. In general, vaccination against chikungunya should be deferred until after delivery. However, when the risk of infection is high and exposure cannot be avoided, pregnant travelers should discuss with their healthcare provider the potential risks (to themselves and their babies) of chikungunya virus infection and the potential benefits and risks of vaccination so that vaccination can be considered. Seek medical care if you develop fever, joint pain, headache, muscle pain, joint swelling, or rash , during or after travel. For Clinicians Review information on&nbsp; chikungunya vaccination .&nbsp; Healthcare providers should discuss the benefits and risks of vaccination with individual travelers based on their age, underlying health conditions, destination, trip duration, and planned activities. Traveler Information Health Information for Travelers to Kenya Health Information for Travelers to Madagascar Health Information for Travelers to Somalia Health Information for Travelers to Sri Lanka CDC Chikungunya Website Chikungunya Vaccines Avoid Bug Bites Clinician Information Chikungunya in the CDC Yellow Book (Health Information for International Travel) Treatment and Prevention of Chikungunya Virus Disease Chikungunya Vaccine Information for Health Care Providers Page created: May 09, 2025 --> Page last updated: August 29, 2025 --> Page last reviewed: August 29, 2025 Content source: National Center for Emerging and Zoonotic Infectious Diseases (NCEZID) Division of Global Migration Health (DGMH) Home Travelers Health Destinations Travel Notices expand Chikungunya in the Region of the Indian Ocean Advice for Travelers expand Adventure Travel After Travel Tips Allergies and Travel Avoid Animals Before You Travel Blood Clots Bug Bites Business Travel Cold Weather and Travel Counterfeit Medicines Cruise Ship Travel During Travel Tips Food Poisoning from Seafood Food and Drinks Health Care During Travel expand Obtención de atención médica en el extranjero High Altitudes Holiday Travel Heat Illnesses Humanitarian Aid Workers Travel Insurance Jet Lag Last-Minute Travel Long-Term Travel Mass Gatherings Medical Tourism Mental Health Motion Sickness Natural Disasters Older Adults Pack Smart Pregnant Travelers Road Safety Routine Vaccines Sex Tourism Spring Break Travel STIs Study Abroad Summer Travel Sun Exposure Tick Bites Travel Vaccines Traveler Survival Guide Traveling Abroad with Medicine Traveling with Children Traveling with Your Pet Travelers' Diarrhea Travelers with Chronic Illnesses Travelers with Disability Travelers with Weakened Immune Systems Visiting Friends or Relatives Avoid Contaminated Water During Travel Swimming and Diving Safety RSS Feeds Find a Clinic expand Yellow Fever Vaccination Clinics expand FAQ Clinician Resources expand Clinical Updates ICVP Yellow Fever Vaccine Course Cholera Information for Health Care Professionals Pre-Travel Quick Guide Think Travel Vaccine Guide Patient Counseling Training Courses CDC Yellow Book Research and Surveillance expand Traveler-based Genomic Surveillance Frequently Asked Questions expand Contact Us File Formats Help: How do I view different file formats (PDF, DOC, PPT, MPEG) on this site? Adobe PDF file Microsoft PowerPoint file Microsoft Word file Microsoft Excel file Audio/Video file Apple Quicktime file RealPlayer file Text file Zip Archive file SAS file ePub file CONTACT CDC-INFO Have questions? We have answers. 1-800-CDC-INFO (800-232-4636) TTY: 888-232-6348 Email CDC-INFO CDC INFORMATION About CDC Jobs Funding Policies File Viewers &amp; Players Privacy FOIA No Fear Act OIG Nondiscrimination CONNECT WITH CDC Facebook Twitter Youtube Instagram Syndicate CDC TV RSS Email U.S. Department of Health &amp; Human Services USA.gov CDC Website Exit Disclaimer Follow CDC Email Recommend Tweet Post RSS CDC Media Listen Watch eCards YouTube TOP",
    "cover": "https://images.unsplash.com/photo-1521292270410-a8c4d716d518?auto=format&fit=crop&w=1600&q=60"
  },
  {
    "slug": "welcome-post",
    "title": "Welcome to AventurOO",
    "category": "News",
    "date": "2025-08-29",
    "excerpt": "This is your first post. Auto-posting will add new ones here.",
    "cover": "https://images.unsplash.com/photo-1500534314209-a25ddb2bd429?auto=format&fit=crop&w=1600&q=60"
  }
]