[
  {
    "slug": "level-2-diphtheria-in-guinea",
    "title": "Level 2 - Diphtheria in Guinea",
    "category": "News",
    "date": "2025-08-31",
    "excerpt": "Diphtheria in Guinea - Level 2 - Level 2 - Practice Enhanced Precautions - Travel Health Notices | Travelers&#39; Health | CDC --> Skip directly to site content Skip directly to page options Skip directly to A-Z link Skip directly to A-Z link Skip directly to A-Z link You are using an outdated browser. Upgrade your browser today or install Google Chrome Frame to better experience this site. Centers for Disease Control and Prevention. CDC twenty four seven. Saving Lives, Protecting People &nbsp;Travelers' Health Search Submit Note: Javascript is disabled or is not supported by your browser. For this reason, some items on this page will be unavailable. For more information about this message, please visit this page: About CDC.gov . Travelers' Health Facebook Twitter LinkedIn Syndicate Diphtheria in Guinea Level 4 - Avoid All Travel Level 3 - Reconsider Nonessential Travel Level 2 - Practice Enhanced Precautions Level 1 - Practice Usual Precautions Key points There are confirmed and suspect&nbsp;cases of diphtheria in the Kankan region of&nbsp;Guinea (see map). Vaccination against diphtheria is essential to protect against disease. If you are traveling to an affected area, you should be up to date with your diphtheria vaccines . Before travel, discuss the need for a booster dose with your healthcare professional. Avoid contact with persons with symptoms of diphtheria, such as fever, sore throat, difficulty swallowing, change in voice, shortness of breath, weakness, or fatigue. Avoid touching the wounds of others. Cover your nose and mouth with a tissue when you cough or sneeze. Wash your hands often with soap and water. If you feel sick during travel, seek medical care immediately . If you are unvaccinated or not fully vaccinated against diphtheria and become sick after possible exposure to someone with diphtheria, it is important to start treatment &nbsp;as soon as possible. If you feel sick after returning from travel, seek medical care immediately. Tell your healthcare professional about your diphtheria vaccination status and your recent travel, including where you went and what you did. For Clinicians All travelers 2 months and older traveling to outbreak areas should receive an age-appropriate dose of a diphtheria toxoid-containing vaccine if they are not fully vaccinated or if they have not received a booster dose within 5 years prior to departure. Traveler Information Health Information for Travelers to Guinea Diphtheria Homepage Diphtheria Vaccine Information Clinician Information Diphtheria Vaccination Diphtheria Clinical Information Map: Area of&nbsp; confirmed and suspect cases of&nbsp;diphtheria in Guinea &nbsp;( see larger map ) What is Diphtheria? Diphtheria is a serious infection caused by strains of Corynebacterium diphtheriae bacteria that make a toxin. The toxin can cause people to get very sick. Diphtheria bacteria spread from person to person through respiratory droplets, like from coughing or sneezing. People can also get sick from touching open sores or ulcers of people sick with diphtheria. When the bacteria get into the respiratory system they can cause sore throat, mild fever, and swollen glands in the neck. The bacteria make a toxin that kills healthy tissues in the respiratory system and can make it difficult to breathe and swallow. The toxin can also cause heart, nerve, and kidney problems if it enters the bloodstream. Skin infections caused by&nbsp; C. diphtheriae&nbsp; typically consist of shallow ulcers (sores) and do not result in severe disease. For some people, respiratory diphtheria can lead to death. Even with treatment, about 1 in 10 patients with respiratory diphtheria die. Without treatment, up to half of patients can die from the disease. If you are unvaccinated or not fully vaccinated against diphtheria and may have been exposed, it is important to start&nbsp; treatment &nbsp;as soon as possible.&nbsp;&nbsp; CDC recommends that everyone 2 months and older get vaccinated to protect against diphtheria. &nbsp; Page created: September 15, 2023 --> Page last updated: April 23, 2024 --> Page last reviewed: July 22, 2025 Content source: National Center for Emerging and Zoonotic Infectious Diseases (NCEZID) Division of Global Migration Health (DGMH) Home Travelers Health Destinations Travel Notices expand Diphtheria in Guinea Advice for Travelers expand Adventure Travel After Travel Tips Allergies and Travel Avoid Animals Before You Travel Blood Clots Bug Bites Business Travel Cold Weather and Travel Counterfeit Medicines Cruise Ship Travel During Travel Tips Food Poisoning from Seafood Food and Drinks Health Care During Travel expand Obtención de atención médica en el extranjero High Altitudes Holiday Travel Heat Illnesses Humanitarian Aid Workers Travel Insurance Jet Lag Last-Minute Travel Long-Term Travel Mass Gatherings Medical Tourism Mental Health Motion Sickness Natural Disasters Older Adults Pack Smart Pregnant Travelers Road Safety Routine Vaccines Sex Tourism Spring Break Travel STIs Study Abroad Summer Travel Sun Exposure Tick Bites Travel Vaccines Traveler Survival Guide Traveling Abroad with Medicine Traveling with Children Traveling with Your Pet Travelers' Diarrhea Travelers with Chronic Illnesses Travelers with Disability Travelers with Weakened Immune Systems Visiting Friends or Relatives Avoid Contaminated Water During Travel Swimming and Diving Safety RSS Feeds Find a Clinic expand Yellow Fever Vaccination Clinics expand FAQ Clinician Resources expand Clinical Updates ICVP Yellow Fever Vaccine Course Cholera Information for Health Care Professionals Pre-Travel Quick Guide Think Travel Vaccine Guide Patient Counseling Training Courses CDC Yellow Book Research and Surveillance expand Traveler-based Genomic Surveillance Frequently Asked Questions expand Contact Us File Formats Help: How do I view different file formats (PDF, DOC, PPT, MPEG) on this site? Adobe PDF file Microsoft PowerPoint file Microsoft Word file Microsoft Excel file Audio/Video file Apple Quicktime file RealPlayer file Text file Zip Archive file SAS file ePub file CONTACT CDC-INFO Have questions? We have answers. 1-800-CDC-INFO (800-232-4636) TTY: 888-232-6348 Email CDC-INFO CDC INFORMATION About CDC Jobs Funding Policies File Viewers &amp; Players Privacy FOIA No Fear Act OIG Nondiscrimination CONNECT WITH CDC Facebook Twitter Youtube Instagram Syndicate CDC TV RSS Email U.S. Department of Health &amp; Human Services USA.gov CDC Website Exit Disclaimer Follow CDC Email Recommend Tweet Post RSS CDC Media Listen Watch eCards YouTube TOP",
    "cover": "https://images.unsplash.com/photo-1500534314209-a25ddb2bd429?auto=format&fit=crop&w=1600&q=60"
  },
  {
    "slug": "level-2-clade-ii-mpox-in-liberia-and-sierra-leone",
    "title": "Level 2 - Clade II Mpox in Liberia and Sierra Leone",
    "category": "News",
    "date": "2025-08-31",
    "excerpt": "Clade II Mpox in Liberia and Sierra Leone - Level 2 - Level 2 - Practice Enhanced Precautions - Travel Health Notices | Travelers&#39; Health | CDC --> Skip directly to site content Skip directly to page options Skip directly to A-Z link Skip directly to A-Z link Skip directly to A-Z link You are using an outdated browser. Upgrade your browser today or install Google Chrome Frame to better experience this site. Centers for Disease Control and Prevention. CDC twenty four seven. Saving Lives, Protecting People &nbsp;Travelers' Health Search Submit Note: Javascript is disabled or is not supported by your browser. For this reason, some items on this page will be unavailable. For more information about this message, please visit this page: About CDC.gov . Travelers' Health Facebook Twitter LinkedIn Syndicate Clade II Mpox in Liberia and Sierra Leone Level 4 - Avoid All Travel Level 3 - Reconsider Nonessential Travel Level 2 - Practice Enhanced Precautions Level 1 - Practice Usual Precautions Liberia and Sierra Leone ( View larger ) What is&nbsp;mpox? Mpox &nbsp;is a disease caused by infection with&nbsp; Monkeypox virus . Mpox is endemic in forested areas of Central and West Africa. Both clades of mpox &nbsp;can be spread, treated, and prevented the same way, but affected populations and geographic spread can be very different. People in recent outbreaks usually get mpox through intimate or close contact, including sex or massage, with an infected person. Mpox can also be transmitted through contact with the skin lesions or bodily fluids of infected wild animals (alive or dead in endemic areas) or humans through contact with materials contaminated with the virus such as bedding, clothing, and dishes. Symptoms often include fever (&ge;100.4&deg;F), rash, headache, muscle aches, and swollen lymph nodes. Fever is not always present. There is a&nbsp; vaccine &nbsp;available for mpox for those with certain risk factors. Key points There are outbreaks of clade II mpox in Liberia and Sierra Leone, where mpox is endemic. Unlike&nbsp; the ongoing global clade II mpox outbreak that began in 2022 , which has primarily affected gay, bisexual, and other men who have sex with men (MSM), these&nbsp;outbreaks have&nbsp;affected males and females approximately equally.&nbsp; Person-to-person transmission has occurred during this outbreak, including through sexual or other intimate contact. Mpox vaccination is&nbsp; recommended &nbsp;for travelers to Liberia and Sierra Leone&nbsp;who anticipate the following sexual activities (regardless of sexual orientation) during travel to certain countries with sustained person-to-person transmission of clade II mpox: Sex with a new partner Sex at a commercial sex venue (e.g., sex club or bathhouse) Sex or intimate contact (e.g. massage) in exchange for money, goods, drugs, or other trade Sex in association with a large public event (e.g., rave, party, or festival) For those&nbsp; recommended to receive mpox vaccination , get two doses of the JYNNEOS vaccine at least 28 days apart. If you are at risk for mpox and have only received one dose, get a second dose as soon as possible. It takes about two weeks after the second dose for maximum protection against mpox. Be sure to plan ahead. Whether or not you&rsquo;re fully vaccinated when you travel,&nbsp; protect yourself from mpox .&nbsp; All people should avoid&nbsp; situations &nbsp;that might increase their risk for mpox, but especially people with&nbsp; risk factors for infection &nbsp;and/or who are at risk for&nbsp; severe disease &nbsp;(e.g., pregnant women, infants younger than 1 year, people with eczema or active skin conditions, and people who are immunocompromised).&nbsp; If you travel to Liberia or&nbsp;Sierra Leone: Learn more about which&nbsp; activities may increase your risk for mpox &nbsp;and how you can reduce your risk of mpox, including getting vaccinated if you are eligible. Avoid close contact with people who are sick with&nbsp; signs and symptoms of mpox , including those with skin or genital lesions. Avoid contact with contaminated materials used by people who are sick (such as clothing, bedding, or materials used in healthcare settings) or that came into contact with wild animals. Avoid contact with wild animals (alive or dead), such as small mammals, including rodents (rats, squirrels), and non-human primates (monkeys, apes). Avoid eating or preparing meat from wild animals ( bushmeat ) or using products (creams, lotions, powders) derived from wild animals. Seek medical care immediately if you develop new,&nbsp; unexplained skin rash (lesions on any part of the body), with or without fever and chills , and avoid contact with others. Tell your doctor or healthcare provider where you traveled during the last 21 days before developing symptoms. If you are sick and could have mpox, follow isolation and infection control measures&nbsp; at home &nbsp;and&nbsp; during travel . See additional information about&nbsp; what to do if you are sick &nbsp;with mpox. Traveler Information Health Information for Travelers to Liberia Health Information for Travelers to Sierra Leone Travelers&rsquo; Health: Avoid Animals Mpox Vaccination | Mpox | CDC About Mpox | Mpox | CDC Preventing Mpox While Traveling | Mpox | CDC Clinician Information Clinical Overview of Mpox | Mpox | CDC Veterinary Guidance for Mpox | Mpox | CDC Sex &amp; Travel &nbsp;in the CDC Yellow Book (Health Information for International Travel) Page created: July 22, 2025 --> Page last updated: July 22, 2025 --> Page last reviewed: July 22, 2025 Content source: National Center for Emerging and Zoonotic Infectious Diseases (NCEZID) Division of Global Migration Health (DGMH) Home Travelers Health Destinations Travel Notices expand Mpox in Liberia and Sierra Leone Advice for Travelers expand Adventure Travel After Travel Tips Allergies and Travel Avoid Animals Before You Travel Blood Clots Bug Bites Business Travel Cold Weather and Travel Counterfeit Medicines Cruise Ship Travel During Travel Tips Food Poisoning from Seafood Food and Drinks Health Care During Travel expand Obtención de atención médica en el extranjero High Altitudes Holiday Travel Heat Illnesses Humanitarian Aid Workers Travel Insurance Jet Lag Last-Minute Travel Long-Term Travel Mass Gatherings Medical Tourism Mental Health Motion Sickness Natural Disasters Older Adults Pack Smart Pregnant Travelers Road Safety Routine Vaccines Sex Tourism Spring Break Travel STIs Study…",
    "cover": "https://images.unsplash.com/photo-1531306728370-e2ebd9d7bb99?auto=format&fit=crop&w=1600&q=60"
  },
  {
    "slug": "level-2-global-polio",
    "title": "Level 2 - Global Polio",
    "category": "News",
    "date": "2025-08-31",
    "excerpt": "Global Polio - Level 2 - Level 2 - Practice Enhanced Precautions - Travel Health Notices | Travelers&#39; Health | CDC --> Skip directly to site content Skip directly to page options Skip directly to A-Z link Skip directly to A-Z link Skip directly to A-Z link You are using an outdated browser. Upgrade your browser today or install Google Chrome Frame to better experience this site. Centers for Disease Control and Prevention. CDC twenty four seven. Saving Lives, Protecting People &nbsp;Travelers' Health Search Submit Note: Javascript is disabled or is not supported by your browser. For this reason, some items on this page will be unavailable. For more information about this message, please visit this page: About CDC.gov . Travelers' Health Facebook Twitter LinkedIn Syndicate Global Polio Level 4 - Avoid All Travel Level 3 - Reconsider Nonessential Travel Level 2 - Practice Enhanced Precautions Level 1 - Practice Usual Precautions Key points Some international destinations have circulating poliovirus (listed below and shown in map). Before any international travel, make sure you are up to date on your polio vaccines. Before travel to any destination listed below, adults who previously completed the full, routine polio vaccine series may receive a single, lifetime booster dose of polio vaccine. Map: Countries where poliovirus has been detected within last 12 months ( see larger map ) What is polio? Polio is a crippling and potentially deadly disease that affects the nervous system. Good hand washing practices can help prevent the spread of this disease. Because the virus that causes polio lives in the feces (poop) of an infected person, people infected with the disease can spread it to others when they do not wash their hands well after defecating (pooping). People can also be infected if they drink water or eat food contaminated with infected feces. Most people with polio do not feel sick. Some people have only minor symptoms, such as fever, tiredness, nausea, headache, nasal congestion, sore throat, cough, stiffness in the neck and back, and pain in the arms and legs. In rare cases, polio infection causes permanent loss of muscle function (paralysis). Polio can be fatal if the muscles used for breathing are paralyzed or if there is an infection of the brain. What is the current situation? The following destinations have circulating poliovirus (see map): Afghanistan Algeria Angola Benin Burkina Faso Cameroon Central African Republic Chad C&ocirc;te d&#39;Ivoire Democratic Republic of the Congo Djibouti Egypt Ethiopia Finland French Guiana Gaza Germany Ghana Guinea Indonesia Israel Kenya Liberia Niger Nigeria Pakistan Papua New Guinea Poland Senegal Sierra Leone Somalia South Sudan Spain Sudan Tanzania Uganda United Kingdom Yemen Zimbabwe What can travelers do to prevent polio? Get the polio vaccine Children and adults should be up to date on their routine polio vaccines . Adult travelers may get an&nbsp;inactivated polio vaccine booster&nbsp;if they: are going to a destination that has circulating poliovirus; have completed their routine polio vaccine series; and have not already received one adult booster dose. Clinician Information Ensure that anyone unvaccinated or incompletely vaccinated completes the routine&nbsp; polio vaccine series before international travel . Additional Information Poliomyelitis in Epidemiology and Prevention of Vaccine-Preventable Diseases &mdash; The Pink Book Polio Vaccination: Information for Healthcare Professionals CDC Yellow Book: Poliomyelitis Traveler Information Polio Vaccination for International Travelers About Polio CDC Travelers&rsquo; Health: Choose Safe Food and Drinks When Traveling Polio Vaccine Information&nbsp;Statement &nbsp; Page created: September 26, 2022 --> Page last updated: August 04, 2025 --> Page last reviewed: August 04, 2025 Content source: National Center for Emerging and Zoonotic Infectious Diseases (NCEZID) Division of Global Migration Health (DGMH) Home Travelers Health Destinations Travel Notices expand Global Polio Advice for Travelers expand Adventure Travel After Travel Tips Allergies and Travel Avoid Animals Before You Travel Blood Clots Bug Bites Business Travel Cold Weather and Travel Counterfeit Medicines Cruise Ship Travel During Travel Tips Food Poisoning from Seafood Food and Drinks Health Care During Travel expand Obtención de atención médica en el extranjero High Altitudes Holiday Travel Heat Illnesses Humanitarian Aid Workers Travel Insurance Jet Lag Last-Minute Travel Long-Term Travel Mass Gatherings Medical Tourism Mental Health Motion Sickness Natural Disasters Older Adults Pack Smart Pregnant Travelers Road Safety Routine Vaccines Sex Tourism Spring Break Travel STIs Study Abroad Summer Travel Sun Exposure Tick Bites Travel Vaccines Traveler Survival Guide Traveling Abroad with Medicine Traveling with Children Traveling with Your Pet Travelers' Diarrhea Travelers with Chronic Illnesses Travelers with Disability Travelers with Weakened Immune Systems Visiting Friends or Relatives Avoid Contaminated Water During Travel Swimming and Diving Safety RSS Feeds Find a Clinic expand Yellow Fever Vaccination Clinics expand FAQ Clinician Resources expand Clinical Updates ICVP Yellow Fever Vaccine Course Cholera Information for Health Care Professionals Pre-Travel Quick Guide Think Travel Vaccine Guide Patient Counseling Training Courses CDC Yellow Book Research and Surveillance expand Traveler-based Genomic Surveillance Frequently Asked Questions expand Contact Us File Formats Help: How do I view different file formats (PDF, DOC, PPT, MPEG) on this site? Adobe PDF file Microsoft PowerPoint file Microsoft Word file Microsoft Excel file Audio/Video file Apple Quicktime file RealPlayer file Text file Zip Archive file SAS file ePub file CONTACT CDC-INFO Have questions? We have answers. 1-800-CDC-INFO (800-232-4636) TTY: 888-232-6348 Email CDC-INFO CDC INFORMATION About CDC Jobs Funding Policies File Viewers &amp; Players Privacy FOIA No Fear Act OIG Nondiscrimination CONNECT WITH CDC Facebook Twitter Youtube Instagram Syndicate CDC TV RSS Email U.S. Department of Health &amp; Human Services USA.gov CDC Website Exit Disclaimer Follow CDC Email Recommend Tweet Post RSS CDC Media Listen Watch eCards YouTube TOP",
    "cover": "https://images.unsplash.com/photo-1521292270410-a8c4d716d518?auto=format&fit=crop&w=1600&q=60"
  },
  {
    "slug": "level-1-global-dengue",
    "title": "Level 1 - Global Dengue",
    "category": "News",
    "date": "2025-08-30",
    "excerpt": "Global Dengue - Level 1 - Level 1 - Practice Usual Precautions - Travel Health Notices | Travelers&#39; Health | CDC --> Skip directly to site content Skip directly to page options Skip directly to A-Z link Skip directly to A-Z link Skip directly to A-Z link You are using an outdated browser. Upgrade your browser today or install Google Chrome Frame to better experience this site. Centers for Disease Control and Prevention. CDC twenty four seven. Saving Lives, Protecting People &nbsp;Travelers' Health Search Submit Note: Javascript is disabled or is not supported by your browser. For this reason, some items on this page will be unavailable. For more information about this message, please visit this page: About CDC.gov . Travelers' Health Facebook Twitter LinkedIn Syndicate Global Dengue Level 4 - Avoid All Travel Level 3 - Reconsider Nonessential Travel Level 2 - Practice Enhanced Precautions Level 1 - Practice Usual Precautions Key points&nbsp; Dengue is a year-round risk in many parts of the world, with outbreaks commonly occurring every 2&ndash;5 years. Some countries are reporting increased numbers of cases of the disease. Dengue is spread by mosquito bites. Travelers to risk areas should prevent mosquito bites by using an EPA-registered insect repellent , wearing long-sleeved shirts and long pants when outdoors, and sleeping in an air-conditioned room or room with window screens. Countries reporting higher-than-usual number of dengue cases ( View larger ) What is dengue? Dengue is a disease caused by a virus spread through mosquito bites. The disease can take up to 2 weeks to develop with illness generally lasting less than a week. Symptoms from dengue include fever, headache, nausea, vomiting, rash, muscle and joint pain, and minor bleeding. Dengue can become severe within a few hours. Severe dengue is a medical emergency, usually requiring hospitalization. In severe cases, health effects can include hemorrhage (uncontrolled bleeding), shock (seriously low blood pressure), organ failure, and death.&nbsp; What is the current situation? The countries listed below are reporting higher than usual numbers of cases, or CDC has identified a higher-than-expected number of dengue cases among U.S. travelers returning from those countries. Travelers visiting these countries may be at increased risk: Bangladesh Cook Islands Colombia Comoros Cuba El Salvador Fiji French Polynesia Guatemala Kiribati Mali Mexico Nauru Panama Philippines Samoa Tonga Tuvalu Countries are added to this list based on publicly available data. Not all countries with dengue transmission are on this list. Travelers should practice prevention measures for all areas with a risk of dengue . Traveler Information CDC dengue homepage Dengue Around the World Clinician Information Dengue in CDC&nbsp;Yellow Book Dengue information for health care professionals *Based on ArboNET modeling which considers historical data about dengue cases among travelers to each country, from 2010 to present. It calculates the expected number of travelers with dengue returning from each country monthly to account for dengue seasonality. If the number of dengue cases in travelers is higher than expected (using an 80% threshold) for that month, dengue transmission is considered &lsquo;high&rsquo;. ArboNET is the national arboviral surveillance system that maintains data on arboviral infections among humans, presumptive viremic blood doners, veterinary disease cases, mosquitoes, dead birds, and sentinel animals. ArboNET is managed by CDC and state health departments and relies on the clinical diagnoses, testing, and reporting of arboviral diseases to public health authorities. &nbsp; Page created: June 20, 2024 --> Page last updated: August 21, 2025 --> Page last reviewed: August 21, 2025 Content source: National Center for Emerging and Zoonotic Infectious Diseases (NCEZID) Division of Global Migration Health (DGMH) Home Travelers Health Destinations Travel Notices expand Global Dengue Advice for Travelers expand Adventure Travel After Travel Tips Allergies and Travel Avoid Animals Before You Travel Blood Clots Bug Bites Business Travel Cold Weather and Travel Counterfeit Medicines Cruise Ship Travel During Travel Tips Food Poisoning from Seafood Food and Drinks Health Care During Travel expand Obtención de atención médica en el extranjero High Altitudes Holiday Travel Heat Illnesses Humanitarian Aid Workers Travel Insurance Jet Lag Last-Minute Travel Long-Term Travel Mass Gatherings Medical Tourism Mental Health Motion Sickness Natural Disasters Older Adults Pack Smart Pregnant Travelers Road Safety Routine Vaccines Sex Tourism Spring Break Travel STIs Study Abroad Summer Travel Sun Exposure Tick Bites Travel Vaccines Traveler Survival Guide Traveling Abroad with Medicine Traveling with Children Traveling with Your Pet Travelers' Diarrhea Travelers with Chronic Illnesses Travelers with Disability Travelers with Weakened Immune Systems Visiting Friends or Relatives Avoid Contaminated Water During Travel Swimming and Diving Safety RSS Feeds Find a Clinic expand Yellow Fever Vaccination Clinics expand FAQ Clinician Resources expand Clinical Updates ICVP Yellow Fever Vaccine Course Cholera Information for Health Care Professionals Pre-Travel Quick Guide Think Travel Vaccine Guide Patient Counseling Training Courses CDC Yellow Book Research and Surveillance expand Traveler-based Genomic Surveillance Frequently Asked Questions expand Contact Us File Formats Help: How do I view different file formats (PDF, DOC, PPT, MPEG) on this site? Adobe PDF file Microsoft PowerPoint file Microsoft Word file Microsoft Excel file Audio/Video file Apple Quicktime file RealPlayer file Text file Zip Archive file SAS file ePub file CONTACT CDC-INFO Have questions? We have answers. 1-800-CDC-INFO (800-232-4636) TTY: 888-232-6348 Email CDC-INFO CDC INFORMATION About CDC Jobs Funding Policies File Viewers &amp; Players Privacy FOIA No Fear Act OIG Nondiscrimination CONNECT WITH CDC Facebook Twitter Youtube Instagram Syndicate CDC TV RSS Email U.S. Department of Health &amp; Human Services USA.gov CDC Website Exit Disclaimer Follow CDC Email Recommend Tweet Post RSS CDC Media Listen Watch eCards YouTube TOP",
    "cover": "https://images.unsplash.com/photo-1500534314209-a25ddb2bd429?auto=format&fit=crop&w=1600&q=60"
  },
  {
    "slug": "level-2-chikungunya-in-china",
    "title": "Level 2 - Chikungunya in China",
    "category": "News",
    "date": "2025-08-30",
    "excerpt": "Chikungunya in China - Level 2 - Level 2 - Practice Enhanced Precautions - Travel Health Notices | Travelers&#39; Health | CDC --> Skip directly to site content Skip directly to page options Skip directly to A-Z link Skip directly to A-Z link Skip directly to A-Z link You are using an outdated browser. Upgrade your browser today or install Google Chrome Frame to better experience this site. Centers for Disease Control and Prevention. CDC twenty four seven. Saving Lives, Protecting People &nbsp;Travelers' Health Search Submit Note: Javascript is disabled or is not supported by your browser. For this reason, some items on this page will be unavailable. For more information about this message, please visit this page: About CDC.gov . Travelers' Health Facebook Twitter LinkedIn Syndicate Chikungunya in China Level 4 - Avoid All Travel Level 3 - Reconsider Nonessential Travel Level 2 - Practice Enhanced Precautions Level 1 - Practice Usual Precautions Key points There is an outbreak of chikungunya in Guangdong Province, China. Most cases have been reported in Foshan city (see map). Mosquitoes spread the virus that causes chikungunya. You can protect yourself by preventing mosquito bites , which includes using insect repellent; wearing long-sleeved shirts and pants; and staying in places with air conditioning or that have screens on the windows and&nbsp;&nbsp;doors.&nbsp; Vaccination is recommended for travelers who are visiting an area with a chikungunya outbreak. &nbsp; If you are pregnant, reconsider travel to the affected areas, particularly if you are close to delivering your baby. Mothers infected around the time of delivery can pass the virus to their baby before or during delivery. Newborns infected in this way or by a mosquito bite are at risk for severe illness, including poor long-term&nbsp;outcomes. In general, vaccination against chikungunya should be deferred until after delivery. However, when the risk of infection is high and exposure cannot be avoided, pregnant travelers should discuss with their healthcare provider the potential risks (to themselves and their babies) of chikungunya virus infection and the potential benefits and risks of vaccination so that vaccination can be&nbsp;considered. Seek medical care immediately if you develop fever, joint pain, headache, muscle pain, joint swelling, or rash during or after travel. For Clinicians Review information on&nbsp; chikungunya vaccination .&nbsp; Healthcare providers should discuss the benefits and risks of vaccination with individual travelers based on their age, underlying health conditions, destination, trip duration, and planned activities. Traveler Information Health Information for Travelers to China CDC Chikungunya Website Chikungunya vaccines Avoid Bug Bites Clinician Information Chikungunya in the CDC Yellow Book (Health Information for International Travel) Treatment and Prevention of Chikungunya Virus Disease Chikungunya Vaccine Information for Healthcare Providers Map of Guangdong Province, China ( View larger ) What is chikungunya? Chikungunya disease is caused by the chikungunya virus and is spread to humans through mosquito bites. Outbreaks have occurred in countries in Africa, Americas, Asia, Europe, the Caribbean, and Indian and Pacific Oceans. Most people infected with chikungunya virus develop some symptoms. Symptoms of chikungunya usually begin 3 &ndash; 7 days after a bite by an infected mosquito. The most common symptoms are fever and joint pain. Other symptoms may include headache, muscle pain, joint swelling, or rash. Most people get better within a week; however, some can have severe joint pain for months to years following acute illness. People at risk for more severe disease include newborns infected around the time of birth, older adults (65 years or older), and people with medical conditions such as diabetes or heart disease. Death from chikungunya is&nbsp;rare.&nbsp; There&nbsp;is no specific treatment for chikungunya. &nbsp; Page created: August 01, 2025 --> Page last updated: August 26, 2025 --> Page last reviewed: August 26, 2025 Content source: National Center for Emerging and Zoonotic Infectious Diseases (NCEZID) Division of Global Migration Health (DGMH) Home Travelers Health Destinations Travel Notices expand Chikungunya in China Advice for Travelers expand Adventure Travel After Travel Tips Allergies and Travel Avoid Animals Before You Travel Blood Clots Bug Bites Business Travel Cold Weather and Travel Counterfeit Medicines Cruise Ship Travel During Travel Tips Food Poisoning from Seafood Food and Drinks Health Care During Travel expand Obtención de atención médica en el extranjero High Altitudes Holiday Travel Heat Illnesses Humanitarian Aid Workers Travel Insurance Jet Lag Last-Minute Travel Long-Term Travel Mass Gatherings Medical Tourism Mental Health Motion Sickness Natural Disasters Older Adults Pack Smart Pregnant Travelers Road Safety Routine Vaccines Sex Tourism Spring Break Travel STIs Study Abroad Summer Travel Sun Exposure Tick Bites Travel Vaccines Traveler Survival Guide Traveling Abroad with Medicine Traveling with Children Traveling with Your Pet Travelers' Diarrhea Travelers with Chronic Illnesses Travelers with Disability Travelers with Weakened Immune Systems Visiting Friends or Relatives Avoid Contaminated Water During Travel Swimming and Diving Safety RSS Feeds Find a Clinic expand Yellow Fever Vaccination Clinics expand FAQ Clinician Resources expand Clinical Updates ICVP Yellow Fever Vaccine Course Cholera Information for Health Care Professionals Pre-Travel Quick Guide Think Travel Vaccine Guide Patient Counseling Training Courses CDC Yellow Book Research and Surveillance expand Traveler-based Genomic Surveillance Frequently Asked Questions expand Contact Us File Formats Help: How do I view different file formats (PDF, DOC, PPT, MPEG) on this site? Adobe PDF file Microsoft PowerPoint file Microsoft Word file Microsoft Excel file Audio/Video file Apple Quicktime file RealPlayer file Text file Zip Archive file SAS file ePub file CONTACT CDC-INFO Have questions? We have answers. 1-800-CDC-INFO (800-232-4636) TTY: 888-232-6348 Email CDC-INFO CDC INFORMATION About CDC Jobs Funding Policies File Viewers &amp; Players Privacy FOIA No Fear Act OIG Nondiscrimination CONNECT WITH CDC Facebook Twitter Youtube Instagram Syndicate CDC TV RSS Email U.S. Department of Health &amp; Human Services USA.gov CDC Website Exit Disclaimer Follow CDC Email Recommend Tweet Post RSS CDC Media Listen Watch eCards YouTube TOP",
    "cover": "https://images.unsplash.com/photo-1531306728370-e2ebd9d7bb99?auto=format&fit=crop&w=1600&q=60"
  },
  {
    "slug": "level-2-chikungunya-in-the-region-of-the-indian-ocean",
    "title": "Level 2 - Chikungunya in the Region of the Indian Ocean",
    "category": "News",
    "date": "2025-08-30",
    "excerpt": "Chikungunya in the Region of the Indian Ocean - Level 2 - Level 2 - Practice Enhanced Precautions - Travel Health Notices | Travelers&#39; Health | CDC --> Skip directly to site content Skip directly to page options Skip directly to A-Z link Skip directly to A-Z link Skip directly to A-Z link You are using an outdated browser. Upgrade your browser today or install Google Chrome Frame to better experience this site. Centers for Disease Control and Prevention. CDC twenty four seven. Saving Lives, Protecting People &nbsp;Travelers' Health Search Submit Note: Javascript is disabled or is not supported by your browser. For this reason, some items on this page will be unavailable. For more information about this message, please visit this page: About CDC.gov . Travelers' Health Facebook Twitter LinkedIn Syndicate Chikungunya in the Region of the Indian Ocean Level 4 - Avoid All Travel Level 3 - Reconsider Nonessential Travel Level 2 - Practice Enhanced Precautions Level 1 - Practice Usual Precautions Map: Countries in the region with chikungunya outbreaks &nbsp;( see larger map ) What is&nbsp;chikungunya? Chikungunya disease is caused by the chikungunya virus and is spread to humans through mosquito bites. Outbreaks have occurred in countries in Africa, Americas, Asia, Europe, the Caribbean, and Indian and Pacific Oceans. Most people infected with chikungunya virus develop some symptoms. Symptoms of chikungunya usually begin 3&ndash;7 days after a bite by an infected mosquito. The most common symptoms are fever and joint pain. Other symptoms may include headache, muscle pain, joint swelling, or rash. Most people get better within a week; however, some can have severe joint pain for months to years following acute illness. People at risk for more severe disease include newborns infected around the time of birth, older adults (65 years or older), and people with medical conditions such as diabetes or heart disease. Death from chikungunya is rare. There is no specific treatment for chikungunya. Key points There are outbreaks of chikungunya in Kenya, Madagascar, Somalia, and Sri Lanka (see map). Mosquitoes spread the virus that causes chikungunya. You can protect yourself by preventing mosquito bites , which includes using insect repellent; wearing long-sleeved shirts and pants; and staying in places with air conditioning or that have screens on the windows and doors. Vaccination is recommended for travelers who are visiting an area with a chikungunya outbreak.&nbsp; If you are pregnant, reconsider travel to the affected areas, particularly if you are close to delivering your baby. Mothers infected around the time of delivery can pass the virus to their baby before or during delivery. Newborns infected in this way or by a mosquito bite are at risk for severe illness, including poor long-term outcomes. In general, vaccination against chikungunya should be deferred until after delivery. However, when the risk of infection is high and exposure cannot be avoided, pregnant travelers should discuss with their healthcare provider the potential risks (to themselves and their babies) of chikungunya virus infection and the potential benefits and risks of vaccination so that vaccination can be considered. Seek medical care if you develop fever, joint pain, headache, muscle pain, joint swelling, or rash , during or after travel. For Clinicians Review information on&nbsp; chikungunya vaccination .&nbsp; Healthcare providers should discuss the benefits and risks of vaccination with individual travelers based on their age, underlying health conditions, destination, trip duration, and planned activities. Traveler Information Health Information for Travelers to Kenya Health Information for Travelers to Madagascar Health Information for Travelers to Somalia Health Information for Travelers to Sri Lanka CDC Chikungunya Website Chikungunya Vaccines Avoid Bug Bites Clinician Information Chikungunya in the CDC Yellow Book (Health Information for International Travel) Treatment and Prevention of Chikungunya Virus Disease Chikungunya Vaccine Information for Health Care Providers Page created: May 09, 2025 --> Page last updated: August 29, 2025 --> Page last reviewed: August 29, 2025 Content source: National Center for Emerging and Zoonotic Infectious Diseases (NCEZID) Division of Global Migration Health (DGMH) Home Travelers Health Destinations Travel Notices expand Chikungunya in the Region of the Indian Ocean Advice for Travelers expand Adventure Travel After Travel Tips Allergies and Travel Avoid Animals Before You Travel Blood Clots Bug Bites Business Travel Cold Weather and Travel Counterfeit Medicines Cruise Ship Travel During Travel Tips Food Poisoning from Seafood Food and Drinks Health Care During Travel expand Obtención de atención médica en el extranjero High Altitudes Holiday Travel Heat Illnesses Humanitarian Aid Workers Travel Insurance Jet Lag Last-Minute Travel Long-Term Travel Mass Gatherings Medical Tourism Mental Health Motion Sickness Natural Disasters Older Adults Pack Smart Pregnant Travelers Road Safety Routine Vaccines Sex Tourism Spring Break Travel STIs Study Abroad Summer Travel Sun Exposure Tick Bites Travel Vaccines Traveler Survival Guide Traveling Abroad with Medicine Traveling with Children Traveling with Your Pet Travelers' Diarrhea Travelers with Chronic Illnesses Travelers with Disability Travelers with Weakened Immune Systems Visiting Friends or Relatives Avoid Contaminated Water During Travel Swimming and Diving Safety RSS Feeds Find a Clinic expand Yellow Fever Vaccination Clinics expand FAQ Clinician Resources expand Clinical Updates ICVP Yellow Fever Vaccine Course Cholera Information for Health Care Professionals Pre-Travel Quick Guide Think Travel Vaccine Guide Patient Counseling Training Courses CDC Yellow Book Research and Surveillance expand Traveler-based Genomic Surveillance Frequently Asked Questions expand Contact Us File Formats Help: How do I view different file formats (PDF, DOC, PPT, MPEG) on this site? Adobe PDF file Microsoft PowerPoint file Microsoft Word file Microsoft Excel file Audio/Video file Apple Quicktime file RealPlayer file Text file Zip Archive file SAS file ePub file CONTACT CDC-INFO Have questions? We have answers. 1-800-CDC-INFO (800-232-4636) TTY: 888-232-6348 Email CDC-INFO CDC INFORMATION About CDC Jobs Funding Policies File Viewers &amp; Players Privacy FOIA No Fear Act OIG Nondiscrimination CONNECT WITH CDC Facebook Twitter Youtube Instagram Syndicate CDC TV RSS Email U.S. Department of Health &amp; Human Services USA.gov CDC Website Exit Disclaimer Follow CDC Email Recommend Tweet Post RSS CDC Media Listen Watch eCards YouTube TOP",
    "cover": "https://images.unsplash.com/photo-1521292270410-a8c4d716d518?auto=format&fit=crop&w=1600&q=60"
  },
  {
    "slug": "welcome-post",
    "title": "Welcome to AventurOO",
    "category": "News",
    "date": "2025-08-29",
    "excerpt": "This is your first post. Auto-posting will add new ones here.",
    "cover": "https://images.unsplash.com/photo-1500534314209-a25ddb2bd429?auto=format&fit=crop&w=1600&q=60"
  }
]