[
  {
    "slug": "how-much-can-a-giant-waterlily-hold-see-one-carry-183-pounds-before-si",
    "title": "How Much Can a Giant Waterlily Hold? See One Carry 183 Pounds Before Sinking, Winning a Social Media Contest",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "How Much Can a Giant Waterlily Hold? See One Carry 183 Pounds Before Sinking, Winning a Social Media Contest Now in its third year, the Waterlily Weigh-Off invites public gardens and zoos to show off the strength of their aquatic plants Giant waterlilies are known for their gorgeous white or pink flowers and green leaves, which float serenely atop the surface of lakes and streams. At first glance, these aquatic plants might seem delicate. But in reality, they’re incredibly strong. Earlier this month, the leaf of a giant waterlily at Florida’s Bok Tower Gardens supported 183 pounds before it started sinking, beating out other global competitors to be crowned champion of the 2025 Waterlily Weigh-Off. The weigh-off, which is now in its third year, is an annual social media contest organized by Denver Botanic Gardens. To enter the competition, horticulturists at public gardens and zoos across the globe film themselves stacking weighted objects atop one of their giant waterlily pads (or smaller lilies), noting the total weight the leaf was able to hold before dipping beneath the surface. According to Denver Botanic Gardens, the contest is a “playful opportunity” to educate the public about aquatic plants, specifically Victoria amazonica, Victoria cruziana and a mash-up of those two giant waterlily species called the Victoria ‘Longwood Hybrid.’ The leaves—also known as platters or pads—of these species can measure up to ten feet across. The pads can hold such an impressive amount of weight because of their structure. The bottom of each leaf consists of a “highly engineered network of radiating ribs and cross-veins,” per Denver Botanic Gardens. The ribs and veins form stiff compartments that trap pockets of air, which helps distribute weight across the leaf. The tops of the pads also have upturned edges, offering a barrier that can prevent water from spreading across the surface as the leaf gets weighed down. Scientists studying the mechanics of the plants’ unique leaves suggest they could one day help improve the engineering, design and construction of manmade buildings, especially floating structures. Fun fact: An enormous waterlily hidden in plain sight In 2022, scientists discovered the waterlily species Victoria boliviana after realizing it was distinct from the others. Then, the new species was certified as the biggest waterlily in the world. But giant waterlilies are not just strong—they’re also fierce. The bottoms of the leaves are covered in sharp, thorny spines, which help protect the plant from predators and encroachment from other plants. “Underneath is kind of cool, because they’re very dangerous,” says Kevin Bendetti, a horticulturist at Brookgreen Gardens in South Carolina, to the Post and Courier’s Lauren Leibman. This year, participants used everything from bricks and gin bottles to tea cakes and…",
    "cover": "https://tf-cmsv2-smithsonianmag-media.s3.amazonaws.com/filer_public/ed/bf/edbf11a0-be26-444e-aae2-2cd5c41a2b65/20250814_155406598_ios.jpg",
    "source": "https://www.smithsonianmag.com/smart-news/how-much-can-a-giant-waterlily-hold-see-one-carry-183-pounds-before-sinking-winning-a-social-media-contest-180987268/"
  },
  {
    "slug": "the-gun-linked-to-emmett-till-s-murder-is-now-on-display-at-a-museum-i",
    "title": "The Gun Linked to Emmett Till's Murder Is Now on Display at a Museum in Mississippi",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Gun Linked to Emmett Till’s Murder Is Now on Display at a Museum in Mississippi The weapon is thought to have belonged to J.W. Milam, one of the two men who kidnapped, tortured and killed the Black teenager for whistling at a white woman in a grocery store in 1955 After seven decades, the gun thought to have been used in the 1955 murder of Emmett Till is now on display in Mississippi. On August 28, the 70th anniversary of Till’s murder, the Mississippi Civil Rights Museum in Jackson unveiled an Ithaca .45 caliber pistol and its holster. Museum officials say the weapon belonged to J.W. Milam, one of the men who killed the Black 14-year-old for whistling at a white woman in a grocery store. The gun, which is now part of a permanent exhibition about Till’s lynching, is “a very hard thing to see,” says Nan Prince, director of collections for the Mississippi Department of Archives and History, the state agency that operates the museum. “This weapon has affected me more so than any other artifact that I’ve encountered in my 30-year museum career,” Prince tells Mississippi Today’s Simeon Gates. Quick fact: Emmett Till’s casket After Till was reburied in another coffin in 2005, his family donated his original casket to the Smithsonian’s National Museum of African American History and Culture. How did the gun end up at the museum? And where has it been for the past 70 years? Many of these details have not been made public. However, according to the New York Times’ Emily Cochrane and Audra D. S. Burch, the story starts around 2004, when filmmaker Keith Beauchamp first learned of the gun’s whereabouts. Beauchamp, who was working on a documentary about Till, shared what he knew about the gun with the FBI. The FBI reopened the case. Investigators performed various tests on the gun to determine whether it was linked to Till’s murder. However, their findings were inconclusive, per the Times. Later, journalist Wright Thompson heard about the gun from an FBI source while writing a book about the case, The Barn: The Secret History of a Murder in Mississippi, which was published last year. The weapon belonged to “a crop-duster pilot and his sister, who’d inherited it from their father,” Thompson writes in the Atlantic. “I don’t know how their father got it.” The family that owned the gun did not have a direct link to the Till case, according to the Times. The pilot and his sister had been storing the weapon in a safe-deposit box in a bank in Greenwood, Mississippi. Tommy Goodwin, deputy director at the Mississippi Department of Archives and History, read about the gun in Thompson’s…",
    "cover": "https://th-thumbnailer.cdn-si-edu.com/mrT4CYQJ_fIZX4ySMTU1zPiP_dk=/fit-in/1600x0/filters:focal(1024x575:1025x576)/https://tf-cmsv2-smithsonianmag-media.s3.amazonaws.com/filer_public/af/3c/af3c6334-d19e-4db1-8186-63a89327d794/539383389_1182039187292462_17200861569485898_n.jpg",
    "source": "https://www.smithsonianmag.com/smart-news/the-gun-linked-to-emmett-tills-murder-is-now-on-display-at-a-museum-in-mississippi-180987266/"
  },
  {
    "slug": "researchers-create-rechargeable-glow-in-the-dark-succulents",
    "title": "Researchers Create Rechargeable, Glow-in-the-Dark Succulents",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Researchers Create Rechargeable, Glow-in-the-Dark Succulents The team hopes their work, which is still in the early phases, might one day build the foundation for a novel sustainable lighting system Imagine walking through a garden after sunset. Instead of flicking the outdoor lights on, the space is already lit by a soft glow emanating from common houseplants lining the path. In a study published Wednesday in the journal Matter, researchers have taken a step toward making that scene a reality: Scientists created glow-in-the-dark succulents that recharge with exposure to light, in the hopes that they might pave the way for new sustainable lighting systems. The team injected plants with strontium aluminate, the same material in the glow-in-the-dark stars children sometimes stick to their bedroom ceilings. Strontium aluminate displays phosphorescence—meaning it absorbs energy from light, then releases it slowly—as opposed to bioluminescence, which is when an organism emits its own light via chemical reactions, as reported by the New York Times’ Cara Giaimo. Fun fact: Glowing plants Researchers in the 1980s introduced a gene from a firefly into a tobacco plant, making it perceptibly glow in total darkness. At first, the process was “continuous trial and error,” Shuting Liu, first author of the paper and a researcher at the South China Agricultural University, tells the New York Times. While other scientists had previously used strontium aluminate in plants, Liu and her colleagues sought a brighter and longer glow by injecting larger particles. The winning size for these particles was around seven micrometers (less than 0.0003 inches), or roughly equivalent to the width of a single red blood cell. Smaller particles made a dimmer glow, whereas larger particles couldn’t travel through plants very far. Several injections later, the researchers determined that succulents called Echeveria “Mebina” emitted a strong light, thanks to their leaves’ thin, uniform and evenly distributed channels, which enabled the particles to spread more successfully, according to a statement. The succulents produced an initial glow to rival that of a typical candle or small night light, then continued to glow more dimly for up to two hours—in different colors, depending on the injection. It only took a few minutes of exposure to the sun or LED light to charge the plant. Each plant costs around $1.40 to make, excluding labor, but they are prepared in just around ten minutes. “It was really unexpected,” Liu says in the statement. “The particles diffused in just seconds, and the entire succulent leaf glowed.” Scientists have already achieved luminous plants via genetic engineering, but this process is expensive and complicated—and it typically results in a weak glow that’s limited to the color green, according to the statement. Still, the newly injected succulents have their own…",
    "cover": "https://th-thumbnailer.cdn-si-edu.com/20maiyyRlkhXWIsJCPhhqKHczy8=/fit-in/1600x0/filters:focal(350x210:351x211)/https://tf-cmsv2-smithsonianmag-media.s3.amazonaws.com/filer_public/e2/a7/e2a73750-beea-4bd1-b993-bcc565792f8d/low-res_1_1.jpg",
    "source": "https://www.smithsonianmag.com/smart-news/researchers-create-rechargeable-glow-in-the-dark-succulents-180987265/"
  },
  {
    "slug": "america-s-largest-ever-exhibition-on-raphael-will-open-at-the-met-next",
    "title": "America's Largest-Ever Exhibition on Raphael Will Open at the Met Next Year",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "America’s Largest-Ever Exhibition on Raphael Will Open at the Met Next Year More than 200 of the Renaissance master’s works will be on display in the landmark show, which debuts in March 2026 The Metropolitan Museum of Art will host the largest-ever United States exhibition dedicated to Raphael next year, bringing together more than 200 of the Renaissance master’s works. “Raphael: Sublime Poetry” will feature loans from many of the world’s preeminent art museums, including Florence’s Uffizi, Madrid’s Prado, Rome’s Galleria Borghese and London’s British Museum. The rare three-month exhibition will not travel to another venue after its run at the Met. The show is curated by Carmen Bambach, a Met curator who specializes in Renaissance drawings. She has been piecing together the “logistically complex” exhibition since 2018, according to the Art Newspaper’s Benjamin Sutton. “The seven-year journey of putting together this exhibition has been an extraordinary chance to reframe my understanding of this monumental artist,” Bambach says in a statement. “It is a thrilling opportunity to engage with his unique artistic personality through the visual power, intellectual depth and tenderness of his imagery.” Bambach was also behind the Met’s blockbuster 2017 exhibition “Michelangelo: Divine Draftsman & Designer,” a show that attracted more than 700,000 visitors, making it one of the museum’s most popular shows of all time, per Artnet’s Jo Lawson-Tancred. Raffaello Sanzio da Urbino, better known as Raphael, is known for his serene and precise work, use of color and ability to convey emotion. Centuries after his death in 1520, he is still celebrated as one of the greatest painters to ever live. Quick fact: What are Raphael’s most famous works? The Italian artist’s best-known paintings include School of Athens, a significant fresco that towers over tourists in the Vatican, and Sistine Madonna, a Madonna and child oil painting that hangs in the Gemäldegalerie Alte Meister in Dresden, Germany. “Sublime Poetry” will explore the full breadth of Raphael’s career, covering what scholars consider to be his three periods, based on where he was living: Urbino, where he was born; Florence, where he “began to emerge as a peer to Leonardo da Vinci and Michelangelo”; and Rome, where he spent his final decade as a papal court painter, according to the statement. The exhibition will be organized chronologically. One of the show’s highlights is The Virgin and Child With Infant St. John the Baptist in a Landscape (The Alba Madonna) from the National Gallery of Art in Washington, D.C., a round-format painting, known as a tondo, in which Mary and a young John the Baptist gaze upon baby Jesus, handing him a cross. The tondo will be reunited with Raphael’s preparatory sketches and drawings, which will be on loan…",
    "cover": "https://th-thumbnailer.cdn-si-edu.com/rrb4JrViyNBpOcicS7L7IqtXTcQ=/fit-in/1600x0/filters:focal(750x500:751x501)/https://tf-cmsv2-smithsonianmag-media.s3.amazonaws.com/filer_public/d5/60/d560a5cb-481f-4625-8dc5-9b4c30e5fae3/raphael.jpg",
    "source": "https://www.smithsonianmag.com/smart-news/anericas-largest-ever-exhibition-on-raphael-will-open-at-the-met-next-year-180987252/"
  },
  {
    "slug": "astronomers-spot-a-rare-quadruple-star-system-in-the-milky-way-sheddin",
    "title": "Astronomers Spot a Rare Quadruple Star System in the Milky Way, Shedding Light on Mysterious Brown Dwarfs",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Astronomers Spot a Rare Quadruple Star System in the Milky Way, Shedding Light on Mysterious Brown Dwarfs The discovery can help astronomers better understand these little-known objects nicknamed “failed stars” Astronomers have discovered a first-of-its-kind quadruple star system in our own Milky Way, a surprising find that could help scientists better understand mysterious objects called brown dwarfs. Also known as “failed stars,” brown dwarfs form like normal stars but fail to gain enough mass to properly fuse hydrogen. These objects—something between a planet and a star—are notoriously difficult to study. They’re small, cold and faint, making them hard to detect. And determining a brown dwarf’s age also poses a challenge. That’s because, unlike stars, brown dwarfs continuously cool throughout their lifespan, so their characteristics are constantly changing. To find these strange objects, astronomers might look for brown dwarfs when they’re young and still burning brightly, or seek out ones that are relatively close to us. Zenghua Zhang, an astronomer at Nanjing University in China, and his team were initially searching for brown dwarfs by seeking out their bright stellar companions. The scientists sifted through data from the European Space Agency’s Gaia telescope and NASA’s Wide-field Infrared Survey Explorer (WISE) and were rewarded when they identified a brown dwarf orbiting a bright star. They soon realized, however, that there wasn’t just one brown dwarf, but two. Then, they discovered there were also two of the bright, stellar companions. “I like to call this a double-double,” says Adam Burgasser, an astrophysicist at the University of California, San Diego, and a member of the research team, to Katrina Miller at the New York Times. The discovery was highlighted in a recent study published in the Monthly Notices of the Royal Astronomical Society. Fun fact: The first known brown dwarf Astronomers identified the first brown dwarf in 1995 and named it Gliese 229Ba. But something seemed odd about it—and in 2024, a study revealed the brown dwarf was actually two, orbiting each other so closely that they’re only 16 times more distant than the Earth and moon. The system, named UPM J1040−3551 AabBab, is located about 82 light-years from Earth. The two pairs—the brown dwarfs and the bright stars, identified as red dwarfs—are separated by 1,656 astronomical units, making them 1,656 times farther apart from each other than the Earth is from the sun. This unusual quartet can provide a “unique cosmic laboratory for studying these mysterious objects,” says co-author Maria Cruz Gálvez-Ortiz, an astrophysicist at the Center for Astrobiology in Spain, in a statement. Because the objects likely formed around the same time from similar materials, the companion stars offer a benchmark from which researchers can uncover certain characteristics about the brown dwarfs,…",
    "cover": "https://th-thumbnailer.cdn-si-edu.com/IbNzVFbNb-U3cFMsILvWdDFc7qw=/fit-in/1600x0/filters:focal(1200x903:1201x904)/https://tf-cmsv2-smithsonianmag-media.s3.amazonaws.com/filer_public/35/61/3561667c-29ec-4def-baf3-1a08c7a9bba2/rare-quadruple-star-sy.jpg",
    "source": "https://www.smithsonianmag.com/smart-news/astronomers-spot-a-rare-quadruple-star-system-in-the-milky-way-shedding-light-on-mysterious-brown-dwarfs-180987241/"
  },
  {
    "slug": "oldest-known-fossil-of-an-armored-ankylosaur-is-far-weirder-than-paleo",
    "title": "Oldest Known Fossil of an Armored Ankylosaur Is 'Far Weirder' Than Paleontologists Expected",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Oldest Known Fossil of an Armored Ankylosaur Is ‘Far Weirder’ Than Paleontologists Expected The 13-foot dinosaur, covered in long spikes fused into its bones, suggests ankylosaurs developed tail weapons 30 million years earlier than thought Around 165 million years ago, a bizarre, armored dinosaur roamed the floodplains of North Africa. The unusual, 13-foot creature, named Spicomellus afer by paleontologists, was adorned with three-foot-long spikes around its collar and plates down its shoulders. Now, paleontologists have discovered the first skeleton of the odd species, marking the oldest ankylosaur fossil ever found. Their findings were published on Wednesday in the journal Nature. “When we originally named Spicomellus, there were doubts that it was an ankylosaur at all,” says Susannah Maidment, a paleontologist at London’s Natural History Museum, in a statement. “Now, not only can we confirm beyond a doubt that this interpretation was correct, but Africa’s only known ankylosaur is far weirder than anyone imagined.” In 2019, Maidment came across a rib fossil from a dealer in Cambridge, England. The bone was unlike any vertebrate she had ever seen—it had protective spines directly fused into its surface. Based solely on that bone, scientists described Spicomellus afer as a new species in 2021. Still, Maidment and her colleagues wanted to learn more about the mysterious dinosaur the fossil belonged to, so they went searching in Morocco’s Middle Atlas Mountains. In 2023, they found a more complete skeleton from the same rocks as the 2019 specimen, Maidment writes in a research briefing for Nature. That fossil is now the earliest example scientists have of ankylosaurs, a group of bulky, slow-moving dinosaurs that lived from the Middle Jurassic to the end of the Late Cretaceous. “They’re probably a bit dim-witted, as they have relatively small brains, but they’re very successful,” says Richard Butler, a vertebrate paleontologist at the University of Birmingham in England who co-led the work, to Hannah Devlin at the Guardian. “They’re around for about 100 million years.” Fun fact: Africa’s only known ankylosaur Armored ankylosaurs are mostly known from Late Cretaceous fossils found in the Northern Hemisphere, making their early history in the Jurassic still mysterious. Spicomellus afer is the only ankylosaur species to be described from fossils found in Africa. Further analysis confirmed that Spicomellus evolved early in ankylosaurs’ history, and the discovery changes scientists’ understanding of the group’s evolution. While the fossil is missing its tail, its fused tail vertebrae suggest the animal would have had a club-like weapon at the appendage’s end. That would mean ankylosaurs evolved tail weaponry 30 million years earlier than previously thought. The armor’s ornateness also suggests it evolved to attract mates and assert dominance over rivals, rather than serving a purely defensive purpose, like…",
    "cover": "https://th-thumbnailer.cdn-si-edu.com/jDOHCj6H0ZjlE0nCPW4fvzkjvj8=/fit-in/1600x0/filters:focal(960x494:961x495)/https://tf-cmsv2-smithsonianmag-media.s3.amazonaws.com/filer_public/a7/6e/a76edc1d-9693-422d-adc3-37f74d63ea00/spicomellus-dinosaur-reconstruction-full-width-matthew-dempseyjpgthumb19201920.png",
    "source": "https://www.smithsonianmag.com/smart-news/oldest-known-fossil-of-an-armored-ankylosaur-is-far-weirder-than-paleontologists-expected-180987258/"
  }
]