[
  {
    "slug": "us-parks-agency-fires-ranger-who-displayed-trans-pride-flag-in-yosemit",
    "title": "US Parks Agency Fires Ranger Who Displayed Trans Pride Flag in Yosemite",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . As the Trump administration ramps up efforts to erase LGBTQ+ voices and communities of color from the historical narrative , Yosemite National Park has terminated the employment of a park ranger after they displayed a transgender pride flag on a landmark rock formation during their off-duty hours. Shannon “SJ” Joslin, a ranger and wildlife biologist who has been working at the park since 2021, said they were fired from their “dream job” on August 12 in an Instagram post . According to Joslin, Temporary Deputy Superintendent Ray McPadden of the National Park Service (NPS) told them that they had “[failed] to demonstrate acceptable conduct” after they hung the Trans Pride flag on the face of the granite monolith El Capitan. “The messages my termination send out to the public is that if you have an identity that has been turned into a ‘ideology’ not in line with the current administration, your rights will be different than other Americans that fall into the ‘ideal standard’ for who and what a person should be, look like, and believe in,” Joslin told Hyperallergic . An NPS spokesperson told Hyperallergic in a statement that the agency is “pursuing administrative action against multiple employees for failing to follow National Park Service regulations.” They declined to comment on the specifics of Joslin’s case. Get the latest art news, reviews and opinions from Hyperallergic. “We want to emphasize that we take the protection of the park’s resources and the experience of our visitors very seriously, and will not tolerate violations of laws and regulations that impact those resources and experiences,” the spokesperson said, alleging that “several unauthorized demonstrations involving El Capitan” last year had drawn complaints from visitors. SJ with the flag on the face of El Capitan in Yosemite (photo courtesy SJ Joslin) Joslin stated that they displayed the flag for about two hours on May 20 during their off-duty hours, and noted that Yosemite regulations did not ban the hanging of flags at the time. The following day, however, the NPS appears to have updated the park’s rules to prohibit the display of “any banner, flag, or sign larger than fifteen square feet” on any natural or cultural features without a permit, citing the need to…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nAs the Trump administration ramps up efforts to erase LGBTQ+ voices and communities of color from the historical narrative , Yosemite National Park has terminated the employment of a park ranger after they displayed a transgender pride flag on a landmark rock formation during their off-duty hours.\n\nShannon “SJ” Joslin, a ranger and wildlife biologist who has been working at the park since 2021, said they were fired from their “dream job” on August 12 in an Instagram post . According to Joslin, Temporary Deputy Superintendent Ray McPadden of the National Park Service (NPS) told them that they had “[failed] to demonstrate acceptable conduct” after they hung the Trans Pride flag on the face of the granite monolith El Capitan.\n\n“The messages my termination send out to the public is that if you have an identity that has been turned into a ‘ideology’ not in line with the current administration, your rights will be different than other Americans that fall into the ‘ideal standard’ for who and what a person should be, look like, and believe in,” Joslin told Hyperallergic .\n\nAn NPS spokesperson told Hyperallergic in a statement that the agency is “pursuing administrative action against multiple employees for failing to follow National Park Service regulations.” They declined to comment on the specifics of Joslin’s case.\n\nGet the latest art news, reviews and opinions from Hyperallergic.\n\n“We want to emphasize that we take the protection of the park’s resources and the experience of our visitors very seriously, and will not tolerate violations of laws and regulations that impact those resources and experiences,” the spokesperson said, alleging that “several unauthorized demonstrations involving El Capitan” last year had drawn complaints from visitors.\n\nSJ with the flag on the face of El Capitan in Yosemite (photo courtesy SJ Joslin) Joslin stated that they displayed the flag for about two hours on May 20 during their off-duty hours, and noted that Yosemite regulations did not ban the hanging of flags at the time. The following day, however, the NPS appears to have updated the park’s rules to prohibit the display of “any banner, flag, or sign larger than fifteen square feet” on any natural or cultural features without a permit, citing the need to “provide for an unimpaired visitor experience” and “protect natural and cultural resources.”\n\nWhile the new version of the compendium with the ban is dated May 20, the signature from the park’s acting superintendent, Raymond McPadden, is dated May 21, 2025. Previous versions of the compendium , accessed by Hyperallergic via the Wayback Machine, did not men tion flags or banners.\n\nHanging flags on the famous vertical wall of El Capitan is a tradition that many climbers have long participated in. In February, park employees flew an inverted United States flag over the side of the monolith’s cliff to protest the Trump administration’s cuts to the National Park Service. Last June, climbers hung a banner that read “Stop the Genocide” to decry the US-backed Israeli military’s assault on Palestine.\n\nThe NPS’s termination of Joslin’s employment comes amid the Trump administration’s ongoing attacks on LGBTQ+ rights and visibility. In February, the national parks agency expunged all references to trans and queer people from its website describing the 1969 Stonewall Rebellion. The erasure then extended to mentions of bisexual people in May.\n\n“In my celebration of identity and acceptance, I’ve been disparaged and deemed unacceptable,” Joslin told Hyperallergic. “It’s a tragic juxtaposition of how to treat human beings.”\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: LGBTQ , National Park Service Maya Pontone bluesky Maya Pontone (she/her) is a Staff News Writer at Hyperallergic. Originally from northern New Jersey, she currently resides in Brooklyn, where she covers daily news affecting the arts and culture, both... More by Maya Pontone",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/trans-flag-overtone-mitchell.jpg",
    "source": "https://hyperallergic.com/1036200/us-parks-agency-fires-ranger-who-displayed-trans-pride-flag-yosemite/",
    "author": "Maya Pontone"
  },
  {
    "slug": "new-york-area-shows-to-see-right-now",
    "title": "New York Area Shows to See Right Now",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . As the summer winds down and the season of art fairs and openings approaches, you might assume that the entire art world is on vacation right now. Don’t make the mistake of taking your own vacation from art just yet — there’s still plenty to see. For starters, visit CLAMP’s showcase of James Bidgood’s homoerotic photographs from the 1960s, a phantasmagoria of mythological cosplay closing this weekend. An exhibition of Beauford Delaney’s drawings at the Drawing Center is another must-see, as it focuses on the importance of this medium in the artist’s practice, and Sandra Poulson’s work, currently at MoMA PS1, is a fascinating take on the political life of domestic symbols and objects. Meanwhile, a quick trip to Greenwich, Connecticut, will lead you to the Bruce Museum, where Jeremy Frey’s stunning basketry awaits. And while you’re out and about in the city, make sure to check out American Art Catalogues’s small but potent show of paintings by Joe Brainard , up through this weekend. — Natalie Haddad, Reviews Editor CLAMP , 247 West 29th Street, Chelsea, Manhattan Through August 29 James Bidgood, “Bruce Kirkman Leaning on Willow Tree” (1965) (photo Daniel Larkin/ Hyperallergic ) Get the latest art news, reviews and opinions from Hyperallergic. “He portrayed young men with phantasmagorical aplomb, often as mythological figures, going against the grain of the beefcake sensibility dominant at the time.” — Daniel Larkin Bruce Museum , 1 Museum Drive, Greenwich, Connecticut Through September 7 Jeremy Frey, “Double-Walled Point Basket” (2018), ash, cedar bark, and dye (photo Julie Schneider/ Hyperallergic ) “In each impeccable vessel, ancestral Wabanaki basketmaking traditions crisscross with the Passamaquoddy artist’s distinctive creative vision.” — Julie Schneider The Drawing Center , 35 Wooster Street, Soho, Manhattan Through September 14 Beauford Delaney, “Self-Portrait” (1964), watercolor and gouache on paper (courtesy Ruth and Joe Fielden, Knoxville; photo Knoxville Museum of Art, © Estate of Beauford Delaney, by permission of Derek L. Spratley, Esquire, Court Appointed Administrator, Courtesy Michael Rosenfeld Gallery LLC, New York, NY) “For Delaney, being queer meant living and creating at the margins, where sexuality, race, and modernism intertwined in both visible and concealed ways.” — Alexandra M. Thomas MoMA PS1 , 22–25 Jackson Avenue, Long Island City, Queens Through October…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nAs the summer winds down and the season of art fairs and openings approaches, you might assume that the entire art world is on vacation right now. Don’t make the mistake of taking your own vacation from art just yet — there’s still plenty to see. For starters, visit CLAMP’s showcase of James Bidgood’s homoerotic photographs from the 1960s, a phantasmagoria of mythological cosplay closing this weekend. An exhibition of Beauford Delaney’s drawings at the Drawing Center is another must-see, as it focuses on the importance of this medium in the artist’s practice, and Sandra Poulson’s work, currently at MoMA PS1, is a fascinating take on the political life of domestic symbols and objects. Meanwhile, a quick trip to Greenwich, Connecticut, will lead you to the Bruce Museum, where Jeremy Frey’s stunning basketry awaits. And while you’re out and about in the city, make sure to check out American Art Catalogues’s small but potent show of paintings by Joe Brainard , up through this weekend. — Natalie Haddad, Reviews Editor\n\nCLAMP , 247 West 29th Street, Chelsea, Manhattan Through August 29\n\nJames Bidgood, “Bruce Kirkman Leaning on Willow Tree” (1965) (photo Daniel Larkin/ Hyperallergic ) Get the latest art news, reviews and opinions from Hyperallergic.\n\n“He portrayed young men with phantasmagorical aplomb, often as mythological figures, going against the grain of the beefcake sensibility dominant at the time.” — Daniel Larkin\n\nBruce Museum , 1 Museum Drive, Greenwich, Connecticut Through September 7\n\nJeremy Frey, “Double-Walled Point Basket” (2018), ash, cedar bark, and dye (photo Julie Schneider/ Hyperallergic ) “In each impeccable vessel, ancestral Wabanaki basketmaking traditions crisscross with the Passamaquoddy artist’s distinctive creative vision.” — Julie Schneider\n\nThe Drawing Center , 35 Wooster Street, Soho, Manhattan Through September 14\n\nBeauford Delaney, “Self-Portrait” (1964), watercolor and gouache on paper (courtesy Ruth and Joe Fielden, Knoxville; photo Knoxville Museum of Art, © Estate of Beauford Delaney, by permission of Derek L. Spratley, Esquire, Court Appointed Administrator, Courtesy Michael Rosenfeld Gallery LLC, New York, NY) “For Delaney, being queer meant living and creating at the margins, where sexuality, race, and modernism intertwined in both visible and concealed ways.” — Alexandra M. Thomas\n\nMoMA PS1 , 22–25 Jackson Avenue, Long Island City, Queens Through October 6\n\nSandra Poulson, “Candidato a Presidente da República de Angola” (2024), Oregon pine, found wooden bedframe, veneered plywood, chipboard, MDF, and steel (photo Lisa Yin Zhang/ Hyperallergic ) “Across these mostly household objects, Poulson emphasizes that history is something that haunts you as you sleep, as you dress, as you look at yourself in the mirror.” — Lisa Yin Zhang\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Featured , New York Lisa Yin Zhang Lisa Yin Zhang is Associate Editor at Hyperallergic, based in Queens, New York. More by Lisa Yin Zhang\n\nA man once knocked Daniel Larkin off his bar stool and flung mean words. He got up, smiled, and laughed as the bouncer showed him out. He doesn't give anyone the power to rain on his parade. It's more... More by Daniel Larkin\n\nWhen Julie Smith Schneider isn’t writing and editing, she’s carrying on her family’s pun tradition, making custom GIFs, or scheming in her cozy art studio. Keep up with her latest projects on Instagram. More by Julie Schneider\n\nAlexandra M. Thomas is an assistant professor of art history at Fordham University. She writes and teaches black and queer feminist art histories of Africa and the African diaspora. More by Alexandra M. Thomas",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Bidgood_Pan-hires-copy.jpeg",
    "source": "https://hyperallergic.com/1035010/new-york-area-show-to-see-august-26-2025/",
    "author": "Lisa Yin Zhang, Daniel Larkin, Julie Schneider and Alexandra M. Thomas"
  },
  {
    "slug": "colorado-town-settles-with-native-artist-who-brought-free-speech-lawsu",
    "title": "Colorado Town Settles With Native Artist Who Brought Free Speech Lawsuit",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Húŋkpapȟa Lakȟóta painter Danielle SeeWalker has settled a civil rights lawsuit with the town of Vail, Colorado, more than a year after the municipality cancelled her artist residency over a pro-Palestine artwork. Brought by the American Civil Liberties Union (ACLU) of Colorado, the suit claimed that the town had violated the artist’s constitutional right to free speech. In last week’s settlement, Vail agreed to several concessions, including funding an art program “for underrepresented and economically disadvantaged people” and hosting a powwow led by SeeWalker every year for the next five years. “The intention is to allow other underrepresented artists, including Native American people, to have the opportunity of creating art in the town of Vail in place of my own missed opportunity,” SeeWalker said in a statement. The settlement also included Vail’s commitment to sponsor a “community forum” on Israel and Palestine that would include interfaith leaders and host an annual Indigenous-led cultural sensitivity training for employees of the municipality’s Arts and Public Places Department. Get the latest art news, reviews and opinions from Hyperallergic. A spokesperson for the town of Vail did not respond to Hyperallergic ‘s inquiries about when or how it would implement the terms of the settlement. The ACLU of Colorado has not yet responded to Hyperallergic ‘s inquiries. Danielle SeeWalker, “G is for Genocide” (2024) In 2024, SeeWalker was awarded Vail’s Art in Public Places (AIPP) artist residency, which had only been held once before, to create a public mural during the following summer. Months later, however, the town of Vail rescinded the opportunity after she posted an image of a pro-Palestine artwork on her Instagram that she said was unrelated to her public commission. In a public statement , the town said it removed SeeWalker from the project because it would “not use public funds to support any position on a polarizing geopolitical issue.” The painting “G for Genocide,” however, was created on SeeWalker’s own time and had not been submitted as her design for the public mural. She told Hyperallergic in an earlier interview that she created the work after observing common threads between Israel’s assault on Gaza and the history of Native Americans in the United States. The artwork was included in a…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nHúŋkpapȟa Lakȟóta painter Danielle SeeWalker has settled a civil rights lawsuit with the town of Vail, Colorado, more than a year after the municipality cancelled her artist residency over a pro-Palestine artwork. Brought by the American Civil Liberties Union (ACLU) of Colorado, the suit claimed that the town had violated the artist’s constitutional right to free speech.\n\nIn last week’s settlement, Vail agreed to several concessions, including funding an art program “for underrepresented and economically disadvantaged people” and hosting a powwow led by SeeWalker every year for the next five years.\n\n“The intention is to allow other underrepresented artists, including Native American people, to have the opportunity of creating art in the town of Vail in place of my own missed opportunity,” SeeWalker said in a statement.\n\nThe settlement also included Vail’s commitment to sponsor a “community forum” on Israel and Palestine that would include interfaith leaders and host an annual Indigenous-led cultural sensitivity training for employees of the municipality’s Arts and Public Places Department.\n\nGet the latest art news, reviews and opinions from Hyperallergic.\n\nA spokesperson for the town of Vail did not respond to Hyperallergic ‘s inquiries about when or how it would implement the terms of the settlement. The ACLU of Colorado has not yet responded to Hyperallergic ‘s inquiries.\n\nDanielle SeeWalker, “G is for Genocide” (2024) In 2024, SeeWalker was awarded Vail’s Art in Public Places (AIPP) artist residency, which had only been held once before, to create a public mural during the following summer. Months later, however, the town of Vail rescinded the opportunity after she posted an image of a pro-Palestine artwork on her Instagram that she said was unrelated to her public commission. In a public statement , the town said it removed SeeWalker from the project because it would “not use public funds to support any position on a polarizing geopolitical issue.”\n\nThe painting “G for Genocide,” however, was created on SeeWalker’s own time and had not been submitted as her design for the public mural. She told Hyperallergic in an earlier interview that she created the work after observing common threads between Israel’s assault on Gaza and the history of Native Americans in the United States. The artwork was included in a December 2024 collaboration between Hyperallergic and Jewish Currents that highlighted artists who had been silenced or censored over their support of Palestine.\n\nSeeWalker told Hyperallergic that settling with Vail was advantageous in that it allowed her to secure programming that other artists can benefit from, whereas a trial might only have yielded a financial result, if any. She said the settlement could have included additional terms she bargained for, but she intended to maximize community benefit over her own grievances.\n\n“Even if one other person is impacted in a good way, that is enough for me,” SeeWalker said. “My dad once told me, ‘Danielle, if you don’t speak up, no one will do it for you.’ I carry that with me everywhere I go.”\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Danielle SeeWalker , lawsuit Isa Farfan x Isa Farfan is a staff reporter for Hyperallergic. In May 2024, she graduated from Barnard College, where she studied Political Science and English and served as the Columbia Daily Spectator's Arts &... More by Isa Farfan",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/GisforGenocideinstudio.jpg",
    "source": "https://hyperallergic.com/1036790/colorado-town-settles-with-native-artist-danielle-seewalker-who-brought-free-speech-lawsuit/",
    "author": "Isa Farfan"
  },
  {
    "slug": "dust-storm-blows-away-ukrainian-artwork-at-burning-man",
    "title": "Dust Storm Blows Away Ukrainian Artwork at Burning Man",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Ferocious desert stormwinds have swept away a colossal Ukrainian artwork within hours of its installation at the annual Burning Man cultural festival in Nevada. A visual metaphor for the impending threat of war, the 50-foot-tall (~15.2-meter-tall) inflatable “Black Cloud” was destroyed shortly after debuting at the Black Rock Desert event yesterday, August 24, on Ukraine’s Independence Day. The work consisted of 45 interconnected blow-up forms with flashing strobes and a continuous soundscape created from real audio of warfare in Ukraine. General producer Vitaliy Deynega wrote on Facebook that although the installation was intended to withstand such weather conditions, it was torn apart in less than 15 minutes. The installation served as a visual metaphor of the threat of impending war. Get the latest art news, reviews and opinions from Hyperallergic. Fierce gusts of wind tore apart the inflatable installation within 15 minutes. “It was a feeling I experienced only once before — in February 2022, when I woke up to explosions and sirens,” Deynega said in a statement shared with Hyperallergic . The powerful dust storm, accompanied by 50 mph winds, has reportedly resulted in at least four minor injuries at Burning Man so far. It comes two years after torrential rainfall transformed the desert cultural festival into an enormous mud pit that stranded over 70,000 festival attendees in the temporary encampment. Hyperallergic has contacted Burning Man for comment. Despite the damage, the team behind “Black Cloud” has confirmed that the installation is slated to be rebuilt for a European tour. Dates and locations have not yet been announced. “Black Cloud” wasn’t the first Burning Man artwork to draw attention to the horrors of Russia’s war on Ukraine. At last year’s festival, Deynega and other Ukrainian artists unveiled “I’m Fine,” a more than 2,000-pound sculpture made of street signs from across the nation that were damaged by bullets and shrapnel. Since the start of Russia’s full-scale invasion more than three years ago, the United Nations Human Rights Monitoring Mission in Ukraine has documented 13,883 civilian deaths, including 726 children. Donald Trump’s recent meetings with Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky have yet to yield a ceasefire or peace deal. “Perhaps this storm has taken the threat with it,”…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nFerocious desert stormwinds have swept away a colossal Ukrainian artwork within hours of its installation at the annual Burning Man cultural festival in Nevada.\n\nA visual metaphor for the impending threat of war, the 50-foot-tall (~15.2-meter-tall) inflatable “Black Cloud” was destroyed shortly after debuting at the Black Rock Desert event yesterday, August 24, on Ukraine’s Independence Day. The work consisted of 45 interconnected blow-up forms with flashing strobes and a continuous soundscape created from real audio of warfare in Ukraine.\n\nGeneral producer Vitaliy Deynega wrote on Facebook that although the installation was intended to withstand such weather conditions, it was torn apart in less than 15 minutes.\n\nThe installation served as a visual metaphor of the threat of impending war. Get the latest art news, reviews and opinions from Hyperallergic.\n\nFierce gusts of wind tore apart the inflatable installation within 15 minutes. “It was a feeling I experienced only once before — in February 2022, when I woke up to explosions and sirens,” Deynega said in a statement shared with Hyperallergic .\n\nThe powerful dust storm, accompanied by 50 mph winds, has reportedly resulted in at least four minor injuries at Burning Man so far. It comes two years after torrential rainfall transformed the desert cultural festival into an enormous mud pit that stranded over 70,000 festival attendees in the temporary encampment. Hyperallergic has contacted Burning Man for comment.\n\nDespite the damage, the team behind “Black Cloud” has confirmed that the installation is slated to be rebuilt for a European tour. Dates and locations have not yet been announced.\n\n“Black Cloud” wasn’t the first Burning Man artwork to draw attention to the horrors of Russia’s war on Ukraine. At last year’s festival, Deynega and other Ukrainian artists unveiled “I’m Fine,” a more than 2,000-pound sculpture made of street signs from across the nation that were damaged by bullets and shrapnel.\n\nSince the start of Russia’s full-scale invasion more than three years ago, the United Nations Human Rights Monitoring Mission in Ukraine has documented 13,883 civilian deaths, including 726 children. Donald Trump’s recent meetings with Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky have yet to yield a ceasefire or peace deal.\n\n“Perhaps this storm has taken the threat with it,” said the “Black Cloud” building team in a statement. “A quiet hope on Ukraine’s Independence Day … drifting away on the desert winds.”\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Burning Man Maya Pontone bluesky Maya Pontone (she/her) is a Staff News Writer at Hyperallergic. Originally from northern New Jersey, she currently resides in Brooklyn, where she covers daily news affecting the arts and culture, both... More by Maya Pontone",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/black-clopud-far-away.jpg",
    "source": "https://hyperallergic.com/1036943/dust-storm-blows-away-ukrainian-artwork-at-burning-man/",
    "author": "Maya Pontone"
  },
  {
    "slug": "we-are-all-picasso-s-fishermen",
    "title": "We Are All Picasso’s Fishermen",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Pablo Picasso’s “Night Fishing at Antibes” (1939) at the Museum of Modern Art in New York (all photos Hakim Bishara/ Hyperallergic ) A quick perusal of the headlines these days is enough for one to conclude that dictators don’t die but multiply, and that history doesn’t repeat itself — it vomits in its own mouth. The year is 1939. It’s a balmy August night, lit by a big, yellow moon. Two fishermen in a boat are earning their keep out there off the shore of Antibes in southern France. One of them aims at a large, curmudgeonly fish with a pitchfork, the other tries his luck with a fishing line. A cautious crab keeps a safe distance. Gas lamps reflect on the water’s surface and flicker into the air. A girl on a bike observes the whole scene from a high dock while licking an ice cream. She’s there with a friend, it seems. Luxurious Monaco is less than an hour away by car. Beachy Nice is even closer. Everything looks fine and lovely. But beneath these calm waters swirl malignant tides that portend the onset of a Second, much deadlier World War just a few weeks away. Get the latest art news, reviews and opinions from Hyperallergic. This scene in Pablo Picasso’s “Night Fishing at Antibes” stopped me in my tracks during a visit to the Museum of Modern Art (MoMA) on a hot Saturday afternoon in New York City. Currently hung on a wall at a busy intersection connecting two escalators on the museum’s fifth floor, it’s nearly impossible to have a private moment with this Cubist masterpiece, much less heed its alarm that we’re never really too far away from a third, infinitely more horrific World War, probably powered by AI. The painting is currently hung on a wall at a busy intersection on MoMA’s fifth floor. This sprawling piece (6.75 by 11.3 feet, or two by 3.5 meters) was acquired for MoMA in 1952 by Olga Hirsh Guggenheim, wife of industrialist-philanthropist Simon Guggenheim, brother of Solomon R. Guggenheim, who started his own eponymous museum on Manhattan’s Fifth Avenue. The Guggenheims made their fortune from building a global mining and smelting empire, which reached its peak during the…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nPablo Picasso’s “Night Fishing at Antibes” (1939) at the Museum of Modern Art in New York (all photos Hakim Bishara/ Hyperallergic ) A quick perusal of the headlines these days is enough for one to conclude that dictators don’t die but multiply, and that history doesn’t repeat itself — it vomits in its own mouth.\n\nThe year is 1939. It’s a balmy August night, lit by a big, yellow moon. Two fishermen in a boat are earning their keep out there off the shore of Antibes in southern France. One of them aims at a large, curmudgeonly fish with a pitchfork, the other tries his luck with a fishing line. A cautious crab keeps a safe distance. Gas lamps reflect on the water’s surface and flicker into the air. A girl on a bike observes the whole scene from a high dock while licking an ice cream. She’s there with a friend, it seems.\n\nLuxurious Monaco is less than an hour away by car. Beachy Nice is even closer. Everything looks fine and lovely. But beneath these calm waters swirl malignant tides that portend the onset of a Second, much deadlier World War just a few weeks away.\n\nGet the latest art news, reviews and opinions from Hyperallergic.\n\nThis scene in Pablo Picasso’s “Night Fishing at Antibes” stopped me in my tracks during a visit to the Museum of Modern Art (MoMA) on a hot Saturday afternoon in New York City.\n\nCurrently hung on a wall at a busy intersection connecting two escalators on the museum’s fifth floor, it’s nearly impossible to have a private moment with this Cubist masterpiece, much less heed its alarm that we’re never really too far away from a third, infinitely more horrific World War, probably powered by AI.\n\nThe painting is currently hung on a wall at a busy intersection on MoMA’s fifth floor. This sprawling piece (6.75 by 11.3 feet, or two by 3.5 meters) was acquired for MoMA in 1952 by Olga Hirsh Guggenheim, wife of industrialist-philanthropist Simon Guggenheim, brother of Solomon R. Guggenheim, who started his own eponymous museum on Manhattan’s Fifth Avenue. The Guggenheims made their fortune from building a global mining and smelting empire, which reached its peak during the First World War. They, among others, have been accused of war profiteering by gouging the price of copper, which was essential for the arms industry. Many in the family have abandoned the mining industry since then. Now we recognize them more as great patrons of the arts, just as we do many contemporary MoMA donors and board members accused of extractivism and profiting off the military-industrial complex .\n\nAnd isn’t it an interesting coincidence that 1939, the year Picasso made “Night Fishing at Antibes,” is also the year he loaned “Guernica” (1937), his most famous anti-war painting, to MoMA for safekeeping after the outbreak of the war in Europe? Such is history, a turning wheel of irony. The people collecting and safeguarding the anti-war art are often the same ones selling the bombs.\n\nThe people collecting and safeguarding the anti-war art are often the same ones selling the bombs. PING ! As I stood blocking escalator traffic while contemplating these entanglements, a notification on my phone screen announced that the United States, 80 years after the atomic end of World War II, had positioned nuclear submarines close to Russia .\n\nOutside the museum, an August sun flagellated the asphalt roads, concrete pavements, and skyscrapers of Midtown Manhattan. It was a vengeful, punishing sun. A jingoistic sun that wants you to go the hell back to where you came from. Nevertheless, the streets teemed with people shopping, sightseeing, and licking ice cream — just going about their normal business. Every one of them looked like a Picasso fisherman to me.\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Featured , MoMA , Pablo Picasso , World War II Hakim Bishara instagram linkedin Hakim Bishara is Hyperallergic's managing editor. He is a recipient of the 2019 Andy Warhol Foundation and Creative Capital Arts Writers Grant and he holds an MFA in Art Writing from the School of Visual... More by Hakim Bishara",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/image00003-scaled.jpeg?fit=2560%2C1375&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1035989/we-are-all-picasso-fishermen/",
    "author": "Hakim Bishara"
  },
  {
    "slug": "the-black-feminist-subconscious-of-ufuoma-essi-s-films",
    "title": "The Black Feminist Subconscious of Ufuoma Essi’s Films",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . At first glance, the two Super 8 films that comprise Ufuoma Essi’s exhibition at the Museum of Modern Art (MoMA) seem to compete for attention. “Bodies In Dissent” (2021) juxtaposes the artist’s footage of a performer with archival film of a 1960s jazz concert and a dancer in a succinct six minutes. On the opposite side of the gallery, “Half Memory” (2024) coalesces three years of filming in the United Kingdom, United States, and France into an allusive, nonlinear 27 minutes. Soon, though, the two works come to complement each other, their dreamlike atmospheres opening onto shared themes of history and memory threaded through with the voices of Black artists and intellectuals. In “Bodies In Dissent,” Essi’s scenes of artist Nambi Kiyira performing in a grassy green field are interspersed with black and white video of then-married jazz drummer Max Roach and singer Abbey Lincoln during a 1964 concert, and archival clips of dancer Loretta Abbott. Kiyira, wearing a long black dress, is seen alternately from afar and up close, backed by audio from the concert. “Half Memory” takes Toni Morrison’s essay “The Site of Memory” (1986) and her concept of “rememory” — repressed memories returning via a living force — as a jumping-off point for an exploration of individual and collective memory and history. In it, grainy imagery of public places like cities and beaches — suggesting both anonymous found footage and surveillance videos — is layered with the words of Morrison and other Black feminist scholars. Still of Ufuoma Essi, “Half Memory” (2024), scanned Super 8mm film (color), 27 min. (photo Natalie Haddad/ Hyperallergic ) Get the latest art news, reviews and opinions from Hyperallergic. Most online descriptions of Essi’s work, including her own artist statement, put forth a didactic portrait of the films (her website states that her art “revolves around Black feminist epistemology and the configuration of displaced histories”). These themes inhere in the references and connections she brings to light, but the films themselves are far more abstract and intuitive than academic and dry. The meditative pace and washed-out color palette of “Half Memory” reflect the ways that memories cohere, dissipate, and reemerge, while the pastoral setting of “Bodies In Dissent,” framing the performer’s elegant movements…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nAt first glance, the two Super 8 films that comprise Ufuoma Essi’s exhibition at the Museum of Modern Art (MoMA) seem to compete for attention. “Bodies In Dissent” (2021) juxtaposes the artist’s footage of a performer with archival film of a 1960s jazz concert and a dancer in a succinct six minutes. On the opposite side of the gallery, “Half Memory” (2024) coalesces three years of filming in the United Kingdom, United States, and France into an allusive, nonlinear 27 minutes. Soon, though, the two works come to complement each other, their dreamlike atmospheres opening onto shared themes of history and memory threaded through with the voices of Black artists and intellectuals.\n\nIn “Bodies In Dissent,” Essi’s scenes of artist Nambi Kiyira performing in a grassy green field are interspersed with black and white video of then-married jazz drummer Max Roach and singer Abbey Lincoln during a 1964 concert, and archival clips of dancer Loretta Abbott. Kiyira, wearing a long black dress, is seen alternately from afar and up close, backed by audio from the concert.\n\n“Half Memory” takes Toni Morrison’s essay “The Site of Memory” (1986) and her concept of “rememory” — repressed memories returning via a living force — as a jumping-off point for an exploration of individual and collective memory and history. In it, grainy imagery of public places like cities and beaches — suggesting both anonymous found footage and surveillance videos — is layered with the words of Morrison and other Black feminist scholars.\n\nStill of Ufuoma Essi, “Half Memory” (2024), scanned Super 8mm film (color), 27 min. (photo Natalie Haddad/ Hyperallergic ) Get the latest art news, reviews and opinions from Hyperallergic.\n\nMost online descriptions of Essi’s work, including her own artist statement, put forth a didactic portrait of the films (her website states that her art “revolves around Black feminist epistemology and the configuration of displaced histories”). These themes inhere in the references and connections she brings to light, but the films themselves are far more abstract and intuitive than academic and dry. The meditative pace and washed-out color palette of “Half Memory” reflect the ways that memories cohere, dissipate, and reemerge, while the pastoral setting of “Bodies In Dissent,” framing the performer’s elegant movements and form, renders the work lush and painterly.\n\nThe show’s location, in one of MoMA’s free ground-floor galleries, is a boon for art lovers who don’t have $30 to spend on a museum visit. Essi’s focus on music and landscape calls to mind some film works by Cauleen Smith (for instance, her 2017 ode to Alice Coltrane, “Pilgrim”). Smith’s more cinematic vision strikes a balance between abstraction and narrative that Essi’s works don’t quite achieve — and maybe weren’t meant to. But the artists are separated by a generation or more (Essi was born in 1995, three years before Smith released her feature film, Drylongso ), and Essi’s aesthetic is still evolving.\n\nSome contextualizing materials, such as archival texts or background on Roach and Lincoln’s activism through music, might have brought the show to another level. However, Essi’s great skill in these pieces lies in articulating her conceptual concerns through aesthetic and sensory means. “Half Memory” evokes the workings of memory and its relationship with official and repressed histories through its fluid montage, while “Bodies In Dissent” interweaves the past and present of Black arts and activism through music and the body. The effect is subtle, but it lingers.\n\nStill of Ufuoma Essi, “Bodies in Dissent” (2021) (photo Natalie Haddad/ Hyperallergic ) Still of Ufuoma Essi, “Half Memory” (2024) (photo Natalie Haddad/ Hyperallergic ) Still of Ufuoma Essi, “Bodies in Dissent” (2021) (photo Natalie Haddad/ Hyperallergic ) Installation view of Projects: Ufuoma Essi at The Museum of Modern Art, New York (photo Jonathan Dorado) Ufuoma Essi continues at the Museum of Modern Art (11 West 53rd Street, Midtown, Manhattan) through October 13. The exhibition was organized by Gee Wesley.\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: MoMA , New York Natalie Haddad Natalie Haddad is Reviews Editor at Hyperallergic and an art writer and historian. Natalie holds a PhD in Art History, Theory and Criticism from the University of California San Diego and focuses on World... More by Natalie Haddad",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/2021_Bodies-In-Dissent_Still-1.jpg?fit=2000%2C1451&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1035118/the-black-feminist-subconscious-of-ufuoma-essi-films/",
    "author": "Natalie Haddad"
  }
]