[
  {
    "slug": "the-artist-whose-fauci-portraits-enraged-the-white-house",
    "title": "The Artist Whose Fauci Portraits Enraged the White House",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "In 2019, Hugo Crosthwaite became the first Latino artist to win the Smithsonian National Portrait Gallery’s (NPG) prestigious triennial Outwin Boochever Portrait Competition. The Tijuana-born and San Diego-based illustrator received the contest’s grand prize: $25,000 and a portrait commission for the museum’s permanent collection. He chose to depict Anthony Fauci, then the director of the National Institute of Allergy and Infectious Diseases (NIAID), in a stop-motion format that captures the…",
    "excerptExtended": "In 2019, Hugo Crosthwaite became the first Latino artist to win the Smithsonian National Portrait Gallery’s (NPG) prestigious triennial Outwin Boochever Portrait Competition. The Tijuana-born and San Diego-based illustrator received the contest’s grand prize: $25,000 and a portrait commission for the museum’s permanent collection. He chose to depict Anthony Fauci, then the director of the National Institute of Allergy and Infectious Diseases (NIAID), in a stop-motion format that captures the nuances of his complicated legacy, including his [criticized and then celebrated](https://www.pbs.org/wnet/americanmasters/how-dr-fauci-handled-aids-crisis-jexipk/26361/) oversight of the HIV/AIDs epidemic. Last week, Crosthwaite found his hard-won commission on a list of Smithsonian items that the White House found objectionable. He was one of at least three Mexican-born artists whose work was included on [Trump’s art hit list](https://hyperallergic.com/1036180/trump-targets-lgbtq-history-migrants-and-more-in-chilling-smithsonian-hit-list/), along with illustrator [Rigoberto González](https://hyperallergic.com/1036180/trump-targets-lgbtq-history-migrants-and-more-in-chilling-smithsonian-hit-list/) and painter [Felipe Galindo Gómez](https://hyperallergic.com/1037811/smithsonian-latino-gallery-quietly-closes-for-nine-months/). “My first reaction was surprise,” Crosthwaite shared in an interview with *Hyperallergic. *“But then later on, [I] felt a bit of pride to be included in this list of other wonderful artists and wonderful projects that talk about the diversity of the United States’ history.” ![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Hugo-Foto-1-1200x1485.jpg?resize=1200%2C1485&quality=90&ssl=1) In 2022, after winning the Outwin competition, Crosthwaite and the NPG considered a list of individuals for a portrait. They agreed on Fauci as the commission’s subject. At the time, the infectious disease specialist was a polarized figure: a revered pandemic hero and a detested political opponent of the right. “I jumped at the chance of doing this because it was 2022, we were in the middle of the COVID-19 pandemic,” Crosthwaite told *Hyperallergic*. “He became a symbol of this fight between science and truth, against conspiracy theories; Dr. Fauci kind of epitomizes the nation’s current political divide.” The five-minute stop motion animation, “A Portrait of Dr. Anthony Fauci” (2022), begins by portraying him as a young scientist in a lab. Later, a man infected by an unnamed virus becomes emaciated until he disappears into a black hole that morphs into a scene from ACT UP protests. Men carry signs that read “Silence = Death” and “Killed by the System.” Behind them, skeletons look to the sky. ![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/facui2-1200x904.jpeg?resize=1200%2C904&quality=90&ssl=1) The artwork references the AIDs memorial quilt before transitioning into a segment about the COVID-19 pandemic, in which a woman’s lungs explode into tiny bits of paper. Fauci is portrayed next to the White House press briefing room podium, where he often gave virus updates alongside Trump. Crosthwaite included a thumbs-up icon** **moving erratically up and down behind the podium, and Fauci off to the side. He also captured anti-Fauci sentiment and the right-wing rejection of vaccines, at one point portraying the scientist with devil horns. The stop-motion sequence ends with a woman receiving a vaccine, which cuts to a portrait of an aging Fauci. ![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/fauci3-1200x894.jpeg?resize=1200%2C894&quality=90&ssl=1) Crosthwaite told *Hyperallergic *that he doubts the Trump administration actually watched the video, instead targeted the work because of his identity. He rebuffed the White House’s Smithsonian list as a mediocre attempt to win a culture war, and said being included on the list was a badge of honor. “The portrait was done from the perspective of a Mexican-American artist, someone who’s cognizant of the impact of age and COVID-19 on my community, which is presented in the animation … the diverse people who are being attacked by viruses,” he said. The artworks that Crosthwaite initially submitted to the Outwin competition had nothing to do with Fauci. In fact, the work that secured his national win was a different stop-motion animation, telling the story of a woman he met who had crossed the US-Mexico border illegally. Crosthwaite commended the Outwin prize’s capacity to open doors for artists like himself. Any artist residing in the United States who is at least 18 years old is eligible to submit to the competition. For Crosthwaite, it was life-changing. “Getting the commission to do the portrait of Dr. Fauci is actually a great honor — being part of the Smithsonian,” Crosthwaite",
    "body": "In 2019, Hugo Crosthwaite became the first Latino artist to win the Smithsonian National Portrait Gallery’s (NPG) prestigious triennial Outwin Boochever Portrait Competition. The Tijuana-born and San Diego-based illustrator received the contest’s grand prize: $25,000 and a portrait commission for the museum’s permanent collection. He chose to depict Anthony Fauci, then the director of the National Institute of Allergy and Infectious Diseases (NIAID), in a stop-motion format that captures the nuances of his complicated legacy, including his [criticized and then celebrated](https://www.pbs.org/wnet/americanmasters/how-dr-fauci-handled-aids-crisis-jexipk/26361/) oversight of the HIV/AIDs epidemic.\nLast week, Crosthwaite found his hard-won commission on a list of Smithsonian items that the White House found objectionable. He was one of at least three Mexican-born artists whose work was included on [Trump’s art hit list](https://hyperallergic.com/1036180/trump-targets-lgbtq-history-migrants-and-more-in-chilling-smithsonian-hit-list/), along with illustrator [Rigoberto González](https://hyperallergic.com/1036180/trump-targets-lgbtq-history-migrants-and-more-in-chilling-smithsonian-hit-list/) and painter [Felipe Galindo Gómez](https://hyperallergic.com/1037811/smithsonian-latino-gallery-quietly-closes-for-nine-months/).\n“My first reaction was surprise,” Crosthwaite shared in an interview with *Hyperallergic. *“But then later on, [I] felt a bit of pride to be included in this list of other wonderful artists and wonderful projects that talk about the diversity of the United States’ history.”\n![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Hugo-Foto-1-1200x1485.jpg?resize=1200%2C1485&quality=90&ssl=1)\nIn 2022, after winning the Outwin competition, Crosthwaite and the NPG considered a list of individuals for a portrait. They agreed on Fauci as the commission’s subject. At the time, the infectious disease specialist was a polarized figure: a revered pandemic hero and a detested political opponent of the right.\n“I jumped at the chance of doing this because it was 2022, we were in the middle of the COVID-19 pandemic,” Crosthwaite told *Hyperallergic*. “He became a symbol of this fight between science and truth, against conspiracy theories; Dr. Fauci kind of epitomizes the nation’s current political divide.”\nThe five-minute stop motion animation, “A Portrait of Dr. Anthony Fauci” (2022), begins by portraying him as a young scientist in a lab. Later, a man infected by an unnamed virus becomes emaciated until he disappears into a black hole that morphs into a scene from ACT UP protests. Men carry signs that read “Silence = Death” and “Killed by the System.” Behind them, skeletons look to the sky.\n![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/facui2-1200x904.jpeg?resize=1200%2C904&quality=90&ssl=1)\nThe artwork references the AIDs memorial quilt before transitioning into a segment about the COVID-19 pandemic, in which a woman’s lungs explode into tiny bits of paper. Fauci is portrayed next to the White House press briefing room podium, where he often gave virus updates alongside Trump. Crosthwaite included a thumbs-up icon** **moving erratically up and down behind the podium, and Fauci off to the side. He also captured anti-Fauci sentiment and the right-wing rejection of vaccines, at one point portraying the scientist with devil horns. The stop-motion sequence ends with a woman receiving a vaccine, which cuts to a portrait of an aging Fauci.\n![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/fauci3-1200x894.jpeg?resize=1200%2C894&quality=90&ssl=1)\nCrosthwaite told *Hyperallergic *that he doubts the Trump administration actually watched the video, instead targeted the work because of his identity. He rebuffed the White House’s Smithsonian list as a mediocre attempt to win a culture war, and said being included on the list was a badge of honor.\n“The portrait was done from the perspective of a Mexican-American artist, someone who’s cognizant of the impact of age and COVID-19 on my community, which is presented in the animation … the diverse people who are being attacked by viruses,” he said.\nThe artworks that Crosthwaite initially submitted to the Outwin competition had nothing to do with Fauci. In fact, the work that secured his national win was a different stop-motion animation, telling the story of a woman he met who had crossed the US-Mexico border illegally.\nCrosthwaite commended the Outwin prize’s capacity to open doors for artists like himself. Any artist residing in the United States who is at least 18 years old is eligible to submit to the competition. For Crosthwaite, it was life-changing.\n“Getting the commission to do the portrait of Dr. Fauci is actually a great honor — being part of the Smithsonian,” Crosthwaite told *Hyperallergic. *“My piece is part of the record of American history.”\n![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Screen-Shot-2025-08-29-at-2.58.33-PM-1200x898.jpeg?resize=1200%2C898&quality=90&ssl=1)\n![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/fauci-1200x904.jpeg?resize=1200%2C904&quality=90&ssl=1)\nSo important. Thanks\nSo important. Thank you",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/whitehousefauci.jpeg?fit=2140%2C1610&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038060/hugo-crosthwaite-artist-whose-fauci-portraits-enraged-the-white-house/",
    "sourceName": "hyperallergic.com",
    "author": "Isa Farfan"
  },
  {
    "slug": "the-shocking-allure-of-erotic-abstraction",
    "title": "The Shocking Allure of Erotic Abstraction",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "LONDON — Some of the Courtauld’s previous exhibitions have [suffered from insufficient curation](https://hyperallergic.com/1010475/the-cortaulds-impressionism-show-is-a-victim-of-corporate-curating/). [ Abstract Erotic: Louise Bourgeois, Alice Adams, Eva Hesse](https://courtauld.ac.uk/whats-on/exh-abstract-erotic/), on the other hand, strikes the exact right balance. Drawing on scholar Jo Applin’s research, curator Alexandra Gerstein has taken as a starting point the work of feminist curator and critic Lucy Lippard, who coined the titular term to describe this sensuous strand of art emerging in 1960s…",
    "excerptExtended": "LONDON — Some of the Courtauld’s previous exhibitions have [suffered from insufficient curation](https://hyperallergic.com/1010475/the-cortaulds-impressionism-show-is-a-victim-of-corporate-curating/). [ Abstract Erotic: Louise Bourgeois, Alice Adams, Eva Hesse](https://courtauld.ac.uk/whats-on/exh-abstract-erotic/), on the other hand, strikes the exact right balance. Drawing on scholar Jo Applin’s research, curator Alexandra Gerstein has taken as a starting point the work of feminist curator and critic Lucy Lippard, who coined the titular term to describe this sensuous strand of art emerging in 1960s New York. Making perhaps the best use yet of the Courtauld’s teeny exhibition spaces next to the permanent collection, this small but unstuffed show gives proper breathing space for artistic dialogue and, crucially, for the viewer to engage in exploring differences and similarities between works and practices for themselves. In 1966, Lippard curated the exhibition *Eccentric Abstraction* to capture a new wave of sculptures created from unusual, pliable materials like wire, plastic mesh, netting, and latex, which evoked tactile organic forms and, by extension, the human body. This is the Courtauld’s first show devoted to standalone sculpture, and the contrast between these blob-like forms and its Impressionist-heavy permanent collection may go some way to recreate just how different — even alarming — these pieces will have appeared to 1960s audiences just getting over the shock of Abstract Expressionism’s rehauling of formalist painting. ![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Installation-view-l-r-Bourgeois-_Avenza_-_Lair_-_Fee-Couturiere_-_Hanging-Janus_-1200x880.jpg?resize=1200%2C880&quality=90&ssl=1) *Abstract Erotic: Louise Bourgeois, Eva Hesse, Alice Adams*, featuring works by Eva Hesse and Alice Adams (all photos Olivia McEwan/ *Hyperallergic*) The three artists are each afforded an introductory caption presenting historical context. No direct written comparisons are made between them, nor any attempt to force commonality, for historically, there is none other than their working in generally the same space and time. This is good curating: The show allows viewers to ask and think for themselves. Its skill lies in making suggestions via the pieces selected for display, allowing for robust visual comparison. Viewers won’t be able to ignore the strain of eroticism that stems from their irresistible tactility, which is both alluring and fear-inducing, nor their uncanny resemblance to certain human appendages (*ahem*). Applin and Gerstein do point out that all three artists’ experimentation with latex marked a turning point in their explorations of eroticism and the unconscious. The exhibition’s most well-known artist, Bourgeois, was born in Paris in 1911 and moved to New York in 1938. Duly included here is her “Filette (Sweeter Version)” (1968–99/ 2006), unmistakably an erect penis (or, more accurately, one yanked upwards by string) in urethane rubber, given the ambiguous French title “Little Girl.” Adams graduated from Columbia University with a degree in Fine Arts in 1953 before becoming an accomplished weaver. Her foray into obscure materials is here represented by such pieces as the nearby “Expanded Cylinder” (1970), in which she allowed latex foam to expand and set into a constricting tube of chain link, producing a regular weave-like texture while maintaining a phallic, slippery form. Finally, Hesse, born in 1936 in Hamburg before settling in New York, made sculptures of forms bound, twisted, and caught in netting. Applin and Gerstein draw out the latex connection again via the caption, which quotes Hesse on the material’s inevitable deterioration: “Art doesn’t last; life doesn’t last.” Fittingly, though unfortunately, there are no latex examples here. ![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Installation-view-l-r-Hesse-untitled-pieces-and-_No-Title-or-Not-Yet_-1200x900.jpg?resize=1200%2C900&quality=90&ssl=1) It is also unfortunate that this small but perfectly formed show was relatively empty on a weekend. The scrappy, experimental mark-making explored by these three pioneering artists is one important strain in the development of feminist art. Their unsettling forms provoke, titillate, and amuse — welcome responses to female voices and artistic expression. Perhaps it is reflective of trends in audience attention that a solid academic show like this should be less visited than the packed-out recent exhibitions on [Peter Doig](https://hyperallergic.com/804963/what-does-peter-doig-have-to-do-with-the-impressionists/) or yet more [Impressionism](https://hyperallergic.com/1010475/the-cortaulds-impressionism-show-is-a-victim-of-corporate-curating/). We all know sex sells: Does the marketing perhaps need to shout “Eroticism!” or “Rubber penises!” to get punters through the door these days? ![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Installation-view-l-r-Bourgeois-_Fillette_-Adams-_Expanded-Cylinder_-1200x1413.jpg?resize=1200%2C1413&quality=90&ssl=1) ![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Installation-view-l-r-Hesse-_Untitled-or-Not-Yet_-_Addendum_-Adams-_Tangle_-_Big-Aluminum-2_-_Resin-Corner-Pieces_-1200x717.jpg?resize=1200%2C717&quality=90&ssl=1) *Abstract Erotic: Louise Bourgeois,",
    "body": "LONDON — Some of the Courtauld’s previous exhibitions have [suffered from insufficient curation](https://hyperallergic.com/1010475/the-cortaulds-impressionism-show-is-a-victim-of-corporate-curating/). [ Abstract Erotic: Louise Bourgeois, Alice Adams, Eva Hesse](https://courtauld.ac.uk/whats-on/exh-abstract-erotic/), on the other hand, strikes the exact right balance. Drawing on scholar Jo Applin’s research, curator Alexandra Gerstein has taken as a starting point the work of feminist curator and critic Lucy Lippard, who coined the titular term to describe this sensuous strand of art emerging in 1960s New York. Making perhaps the best use yet of the Courtauld’s teeny exhibition spaces next to the permanent collection, this small but unstuffed show gives proper breathing space for artistic dialogue and, crucially, for the viewer to engage in exploring differences and similarities between works and practices for themselves.\nIn 1966, Lippard curated the exhibition *Eccentric Abstraction* to capture a new wave of sculptures created from unusual, pliable materials like wire, plastic mesh, netting, and latex, which evoked tactile organic forms and, by extension, the human body. This is the Courtauld’s first show devoted to standalone sculpture, and the contrast between these blob-like forms and its Impressionist-heavy permanent collection may go some way to recreate just how different — even alarming — these pieces will have appeared to 1960s audiences just getting over the shock of Abstract Expressionism’s rehauling of formalist painting.\n![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Installation-view-l-r-Bourgeois-_Avenza_-_Lair_-_Fee-Couturiere_-_Hanging-Janus_-1200x880.jpg?resize=1200%2C880&quality=90&ssl=1)\n*Abstract Erotic: Louise Bourgeois, Eva Hesse, Alice Adams*, featuring works by Eva Hesse and Alice Adams (all photos Olivia McEwan/\n*Hyperallergic*)\nThe three artists are each afforded an introductory caption presenting historical context. No direct written comparisons are made between them, nor any attempt to force commonality, for historically, there is none other than their working in generally the same space and time. This is good curating: The show allows viewers to ask and think for themselves. Its skill lies in making suggestions via the pieces selected for display, allowing for robust visual comparison. Viewers won’t be able to ignore the strain of eroticism that stems from their irresistible tactility, which is both alluring and fear-inducing, nor their uncanny resemblance to certain human appendages (*ahem*).\nApplin and Gerstein do point out that all three artists’ experimentation with latex marked a turning point in their explorations of eroticism and the unconscious. The exhibition’s most well-known artist, Bourgeois, was born in Paris in 1911 and moved to New York in 1938. Duly included here is her “Filette (Sweeter Version)” (1968–99/ 2006), unmistakably an erect penis (or, more accurately, one yanked upwards by string) in urethane rubber, given the ambiguous French title “Little Girl.” Adams graduated from Columbia University with a degree in Fine Arts in 1953 before becoming an accomplished weaver. Her foray into obscure materials is here represented by such pieces as the nearby “Expanded Cylinder” (1970), in which she allowed latex foam to expand and set into a constricting tube of chain link, producing a regular weave-like texture while maintaining a phallic, slippery form. Finally, Hesse, born in 1936 in Hamburg before settling in New York, made sculptures of forms bound, twisted, and caught in netting. Applin and Gerstein draw out the latex connection again via the caption, which quotes Hesse on the material’s inevitable deterioration: “Art doesn’t last; life doesn’t last.” Fittingly, though unfortunately, there are no latex examples here.\n![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Installation-view-l-r-Hesse-untitled-pieces-and-_No-Title-or-Not-Yet_-1200x900.jpg?resize=1200%2C900&quality=90&ssl=1)\nIt is also unfortunate that this small but perfectly formed show was relatively empty on a weekend. The scrappy, experimental mark-making explored by these three pioneering artists is one important strain in the development of feminist art. Their unsettling forms provoke, titillate, and amuse — welcome responses to female voices and artistic expression. Perhaps it is reflective of trends in audience attention that a solid academic show like this should be less visited than the packed-out recent exhibitions on [Peter Doig](https://hyperallergic.com/804963/what-does-peter-doig-have-to-do-with-the-impressionists/) or yet more [Impressionism](https://hyperallergic.com/1010475/the-cortaulds-impressionism-show-is-a-victim-of-corporate-curating/). We all know sex sells: Does the marketing perhaps need to shout “Eroticism!” or “Rubber penises!” to get punters through the door these days?\n![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Installation-view-l-r-Bourgeois-_Fillette_-Adams-_Expanded-Cylinder_-1200x1413.jpg?resize=1200%2C1413&quality=90&ssl=1)\n![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Installation-view-l-r-Hesse-_Untitled-or-Not-Yet_-_Addendum_-Adams-_Tangle_-_Big-Aluminum-2_-_Resin-Corner-Pieces_-1200x717.jpg?resize=1200%2C717&quality=90&ssl=1)\n*Abstract Erotic: Louise Bourgeois, Eva Hesse, Alice Adams*, featuring works by Eva Hesse and Alice Adams\n[Abstract Erotic: Louise Bourgeois, Eva Hesse, Alice Adams](https://courtauld.ac.uk/whats-on/exh-abstract-erotic/) *continues at the Courtauld Gallery (Somerset House, London) through September 14. The exhibition was curated by Alexandra Gerstein based on the research of Jo Applin.*",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/eed0c-scaled.jpeg?fit=2560%2C2113&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1035805/the-shocking-allure-of-erotic-abstraction-courtauld-gallery/",
    "sourceName": "hyperallergic.com",
    "author": "Olivia McEwan"
  },
  {
    "slug": "reclaiming-a-whitewashed-history-of-the-great-depression",
    "title": "Reclaiming a Whitewashed History of the Great Depression",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "When the United States Department of Agriculture established the Farm Security Administration (FSA) in 1937, hoping to provide aid to rural communities affected by the Great Depression, it also implemented a photography project headed by government official Roy Stryker. The photographs were meant to generate support for the agency, allowing the public to witness the impacts of the Depression for themselves. Made by recruited photographers and then selected by Stryker…",
    "excerptExtended": "When the United States Department of Agriculture established the Farm Security Administration (FSA) in 1937, hoping to provide aid to rural communities affected by the Great Depression, it also implemented a photography project headed by government official Roy Stryker. The photographs were meant to generate support for the agency, allowing the public to witness the impacts of the Depression for themselves. Made by recruited photographers and then selected by Stryker for inclusion in traveling exhibitions and news outlets, the chosen images overwhelmingly depicted White families — a narrow and literally whitewashed view of rural America. * Crafting Sanctuaries: Black Spaces of the Black Great Depression South*, a new exhibition at the Museum of Art and Light in Manhattan, Kansas, showcases a broader view of FSA imagery, focusing on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, Russell Lee, Marion Post Wolcott, Arthur Rothstein, Ben Shahn, and Jack Delano across six states: Alabama, Georgia, Louisiana, Florida, Mississippi, and Missouri. Presented in partnership with Art Bridges Foundation, the photos highlight the intimacy of life among one’s community — private quarters, public gathering spaces — and the care taken to build one together. The exhibition, curator Tamir Williams told *Hyperallergic*, “is an examination of the significance of Black Southerners investing in their spatial worlds — and more largely in beauty — while living through this intense period of economic hardship and racial violence.” ![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Sr4qw-1200x905.jpeg?resize=1200%2C905&quality=90&ssl=1) During the summer of 2023, Ashley Holland, curator and director of Curatorial Initiatives for the Art Bridges Foundation, approached Williams to curate its first in-house traveling exhibition, drawing from the FSA photography collection. At the time, they’d just begun a job there as a curatorial research assistant. “I came across Nicholas Natanson’s * The Black Image in the New Deal: The Politics of FSA Photography* (1992) and Sarah Boxer’s ‘ [Whitewashing the Great Depression](https://www.theatlantic.com/magazine/archive/2020/12/whitewashing-the-great-depression/616936/)’ (2020) for *The Atlantic*,” Williams said. “I knew that I wanted to focus on this issue of the absence of Black and other non-White persons from the larger visual memory of the Great Depression — and specifically explore how and why this exclusion happened and how it could be redressed.” Williams spent a week at the Library of Congress poring over the digital FSA collection. They were drawn to images of small homes built by both White and Black laborers, particularly in La Forge, Missouri. Curious about “what home and homemaking might have looked like for other Black persons and families beyond La Forge,” they expanded their research. ![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/gdoxx-1200x797.jpeg?resize=1200%2C797&quality=90&ssl=1) The exhibition’s photographs are reverent, offering glimpses into otherwise unseen instances of Black domesticity and community. “I find Jack Delano’s ‘Negro tenant family near Greensboro, Alabama’ (1941) to be incredibly striking,” shared Javier Rivero Ramos, associate curator at Art Bridges. In the image, a young family poses in their home, the walls and ceilings plastered and reinforced with newspaper clippings, a kitten at their feet. “It seems like every conceivable emotion, thought, and event unfolding through the country is somehow refracted in the image,” Ramos added. Ibby Ouweleen, Art Bridges curatorial associate, said she was “taken by Marion Post Wolcott’s interior scene of three children and a dog in their family home, which feels sort of magical and mundane at once.” ![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/WzRNF-1200x897.jpeg?resize=1200%2C897&quality=90&ssl=1) The exhibition is displayed in tandem with *Sanctuary in Motion*, a companion installation developed in collaboration with the Yuma Street Cultural Center. Kristy Peterson, vice president of Learning, Engagement, and Visitor Experiences at the museum, pointed to the history of the site. “Manhattan, Kansas, has a rich history as a town site established by abolitionist settlers, circa 1855,” Peterson told *Hyperallergic*. “*Sanctuary in Motion* shares information about Manhattan’s history and community, and tells the story of Yuma Street [part of the city’s Historic District] … and its significance as a sanctuary where families made something out of nothing.” *Crafting Sanctuaries*, which runs through next spring, is both a corrective and a meditation.",
    "body": "When the United States Department of Agriculture established the Farm Security Administration (FSA) in 1937, hoping to provide aid to rural communities affected by the Great Depression, it also implemented a photography project headed by government official Roy Stryker. The photographs were meant to generate support for the agency, allowing the public to witness the impacts of the Depression for themselves. Made by recruited photographers and then selected by Stryker for inclusion in traveling exhibitions and news outlets, the chosen images overwhelmingly depicted White families — a narrow and literally whitewashed view of rural America.\n* Crafting Sanctuaries: Black Spaces of the Black Great Depression South*, a new exhibition at the Museum of Art and Light in Manhattan, Kansas, showcases a broader view of FSA imagery, focusing on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, Russell Lee, Marion Post Wolcott, Arthur Rothstein, Ben Shahn, and Jack Delano across six states: Alabama, Georgia, Louisiana, Florida, Mississippi, and Missouri.\nPresented in partnership with Art Bridges Foundation, the photos highlight the intimacy of life among one’s community — private quarters, public gathering spaces — and the care taken to build one together. The exhibition, curator Tamir Williams told *Hyperallergic*, “is an examination of the significance of Black Southerners investing in their spatial worlds — and more largely in beauty — while living through this intense period of economic hardship and racial violence.”\n![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Sr4qw-1200x905.jpeg?resize=1200%2C905&quality=90&ssl=1)\nDuring the summer of 2023, Ashley Holland, curator and director of Curatorial Initiatives for the Art Bridges Foundation, approached Williams to curate its first in-house traveling exhibition, drawing from the FSA photography collection. At the time, they’d just begun a job there as a curatorial research assistant.\n“I came across Nicholas Natanson’s * The Black Image in the New Deal: The Politics of FSA Photography* (1992) and Sarah Boxer’s ‘\n[Whitewashing the Great Depression](https://www.theatlantic.com/magazine/archive/2020/12/whitewashing-the-great-depression/616936/)’ (2020) for\n*The Atlantic*,” Williams said. “I knew that I wanted to focus on this issue of the absence of Black and other non-White persons from the larger visual memory of the Great Depression — and specifically explore how and why this exclusion happened and how it could be redressed.”\nWilliams spent a week at the Library of Congress poring over the digital FSA collection. They were drawn to images of small homes built by both White and Black laborers, particularly in La Forge, Missouri. Curious about “what home and homemaking might have looked like for other Black persons and families beyond La Forge,” they expanded their research.\n![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/gdoxx-1200x797.jpeg?resize=1200%2C797&quality=90&ssl=1)\nThe exhibition’s photographs are reverent, offering glimpses into otherwise unseen instances of Black domesticity and community. “I find Jack Delano’s ‘Negro tenant family near Greensboro, Alabama’ (1941) to be incredibly striking,” shared Javier Rivero Ramos, associate curator at Art Bridges. In the image, a young family poses in their home, the walls and ceilings plastered and reinforced with newspaper clippings, a kitten at their feet. “It seems like every conceivable emotion, thought, and event unfolding through the country is somehow refracted in the image,” Ramos added. Ibby Ouweleen, Art Bridges curatorial associate, said she was “taken by Marion Post Wolcott’s interior scene of three children and a dog in their family home, which feels sort of magical and mundane at once.”\n![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/WzRNF-1200x897.jpeg?resize=1200%2C897&quality=90&ssl=1)\nThe exhibition is displayed in tandem with *Sanctuary in Motion*, a companion installation developed in collaboration with the Yuma Street Cultural Center. Kristy Peterson, vice president of Learning, Engagement, and Visitor Experiences at the museum, pointed to the history of the site.\n“Manhattan, Kansas, has a rich history as a town site established by abolitionist settlers, circa 1855,” Peterson told *Hyperallergic*. “*Sanctuary in Motion* shares information about Manhattan’s history and community, and tells the story of Yuma Street [part of the city’s Historic District] … and its significance as a sanctuary where families made something out of nothing.”\n*Crafting Sanctuaries*, which runs through next spring, is both a corrective and a meditation. “It is my hope that these photographs allow viewers to see and witness how Black Southerners adopted expansive definitions of beauty to craft personal and communal sanctuaries and spaces of respite,” Williams said.\n![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/y1qCn-1200x893.jpeg?resize=1200%2C893&quality=90&ssl=1)",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/dzNBe-scaled.jpeg?fit=2560%2C1843&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038134/reclaiming-a-whitewashed-history-of-the-great-depression-museum-art-light-kansas/",
    "sourceName": "hyperallergic.com",
    "author": "Monica Uszerowicz"
  },
  {
    "slug": "art-dealers-get-candid-ahead-of-the-armory-show",
    "title": "Art Dealers Get Candid Ahead of the Armory Show",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Joe Amrhein and Susan Swenson were going to sit out the Armory Show this fall for the first time in a quarter century until they got a call last month from the fair’s director. The owners of Pierogi Gallery in Brooklyn’s Williamsburg neighborhood initially did not apply this year due to the show’s rising booth costs, which can exceed tens of thousands of dollars. Pierogi is planning the next phase…",
    "excerptExtended": "Joe Amrhein and Susan Swenson were going to sit out the Armory Show this fall for the first time in a quarter century until they got a call last month from the fair’s director. The owners of Pierogi Gallery in Brooklyn’s Williamsburg neighborhood initially did not apply this year due to the show’s rising booth costs, which can exceed tens of thousands of dollars. Pierogi is planning the next phase of its business, which could include [relocating to Lower Manhattan](https://hyperallergic.com/970425/a-williamsburg-family-reunion-at-pierogi-gallery-30th-anniversary-opening/). But Armory executives Kyla McMillan and J. Tyler Woodall appealed to Pierogi and the fair’s shared history — in 2016, Amrhein suggested the Armory use an empty space to display Jonathan Schipper’s [installation](https://www.jonathanschipper.com/slow-motion-car-crash) of a Volkswagen Golf crashing into a wall; the presentation of large-scale art has since become a cornerstone of the show. They recently negotiated a smaller exhibition space for Pierogi with a lower rate, enabling the gallery to return. “We had been on the fence about it since the economy is very uncertain and it’s a big investment,” Swenson said. “We’re not one of the big box galleries. Some of them have their own economies now.” The Armory Show has come a long way from exhibiting several New York gallerists on three floors of the Gramercy Park Hotel in the mid-1990s. Since 2021, the fair has set up camp at the spacious Javits Center near Manhattan’s Hudson Yards, where it will host some 230 galleries from more than 35 countries from September 4 through 7. ![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/JCG18153_view01-1200x896.jpg?resize=1200%2C896&quality=90&ssl=1) The show also has new owners. Two years after Frieze [acquired](https://www.frieze.com/article/frieze-acquires-armory-show-and-expo-chicago) the Armory Show and EXPO Chicago, its parent company, Endeavor Group Holdings, sold its roster of art fairs for [$200 million](https://variety.com/2025/biz/news/ari-emanuel-buys-frieze-endeavor-group-1236383561/) to Hollywood superagent Ari Emmanuel. The former Endeavor CEO envisions Frieze as a key piece of a new global events company he formed this year, and perhaps one positioned to compete with Art Basel’s dominance in the contemporary art market. But with a reported downturn in the market, galleries have been weighing their options. Once mainstays at the Armory, blue-chip institutions have instead drifted toward Frieze’s [spring fair](https://hyperallergic.com/1011006/frieze-new-york-is-back-to-its-old-ways/), the Art Dealers Association of America’s (ADAA) Art Show (before it was abruptly [canceled](https://hyperallergic.com/1032202/as-adaas-art-show-changes-course-a-nonprofit-is-left-in-limbo/) this year), or TEFAF New York — or they are skipping the New York fairs entirely. David Zwirner hasn’t exhibited at the Amory Show since [2022](https://www.davidzwirner.com/fairs/2022/the-armory-show), and chose to show at ADAA several years before that. Pace Gallery’s last year at the Armory was [2021](https://www.pacegallery.com/artfairs/the-armory-show-4/#:~:text=At%20The%20Armory%20Show%202019%2C%20Pace%20Gallery%20will%20present%20a,of%20twelve%20LED%20panel%20artworks.). Gagosian hasn’t shown at the Amory since [2020](https://gagosian.com/fairs-and-collecting/fairs/armory-show-new-york-2020-rudolf-polanszky/), back when it was held at Piers 92 and 94. Lisson hasn’t been at the fair since [2019](https://www.lissongallery.com/news/lisson-gallery-at-the-armory-show-s-25th-edition). Others are busy courting international buyers in Asia and the Middle East, where [Art Basel Qatar](https://hyperallergic.com/1014206/does-the-art-world-need-a-new-art-basel-fair-in-qatar/) will launch in Doha in February 2026. It doesn’t help that Frieze is competing against itself: Its three-year-old Frieze Seoul fair overlaps with Armory next week, forcing galleries to choose. “Everybody is asking where we should be investing our energy and time and our focus,” David Norr, partner at James Cohan Gallery, told *Hyperallergic*. “The cost of shipping, travel and built-in expenses in participation in these fairs continues to go up.” ![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/La-Balada-De-Jennie-Ruby-Jane-1200x1642.jpeg?resize=1200%2C1642&quality=90&ssl=1) Others are simply skipping the season altogether. Jack Shainman stepped back from showing at New York fairs in recent years to focus on its exhibitions in Chelsea and the newly renovated [Clock Tower building](https://hyperallergic.com/867108/jack-shainman-gallery-takes-over-manhattans-historic-clock-tower/) in Civic Center. After wildfires [ravaged Los Angeles](https://hyperallergic.com/982535/it-looks-like-a-bomb-exploded-la-artists-grapple-with-loss-as-fires-rage/) in January, Night Gallery chose a gallery residency at Arsenal Contemporary instead of participating in several international art fairs. “This is both a result of the market and our ability to be in multiple places at once,” Night Gallery spokesperson Shy Watson said. “We are trying to create alternative models of exhibition, promotion, sales, and community.” The Armory is used to a relatively high degree of churn. This year, 55 galleries are participating in the fair for the first time, with another 20 returning from a",
    "body": "<p>Joe Amrhein and Susan Swenson were going to sit out the Armory Show this fall for the first time in a quarter century until they got a call last month from the fair’s director.</p>\n<p>The owners of Pierogi Gallery in Brooklyn’s Williamsburg neighborhood initially did not apply this year due to the show’s rising booth costs, which can exceed tens of thousands of dollars.</p>\n<p>Pierogi is planning the next phase of its business, which could include [relocating to Lower Manhattan](https://hyperallergic.com/970425/a-williamsburg-family-reunion-at-pierogi-gallery-30th-anniversary-opening/).</p>\n<p>But Armory executives Kyla McMillan and J.</p>\n<p>Tyler Woodall appealed to Pierogi and the fair’s shared history — in 2016, Amrhein suggested the Armory use an empty space to display Jonathan Schipper’s [installation](https://www.jonathanschipper.com/slow-motion-car-crash) of a Volkswagen Golf crashing into a wall; the presentation of large-scale art has since become a cornerstone of the show.</p>\n<p>They recently negotiated a smaller exhibition space for Pierogi with a lower rate, enabling the gallery to return. “We had been on the fence about it since the economy is very uncertain and it’s a big investment,” Swenson said. “We’re not one of the big box galleries.</p>\n<p>Some of them have their own economies now.” The Armory Show has come a long way from exhibiting several New York gallerists on three floors of the Gramercy Park Hotel in the mid-1990s.</p>\n<p>Since 2021, the fair has set up camp at the spacious Javits Center near Manhattan’s Hudson Yards, where it will host some 230 galleries from more than 35 countries from September 4 through 7. ![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/JCG18153_view01-1200x896.jpg?resize=1200%2C896&quality=90&ssl=1) The show also has new owners.</p>\n<p>Two years after Frieze [acquired](https://www.frieze.com/article/frieze-acquires-armory-show-and-expo-chicago) the Armory Show and EXPO Chicago, its parent company, Endeavor Group Holdings, sold its roster of art fairs for [$200 million](https://variety.com/2025/biz/news/ari-emanuel-buys-frieze-endeavor-group-1236383561/) to Hollywood superagent Ari Emmanuel.</p>\n<p>The former Endeavor CEO envisions Frieze as a key piece of a new global events company he formed this year, and perhaps one positioned to compete with Art Basel’s dominance in the contemporary art market.</p>\n<p>But with a reported downturn in the market, galleries have been weighing their options.</p>\n<p>Once mainstays at the Armory, blue-chip institutions have instead drifted toward Frieze’s [spring fair](https://hyperallergic.com/1011006/frieze-new-york-is-back-to-its-old-ways/), the Art Dealers Association of America’s (ADAA) Art Show (before it was abruptly [canceled](https://hyperallergic.com/1032202/as-adaas-art-show-changes-course-a-nonprofit-is-left-in-limbo/) this year), or TEFAF New York — or they are skipping the New York fairs entirely.</p>\n<p>David Zwirner hasn’t exhibited at the Amory Show since [2022](https://www.davidzwirner.com/fairs/2022/the-armory-show), and chose to show at ADAA several years before that.</p>\n<p>Pace Gallery’s last year at the Armory was [2021](https://www.pacegallery.com/artfairs/the-armory-show-4/#:~:text=At%20The%20Armory%20Show%202019%2C%20Pace%20Gallery%20will%20present%20a,of%20twelve%20LED%20panel%20artworks.).</p>\n<p>Gagosian hasn’t shown at the Amory since [2020](https://gagosian.com/fairs-and-collecting/fairs/armory-show-new-york-2020-rudolf-polanszky/), back when it was held at Piers 92 and 94.</p>\n<p>Lisson hasn’t been at the fair since [2019](https://www.lissongallery.com/news/lisson-gallery-at-the-armory-show-s-25th-edition).</p>\n<p>Others are busy courting international buyers in Asia and the Middle East, where [Art Basel Qatar](https://hyperallergic.com/1014206/does-the-art-world-need-a-new-art-basel-fair-in-qatar/) will launch in Doha in February 2026.</p>\n<p>It doesn’t help that Frieze is competing against itself: Its three-year-old Frieze Seoul fair overlaps with Armory next week, forcing galleries to choose. “Everybody is asking where we should be investing our energy and time and our focus,” David Norr, partner at James Cohan Gallery, told *Hyperallergic*. “The cost of shipping, travel and built-in expenses in participation in these fairs continues to go up.” ![](https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/La-Balada-De-Jennie-Ruby-Jane-1200x1642.jpeg?resize=1200%2C1642&quality=90&ssl=1) Others are simply skipping the season altogether.</p>\n<p>Jack Shainman stepped back from showing at New York fairs in recent years to focus on its exhibitions in Chelsea and the newly renovated [Clock Tower building](https://hyperallergic.com/867108/jack-shainman-gallery-takes-over-manhattans-historic-clock-tower/) in Civic Center.</p>\n<p>After wildfires [ravaged Los Angeles](https://hyperallergic.com/982535/it-looks-like-a-bomb-exploded-la-artists-grapple-with-loss-as-fires-rage/) in January, Night Gallery chose a gallery residency at Arsenal Contemporary instead of participating in several international art fairs. “This is both a result of the market and our ability to be in multiple places at once,” Night Gallery spokesperson Shy Watson said. “We are trying to create alternative models of exhibition, promotion, sales, and community.” The Armory is used to a relatively high degree of churn.</p>\n<p>This year, 55 galleries are participating in the fair for the first time, with another 20 returning from a hiatus, roughly in line with figures from 2024, a fair spokesperson said.</p>\n<p>But the relative lack of large commercial institutions at the show presents an opportunity for New York galleries to cultivate new collectors and promote their artists to a broader audience. “We feel like a large gallery there even…</p>",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/armory.jpg?fit=2355%2C1864&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038050/new-york-art-dealers-get-candid-ahead-of-the-armory-show-2025/",
    "sourceName": "hyperallergic.com",
    "author": "Aaron Short"
  },
  {
    "slug": "facing-15m-budget-deficit-calarts-lays-off-workers",
    "title": "Facing $15M Budget Deficit, CalArts Lays Off Workers",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "A round of layoffs at the California Institute of the Arts (CalArts) this summer is raising alarms at one of the best-known arts schools in the country as the institution grapples with rising costs. The Santa Clarita-based private arts school laid off nine administrative employees in July, including five unionized workers and four non-union workers, claiming in a schoolwide message that CalArts needed to cut expenses in the face of…",
    "excerptExtended": "A round of layoffs at the California Institute of the Arts (CalArts) this summer is raising alarms at one of the best-known arts schools in the country as the institution grapples with rising costs. The Santa Clarita-based private arts school laid off nine administrative employees in July, including five unionized workers and four non-union workers, claiming in a schoolwide message that CalArts needed to cut expenses in the face of a projected [$15 million deficit](https://calarts.edu/sites/default/files/2025-05/Toward%20a%20Sustainable%20Financial%20Future%20for%20CalArts.pdf). “The nine staff positions, as well as about a dozen vacant staff positions, are being eliminated as part of a necessary workforce reduction, which will enable CalArts to address a structural deficit, prioritize student-facing services, and better align our staffing with current and projected enrollments to continue providing exceptional educational opportunities to our students,” a CalArts spokesperson told *Hyperallergic*. But faculty and staff members are questioning the administration’s decision, arguing that the layoffs could harm the school’s ability to train and nurture the next generation of artists. “Everyone was disappointed in this having to happen at all when we’re working so hard to try to better serve the population,” Emily Lytle-Painter, a web and digital media producer at CalArts and union member, told *Hyperallergic*. “When we were trying to go into discussions with the administration, we felt like there were other avenues.” Tensions between CalArts employees and school leadership have been simmering since last fall, when dozens of faculty and staff [decided to form a union](https://www.instagram.com/p/DCikoHURbCM/?hl=en) after enduring what they described as years of stagnant wages, increased workloads, and minimal benefits. In December, CalArts faculty [delivered a letter](https://hyperallergic.com/972509/calarts-staff-and-faculty-move-to-unionize/) to President Ravi Rajan announcing their intention to organize with United Auto Workers in a unit that would represent approximately 600 workers. They held elections in March and ratified the union a month later. At the same time, the school had been struggling with enrollment, which [declined](https://www.insidehighered.com/news/institutions/specialized-colleges/2024/04/08/enrollment-declines-threaten-small-independent#:~:text=Though%20it's%20enrollment%20has%20also,creative%20industries%2C%E2%80%9D%20Rajan%20said.) by about 12 percent since the pandemic, from 1,532 students in 2019 to 1,353 students in 2023 (tuition surpassed [$60,000](https://calarts.edu/admissions-aid/tuition/tuition-and-fees/cost-attendance) per year in 2025–26). In an April 2024 interview, Rajan told *Inside Higher Education* that CalArts was “[fiscally sound](https://www.insidehighered.com/news/institutions/specialized-colleges/2024/04/08/enrollment-declines-threaten-small-independent#:~:text=Though%20it's%20enrollment%20has%20also,creative%20industries%2C%E2%80%9D%20Rajan%20said.).” But the school proceeded with several budget cuts to reduce its operating costs, including tighter spending controls, hiring delays and travel limitations, and adjustments to admissions and financial aid packages. These measures, Rajan said in a schoolwide message, saved the school $5.5 million. This spring, CalArts sought to reduce its headcount and sent voluntary separation and early retirement notices to between 50 and 60 faculty and staff, union leaders estimated. But only 32 employees, including 22 faculty and 10 staff, took the school’s offer and Rajan moved ahead with layoffs despite vociferous [objections](https://www.instagram.com/p/DN3-oBcEmIH/?igsh=MXExOWNyY2VhY2J5Yg%3D%3D) from the union. “I acknowledge how painful this news is,” Rajan wrote in a July 15 letter to faculty and staff reviewed by *Hyperallergic*. “These are not just abstract positions—they are roles held by our colleagues, teammates, and friends. I’m immensely grateful for their contributions and mindful of the weight of this moment for our community.” When the school announced layoffs, union leaders bargained with the administration for three months of severance, instead of two weeks of pay per year of service; three months of COBRA insurance; and priority rehiring in any vacant positions over the next two years for anyone who was laid off. “Everyone is understandably sad and worried, and there’s a general feeling of having to move forward with what we have,” Lytle-Painter said. “I personally was really proud of our bargaining team being able to bargain for increased benefits for those affected by the layoffs. That’s part of why we have a union.” Thomas Leeb, an adjunct faculty member in the School of Music and union member, said he is approaching the next academic year that starts on September 8 with mixed emotions. “A lot of institutional knowledge has left with the voluntary separation program, and that’s sad and it hurts. At the same",
    "body": "<p>A round of layoffs at the California Institute of the Arts (CalArts) this summer is raising alarms at one of the best-known arts schools in the country as the institution grapples with rising costs.</p>\n<p>The Santa Clarita-based private arts school laid off nine administrative employees in July, including five unionized workers and four non-union workers, claiming in a schoolwide message that CalArts needed to cut expenses in the face of a projected [$15 million deficit](https://calarts.edu/sites/default/files/2025-05/Toward%20a%20Sustainable%20Financial%20Future%20for%20CalArts.pdf). “The nine staff positions, as well as about a dozen vacant staff positions, are being eliminated as part of a necessary workforce reduction, which will enable CalArts to address a structural deficit, prioritize student-facing services, and better align our staffing with current and projected enrollments to continue providing exceptional educational opportunities to our students,” a CalArts spokesperson told *Hyperallergic*.</p>\n<p>But faculty and staff members are questioning the administration’s decision, arguing that the layoffs could harm the school’s ability to train and nurture the next generation of artists. “Everyone was disappointed in this having to happen at all when we’re working so hard to try to better serve the population,” Emily Lytle-Painter, a web and digital media producer at CalArts and union member, told *Hyperallergic*. “When we were trying to go into discussions with the administration, we felt like there were other avenues.” Tensions between CalArts employees and school leadership have been simmering since last fall, when dozens of faculty and staff [decided to form a union](https://www.instagram.com/p/DCikoHURbCM/?hl=en) after enduring what they described as years of stagnant wages, increased workloads, and minimal benefits.</p>\n<p>In December, CalArts faculty [delivered a letter](https://hyperallergic.com/972509/calarts-staff-and-faculty-move-to-unionize/) to President Ravi Rajan announcing their intention to organize with United Auto Workers in a unit that would represent approximately 600 workers.</p>\n<p>They held elections in March and ratified the union a month later.</p>\n<p>At the same time, the school had been struggling with enrollment, which [declined](https://www.insidehighered.com/news/institutions/specialized-colleges/2024/04/08/enrollment-declines-threaten-small-independent#:~:text=Though%20it's%20enrollment%20has%20also,creative%20industries%2C%E2%80%9D%20Rajan%20said.) by about 12 percent since the pandemic, from 1,532 students in 2019 to 1,353 students in 2023 (tuition surpassed [$60,000](https://calarts.edu/admissions-aid/tuition/tuition-and-fees/cost-attendance) per year in 2025–26).</p>\n<p>In an April 2024 interview, Rajan told *Inside Higher Education* that CalArts was “[fiscally sound](https://www.insidehighered.com/news/institutions/specialized-colleges/2024/04/08/enrollment-declines-threaten-small-independent#:~:text=Though%20it's%20enrollment%20has%20also,creative%20industries%2C%E2%80%9D%20Rajan%20said.).” But the school proceeded with several budget cuts to reduce its operating costs, including tighter spending controls, hiring delays and travel limitations, and adjustments to admissions and financial aid packages.</p>\n<p>These measures, Rajan said in a schoolwide message, saved the school $5.5 million.</p>\n<p>This spring, CalArts sought to reduce its headcount and sent voluntary separation and early retirement notices to between 50 and 60 faculty and staff, union leaders estimated.</p>\n<p>But only 32 employees, including 22 faculty and 10 staff, took the school’s offer and Rajan moved ahead with layoffs despite vociferous [objections](https://www.instagram.com/p/DN3-oBcEmIH/?igsh=MXExOWNyY2VhY2J5Yg%3D%3D) from the union. “I acknowledge how painful this news is,” Rajan wrote in a July 15 letter to faculty and staff reviewed by *Hyperallergic*. “These are not just abstract positions—they are roles held by our colleagues, teammates, and friends.</p>\n<p>I’m immensely grateful for their contributions and mindful of the weight of this moment for our community.” When the school announced layoffs, union leaders bargained with the administration for three months of severance, instead of two weeks of pay per year of service; three months of COBRA insurance; and priority rehiring in any vacant positions over the next two years for anyone who was laid off. “Everyone is understandably sad and worried, and there’s a general feeling of having to move forward with what we have,” Lytle-Painter said. “I personally was really proud of our bargaining team being able to bargain for increased benefits for those affected by the layoffs.</p>\n<p>That’s part of why we have a union.” Thomas Leeb, an adjunct faculty member in the School of Music and union member, said he is approaching the next academic year that starts on September 8 with mixed emotions. “A lot of institutional knowledge has left with the voluntary separation program, and that’s sad and it hurts.</p>\n<p>At the same time, there’s a bit of optimism,” Leeb said, referencing the newly formed union. “Someone I spoke to who has been at CalArts for 25 years said this is the first time he felt protected.” **Editor’s note 8/30/25 11am EST: **A previous version of this article stated that 12 staffers were…</p>",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/1620px-2012-1104-CalArts01.jpg?fit=1620%2C1080&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038229/facing-15m-budget-deficit-calarts-lays-off-workers/",
    "sourceName": "hyperallergic.com",
    "author": "Aaron Short"
  },
  {
    "slug": "the-2025-ny-art-book-fair-returns-to-moma-ps1",
    "title": "The 2025 NY Art Book Fair Returns to MoMA PS1",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Initiated in 2006, the [NY Art Book Fair (NYABF)](https://bit.ly/3UL7B7w) is a celebration and international gathering for artists’ book publishers to distribute their work, connect with broad audiences, and nurture new and longstanding relationships. This year’s fair marks an exciting and long-awaited return to [MoMA PS1](https://bit.ly/4n2LZ2w), Printed Matter’s venue partner from 2009–2019, a pivotal decade in expanding the fair’s reach and impact, establishing NYABF as a cornerstone for the distribution of…",
    "excerptExtended": "Initiated in 2006, the [NY Art Book Fair (NYABF)](https://bit.ly/3UL7B7w) is a celebration and international gathering for artists’ book publishers to distribute their work, connect with broad audiences, and nurture new and longstanding relationships. This year’s fair marks an exciting and long-awaited return to [MoMA PS1](https://bit.ly/4n2LZ2w), Printed Matter’s venue partner from 2009–2019, a pivotal decade in expanding the fair’s reach and impact, establishing NYABF as a cornerstone for the distribution of artists’ books and the preeminent gathering point for celebrating the form. This partnership also exemplifies a shared commitment to creating spaces where audiences can engage with new ideas and perspectives, while reaffirming Printed Matter’s core mission dedicated to the dissemination, understanding, and appreciation of artists’ books. NYABF 2025 takes place from Thursday, September 11, through Sunday, September 14, and will feature a wide range of interdisciplinary artistic practices, including self-publishing artists, collectives, small presses, institutions, rare and out-of-print book dealers, and art book distributors. With each fair, Printed Matter continues to foreground programs that address the present moment, while also working to increase awareness around artists’ books by providing various access points for visitors to engage with printed material in enriching and discursive ways. This upcoming iteration of the fair includes special projects and installations by Boo-Hooray, Bread & Puppet Press, Corraini Edizioni, Hat & Beard Press, Special Special and 4N, Three Star Books, and an exhibition of archival material from The Detroit Printing Co-op. Two new screen-printed artist editions, “Untitled” (2025) by Huma Bhabha and “The 2nd Merlyn” (2025) by Richard Tuttle, will also be released during the fair. Join [Printed Matter](https://bit.ly/4mCAa3m) on Thursday, September 11, from 7–10 PM for the Opening Night celebration, with music from Lydo, Sydney Spann, and voyeur. The first five hundred guests will also receive a limited ticket edition by Lyric Shen. **To learn more, visit ****pmabf.org****.**",
    "body": "Initiated in 2006, the [NY Art Book Fair (NYABF)](https://bit.ly/3UL7B7w) is a celebration and international gathering for artists’ book publishers to distribute their work, connect with broad audiences, and nurture new and longstanding relationships. This year’s fair marks an exciting and long-awaited return to [MoMA PS1](https://bit.ly/4n2LZ2w), Printed Matter’s venue partner from 2009–2019, a pivotal decade in expanding the fair’s reach and impact, establishing NYABF as a cornerstone for the distribution of artists’ books and the preeminent gathering point for celebrating the form. This partnership also exemplifies a shared commitment to creating spaces where audiences can engage with new ideas and perspectives, while reaffirming Printed Matter’s core mission dedicated to the dissemination, understanding, and appreciation of artists’ books.\nNYABF 2025 takes place from Thursday, September 11, through Sunday, September 14, and will feature a wide range of interdisciplinary artistic practices, including self-publishing artists, collectives, small presses, institutions, rare and out-of-print book dealers, and art book distributors. With each fair, Printed Matter continues to foreground programs that address the present moment, while also working to increase awareness around artists’ books by providing various access points for visitors to engage with printed material in enriching and discursive ways.\nThis upcoming iteration of the fair includes special projects and installations by Boo-Hooray, Bread & Puppet Press, Corraini Edizioni, Hat & Beard Press, Special Special and 4N, Three Star Books, and an exhibition of archival material from The Detroit Printing Co-op. Two new screen-printed artist editions, “Untitled” (2025) by Huma Bhabha and “The 2nd Merlyn” (2025) by Richard Tuttle, will also be released during the fair.\nJoin [Printed Matter](https://bit.ly/4mCAa3m) on Thursday, September 11, from 7–10 PM for the Opening Night celebration, with music from Lydo, Sydney Spann, and voyeur. The first five hundred guests will also receive a limited ticket edition by Lyric Shen.\n**To learn more, visit ****pmabf.org****.**",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/megan-mack-185915-1-1-scaled.jpg?fit=2560%2C1707&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1037592/the-2025-ny-art-book-fair-returns-to-moma-ps1/",
    "sourceName": "hyperallergic.com",
    "author": "Printed Matter, Inc."
  }
]