[
  {
    "slug": "the-artist-whose-fauci-portraits-enraged-the-white-house",
    "title": "The Artist Whose Fauci Portraits Enraged the White House",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "In 2019, Hugo Crosthwaite became the first Latino artist to win the Smithsonian National Portrait Gallery’s (NPG) prestigious triennial Outwin Boochever Portrait Competition. The Tijuana-born and San Diego-based illustrator received the contest’s grand prize: $25,000 and a por…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/whitehousefauci.jpeg?fit=2140%2C1610&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038060/hugo-crosthwaite-artist-whose-fauci-portraits-enraged-the-white-house/",
    "author": "AventurOO Editorial",
    "body": "<p>In 2019, Hugo Crosthwaite became the first Latino artist to win the Smithsonian National Portrait Gallery’s (NPG) prestigious triennial Outwin Boochever Portrait Competition. The Tijuana-born and San Diego-based illustrator received the contest’s grand prize: $25,000 and a portrait commission for the museum’s permanent collection. He chose to depict Anthony Fauci, then the director of the National Institute of Allergy and Infectious Diseases (NIAID), in a stop-motion format that captures the nuances of his complicated legacy, including his <a href=\"https://www.pbs.org/wnet/americanmasters/how-dr-fauci-handled-aids-crisis-jexipk/26361/\">criticized and then celebrated</a> oversight of the HIV/AIDs epidemic.</p>\n<p>Last week, Crosthwaite found his hard-won commission on a list of Smithsonian items that the White House found objectionable. He was one of at least three Mexican-born artists whose work was included on <a href=\"https://hyperallergic.com/1036180/trump-targets-lgbtq-history-migrants-and-more-in-chilling-smithsonian-hit-list/\">Trump’s art hit list</a>, along with illustrator <a href=\"https://hyperallergic.com/1036180/trump-targets-lgbtq-history-migrants-and-more-in-chilling-smithsonian-hit-list/\">Rigoberto González</a> and painter <a href=\"https://hyperallergic.com/1037811/smithsonian-latino-gallery-quietly-closes-for-nine-months/\">Felipe Galindo Gómez</a>.</p>\n<p>“My first reaction was surprise,” Crosthwaite shared in an interview with <i>Hyperallergic. </i>“But then later on, [I] felt a bit of pride to be included in this list of other wonderful artists and wonderful projects that talk about the diversity of the United States’ history.”</p>\n<p>In 2022, after winning the Outwin competition, Crosthwaite and the NPG considered a list of individuals for a portrait. They agreed on Fauci as the commission’s subject. At the time, the infectious disease specialist was a polarized figure: a revered pandemic hero and a detested political opponent of the right.</p>\n<p>“I jumped at the chance of doing this because it was 2022, we were in the middle of the COVID-19 pandemic,” Crosthwaite told <i>Hyperallergic</i>. “He became a symbol of this fight between science and truth, against conspiracy theories; Dr. Fauci kind of epitomizes the nation’s current political divide.”</p>\n<p>The five-minute stop motion animation, “A Portrait of Dr. Anthony Fauci” (2022), begins by portraying him as a young scientist in a lab. Later, a man infected by an unnamed virus becomes emaciated until he disappears into a black hole that morphs into a scene from ACT UP protests. Men carry signs that read “Silence = Death” and “Killed by the System.” Behind them, skeletons look to the sky.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1038060/hugo-crosthwaite-artist-whose-fauci-portraits-enraged-the-white-house/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-shocking-allure-of-erotic-abstraction",
    "title": "The Shocking Allure of Erotic Abstraction",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "LONDON — Some of the Courtauld’s previous exhibitions have suffered from insufficient curation . Abstract Erotic: Louise Bourgeois, Alice Adams, Eva Hesse , on the other hand, strikes the exact right balance. Drawing on scholar Jo Applin’s research, curator Alexandra Gerstein …",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/eed0c-scaled.jpeg?fit=2560%2C2113&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1035805/the-shocking-allure-of-erotic-abstraction-courtauld-gallery/",
    "author": "AventurOO Editorial",
    "body": "<p>LONDON — Some of the Courtauld’s previous exhibitions have <a href=\"https://hyperallergic.com/1010475/the-cortaulds-impressionism-show-is-a-victim-of-corporate-curating/\">suffered from insufficient curation</a>. <a href=\"https://courtauld.ac.uk/whats-on/exh-abstract-erotic/\"> Abstract Erotic: Louise Bourgeois, Alice Adams, Eva Hesse</a>, on the other hand, strikes the exact right balance. Drawing on scholar Jo Applin’s research, curator Alexandra Gerstein has taken as a starting point the work of feminist curator and critic Lucy Lippard, who coined the titular term to describe this sensuous strand of art emerging in 1960s New York. Making perhaps the best use yet of the Courtauld’s teeny exhibition spaces next to the permanent collection, this small but unstuffed show gives proper breathing space for artistic dialogue and, crucially, for the viewer to engage in exploring differences and similarities between works and practices for themselves. </p>\n<p>In 1966, Lippard curated the exhibition <i>Eccentric Abstraction</i> to capture a new wave of sculptures created from unusual, pliable materials like wire, plastic mesh, netting, and latex, which evoked tactile organic forms and, by extension, the human body. This is the Courtauld’s first show devoted to standalone sculpture, and the contrast between these blob-like forms and its Impressionist-heavy permanent collection may go some way to recreate just how different — even alarming — these pieces will have appeared to 1960s audiences just getting over the shock of Abstract Expressionism’s  rehauling of formalist painting.</p>\n<p><i>Abstract Erotic: Louise Bourgeois, Eva Hesse, Alice Adams</i>, featuring works by Eva Hesse and Alice Adams (all photos Olivia McEwan/</p>\n<p><i>Hyperallergic</i>)</p>\n<p>The three artists are each afforded an introductory caption presenting historical context. No direct written comparisons are made between them, nor any attempt to force commonality, for historically, there is none other than their working in generally the same space and time. This is good curating: The show allows viewers to ask and think for themselves. Its skill lies in making suggestions via the pieces selected for display, allowing for robust visual comparison. Viewers won’t be able to ignore the strain of eroticism that stems from their irresistible tactility, which is both alluring and fear-inducing, nor their uncanny resemblance to certain human appendages (<i>ahem</i>).</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1035805/the-shocking-allure-of-erotic-abstraction-courtauld-gallery/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "reclaiming-a-whitewashed-history-of-the-great-depression",
    "title": "Reclaiming a Whitewashed History of the Great Depression",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "When the United States Department of Agriculture established the Farm Security Administration (FSA) in 1937, hoping to provide aid to rural communities affected by the Great Depression, it also implemented a photography project headed by government official Roy Stryker. The ph…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/dzNBe-scaled.jpeg?fit=2560%2C1843&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038134/reclaiming-a-whitewashed-history-of-the-great-depression-museum-art-light-kansas/",
    "author": "AventurOO Editorial",
    "body": "<p>When the United States Department of Agriculture established the Farm Security Administration (FSA) in 1937, hoping to provide aid to rural communities affected by the Great Depression, it also implemented a photography project headed by government official Roy Stryker. The photographs were meant to generate support for the agency, allowing the public to witness the impacts of the Depression for themselves. Made by recruited photographers and then selected by Stryker for inclusion in traveling exhibitions and news outlets, the chosen images overwhelmingly depicted White families — a narrow and literally whitewashed view of rural America.</p>\n<p><i> Crafting Sanctuaries: Black Spaces of the Black Great Depression South</i>, a new exhibition at the Museum of Art and Light in Manhattan, Kansas, showcases a broader view of FSA imagery, focusing on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, Russell Lee, Marion Post Wolcott, Arthur Rothstein, Ben Shahn, and Jack Delano across six states: Alabama, Georgia, Louisiana, Florida, Mississippi, and Missouri. </p>\n<p>Presented in partnership with Art Bridges Foundation, the photos highlight the intimacy of life among one’s community — private quarters, public gathering spaces — and the care taken to build one together. The exhibition, curator Tamir Williams told <i>Hyperallergic</i>, “is an examination of the significance of Black Southerners investing in their spatial worlds — and more largely in beauty — while living through this intense period of economic hardship and racial violence.”</p>\n<p>During the summer of 2023, Ashley Holland, curator and director of Curatorial Initiatives for the Art Bridges Foundation, approached Williams to curate its first in-house traveling exhibition, drawing from the FSA photography collection. At the time, they’d just begun a job there as a curatorial research assistant.</p>\n<p>“I came across Nicholas Natanson’s <i> The Black Image in the New Deal: The Politics of FSA Photography</i> (1992) and Sarah Boxer’s ‘</p>\n<p><a href=\"https://www.theatlantic.com/magazine/archive/2020/12/whitewashing-the-great-depression/616936/\">Whitewashing the Great Depression</a>’ (2020) for</p>\n<p><i>The Atlantic</i>,” Williams said. “I knew that I wanted to focus on this issue of the absence of Black and other non-White persons from the larger visual memory of the Great Depression — and specifically explore how and why this exclusion happened and how it could be redressed.”</p>\n<p>Williams spent a week at the Library of Congress poring over the digital FSA collection. They were drawn to images of small homes built by both White and Black laborers, particularly in La Forge, Missouri. Curious about “what home and homemaking might have looked like for other Black persons and families beyond La Forge,” they expanded their research.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1038134/reclaiming-a-whitewashed-history-of-the-great-depression-museum-art-light-kansas/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "art-dealers-get-candid-ahead-of-the-armory-show",
    "title": "Art Dealers Get Candid Ahead of the Armory Show",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Joe Amrhein and Susan Swenson were going to sit out the Armory Show this fall for the first time in a quarter century until they got a call last month from the fair’s director.",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/armory.jpg?fit=2355%2C1864&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038050/new-york-art-dealers-get-candid-ahead-of-the-armory-show-2025/",
    "author": "AventurOO Editorial",
    "body": "<p>Joe Amrhein and Susan Swenson were going to sit out the Armory Show this fall for the first time in a quarter century until they got a call last month from the fair’s director.</p>\n<p>The owners of Pierogi Gallery in Brooklyn’s Williamsburg neighborhood initially did not apply this year due to the show’s rising booth costs, which can exceed tens of thousands of dollars. Pierogi is planning the next phase of its business, which could include <a href=\"https://hyperallergic.com/970425/a-williamsburg-family-reunion-at-pierogi-gallery-30th-anniversary-opening/\">relocating to Lower Manhattan</a>. </p>\n<p>But Armory executives Kyla McMillan and J. Tyler Woodall appealed to Pierogi and the fair’s shared history — in 2016, Amrhein suggested the Armory use an empty space to display Jonathan Schipper’s <a href=\"https://www.jonathanschipper.com/slow-motion-car-crash\">installation</a> of a Volkswagen Golf crashing into a wall; the presentation of large-scale art has since become a cornerstone of the show. They recently negotiated a smaller exhibition space for Pierogi with a lower rate, enabling the gallery to return.</p>\n<p>“We had been on the fence about it since the economy is very uncertain and it’s a big investment,” Swenson said. “We’re not one of the big box galleries. Some of them have their own economies now.”</p>\n<p>The Armory Show has come a long way from exhibiting several New York gallerists on three floors of the Gramercy Park Hotel in the mid-1990s. Since 2021, the fair has set up camp at the spacious Javits Center near Manhattan’s Hudson Yards, where it will host some 230 galleries from more than 35 countries from September 4 through 7.</p>\n<p>The show also has new owners. Two years after Frieze <a href=\"https://www.frieze.com/article/frieze-acquires-armory-show-and-expo-chicago\">acquired</a> the Armory Show and EXPO Chicago, its parent company, Endeavor Group Holdings, sold its roster of art fairs for <a href=\"https://variety.com/2025/biz/news/ari-emanuel-buys-frieze-endeavor-group-1236383561/\">$200 million</a> to Hollywood superagent Ari Emmanuel. The former Endeavor CEO envisions Frieze as a key piece of a new global events company he formed this year, and perhaps one positioned to compete with Art Basel’s dominance in the contemporary art market.</p>\n<p>But with a reported downturn in the market, galleries have been weighing their options.</p>\n<p>Once mainstays at the Armory, blue-chip institutions have instead drifted toward Frieze’s <a href=\"https://hyperallergic.com/1011006/frieze-new-york-is-back-to-its-old-ways/\">spring fair</a>, the Art Dealers Association of America’s (ADAA) Art Show (before it was abruptly <a href=\"https://hyperallergic.com/1032202/as-adaas-art-show-changes-course-a-nonprofit-is-left-in-limbo/\">canceled</a> this year), or TEFAF New York — or they are skipping the New York fairs entirely. David Zwirner hasn’t exhibited at the Amory Show since <a href=\"https://www.davidzwirner.com/fairs/2022/the-armory-show\">2022</a>, and chose to show at ADAA several years before that. Pace Gallery’s last year at the Armory was <a href=\"https://www.pacegallery.com/artfairs/the-armory-show-4/#:~:text=At%20The%20Armory%20Show%202019%2C%20Pace%20Gallery%20will%20present%20a,of%20twelve%20LED%20panel%20artworks.\">2021</a>. Gagosian hasn’t shown at the Amory since <a href=\"https://gagosian.com/fairs-and-collecting/fairs/armory-show-new-york-2020-rudolf-polanszky/\">2020</a>, back when it was held at Piers 92 and 94. Lisson hasn’t been at the fair since <a href=\"https://www.lissongallery.com/news/lisson-gallery-at-the-armory-show-s-25th-edition\">2019</a>.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1038050/new-york-art-dealers-get-candid-ahead-of-the-armory-show-2025/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "facing-15m-budget-deficit-calarts-lays-off-workers",
    "title": "Facing $15M Budget Deficit, CalArts Lays Off Workers",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "A round of layoffs at the California Institute of the Arts (CalArts) this summer is raising alarms at one of the best-known arts schools in the country as the institution grapples with rising costs.",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/1620px-2012-1104-CalArts01.jpg?fit=1620%2C1080&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038229/facing-15m-budget-deficit-calarts-lays-off-workers/",
    "author": "AventurOO Editorial",
    "body": "<p>A round of layoffs at the California Institute of the Arts (CalArts) this summer is raising alarms at one of the best-known arts schools in the country as the institution grapples with rising costs.</p>\n<p>The Santa Clarita-based private arts school laid off nine administrative employees in July, including five unionized workers and four non-union workers, claiming in a schoolwide message that CalArts needed to cut expenses in the face of a projected <a href=\"https://calarts.edu/sites/default/files/2025-05/Toward%20a%20Sustainable%20Financial%20Future%20for%20CalArts.pdf\">$15 million deficit</a>.</p>\n<p>“The nine staff positions, as well as about a dozen vacant staff positions, are being eliminated as part of a necessary workforce reduction, which will enable CalArts to address a structural deficit, prioritize student-facing services, and better align our staffing with current and projected enrollments to continue providing exceptional educational opportunities to our students,” a CalArts spokesperson told <i>Hyperallergic</i>.</p>\n<p>But faculty and staff members are questioning the administration’s decision, arguing that the layoffs could harm the school’s ability to train and nurture the next generation of artists.</p>\n<p>“Everyone was disappointed in this having to happen at all when we’re working so hard to try to better serve the population,” Emily Lytle-Painter, a web and digital media producer at CalArts and union member, told <i>Hyperallergic</i>. “When we were trying to go into discussions with the administration, we felt like there were other avenues.”</p>\n<p>Tensions between CalArts employees and school leadership have been simmering since last fall, when dozens of faculty and staff <a href=\"https://www.instagram.com/p/DCikoHURbCM/?hl=en\">decided to form a union</a> after enduring what they described as years of stagnant wages, increased workloads, and minimal benefits. In December, CalArts faculty <a href=\"https://hyperallergic.com/972509/calarts-staff-and-faculty-move-to-unionize/\">delivered a letter</a> to President Ravi Rajan announcing their intention to organize with United Auto Workers in a unit that would represent approximately 600 workers. They held elections in March and ratified the union a month later.</p>\n<p>At the same time, the school had been struggling with enrollment, which <a href=\"https://www.insidehighered.com/news/institutions/specialized-colleges/2024/04/08/enrollment-declines-threaten-small-independent#:~:text=Though%20it\"s%20enrollment%20has%20also,creative%20industries%2C%E2%80%9D%20Rajan%20said.\">declined</a> by about 12 percent since the pandemic, from 1,532 students in 2019 to 1,353 students in 2023 (tuition surpassed <a href=\"https://calarts.edu/admissions-aid/tuition/tuition-and-fees/cost-attendance\">$60,000</a> per year in 2025–26). </p>\n<p>In an April 2024 interview, Rajan told <i>Inside Higher Education</i> that CalArts was “<a href=\"https://www.insidehighered.com/news/institutions/specialized-colleges/2024/04/08/enrollment-declines-threaten-small-independent#:~:text=Though%20it\"s%20enrollment%20has%20also,creative%20industries%2C%E2%80%9D%20Rajan%20said.\">fiscally sound</a>.” But the school proceeded with several budget cuts to reduce its operating costs, including tighter spending controls, hiring delays and travel limitations, and adjustments to admissions and financial aid packages. These measures, Rajan said in a schoolwide message, saved the school $5.5 million.</p>\n<p>This spring, CalArts sought to reduce its headcount and sent voluntary separation and early retirement notices to between 50 and 60 faculty and staff, union leaders estimated. But only 32 employees, including 22 faculty and 10 staff, took the school’s offer and Rajan moved ahead with layoffs despite vociferous <a href=\"https://www.instagram.com/p/DN3-oBcEmIH/?igsh=MXExOWNyY2VhY2J5Yg%3D%3D\">objections</a> from the union. </p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1038229/facing-15m-budget-deficit-calarts-lays-off-workers/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-2025-ny-art-book-fair-returns-to-moma-ps1",
    "title": "The 2025 NY Art Book Fair Returns to MoMA PS1",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Initiated in 2006, the NY Art Book Fair (NYABF) is a celebration and international gathering for artists’ book publishers to distribute their work, connect with broad audiences, and nurture new and longstanding relationships. This year’s fair marks an exciting and long-awaited…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/megan-mack-185915-1-1-scaled.jpg?fit=2560%2C1707&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1037592/the-2025-ny-art-book-fair-returns-to-moma-ps1/",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <p>Initiated in 2006, the <a href=\"https://bit.ly/3UL7B7w\">NY Art Book Fair (NYABF)</a> is a celebration and international gathering for artists’ book publishers to distribute their work, connect with broad audiences, and nurture new and longstanding relationships. This year’s fair marks an exciting and long-awaited return to <a href=\"https://bit.ly/4n2LZ2w\">MoMA PS1</a>, Printed Matter’s venue partner from 2009–2019, a pivotal decade in expanding the fair’s reach and impact, establishing NYABF as a cornerstone for the distribution of artists’ books and the preeminent gathering point for celebrating the form. This partnership also exemplifies a shared commitment to creating spaces where audiences can engage with new ideas and perspectives, while reaffirming Printed Matter’s core mission dedicated to the dissemination, understanding, and appreciation of artists’ books.</p>\n    <p>NYABF 2025 takes place from Thursday, September 11, through Sunday, September 14, and will feature a wide range of interdisciplinary artistic practices, including self-publishing artists, collectives, small presses, institutions, rare and out-of-print book dealers, and art book distributors. With each fair, Printed Matter continues to foreground programs that address the present moment, while also working to increase awareness around artists’ books by providing various access points for visitors to engage with printed material in enriching and discursive ways.</p>\n    <p>This upcoming iteration of the fair includes special projects and installations by Boo-Hooray, Bread &amp; Puppet Press, Corraini Edizioni, Hat &amp; Beard Press, Special Special and 4N, Three Star Books, and an exhibition of archival material from The Detroit Printing Co-op. Two new screen-printed artist editions, “Untitled” (2025) by Huma Bhabha and “The 2nd Merlyn” (2025) by Richard Tuttle, will also be released during the fair.</p>\n    <p>Join <a href=\"https://bit.ly/4mCAa3m\">Printed Matter</a> on Thursday, September 11, from 7–10 PM for the Opening Night celebration, with music from Lydo, Sydney Spann, and voyeur. The first five hundred guests will also receive a limited ticket edition by Lyric Shen.</p>\n    <p>\n      <strong>To learn more, visit </strong>\n      <strong>pmabf.org</strong>\n      <strong>.</strong>\n    </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1037592/the-2025-ny-art-book-fair-returns-to-moma-ps1/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "move-over-nashville-this-underrated-city-is-tennessee-s-trendiest-fall",
    "title": "Move Over Nashville! This Underrated City Is Tennessee’s Trendiest Fall Destination",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "Sorry, Nashville. Broadway lights are dimming this fall in favor of another Tennessee city. As leaves begin to shed and temps begin to drop, the astounding Smokies scenery, neon honky-tonks, and ‘smooooth Tennessee whiskey' are far from the only draw to the “Volunteer State”. Expected to be the state's trendiest fall destination, largely backed by lively festivals and stunning natural attractions, this city is also deeply rooted in intriguing Civil War history, locomotive heritage resulting in scenic train rides, and ample ways to explore the outdoors in the midst of autumn's luminous colors. Chattanooga may not have been on your Bingo card this year, but it's not too late to swap it out for wherever else you had planned. Don't pass up the opportunity to explore perhaps Tennessee's most underrated getaway that will no doubt be overflowing with fall splendor, quintessential Southern charm, and surprisingly luxe stays for a city that's still clinging on to “hidden gem” status. Whiskey River, Take Your Mind Alright, there's no actual “whiskey river” per se, but one can dream, right? But in a state steeped in grandpappy's medicine, it goes without saying Chattanooga can go toe-to-toe with the best bars for a night out. Bar-hopping, as fun as it may be, is nowhere near the only fun thing to do here, despite a buzzing downtown with a mix of college crowds and people like me hanging on to their last sliver of youth. One instantly noticeable enticement to the city is the winding Tennessee River, that is still a blast to visit during the fall. Hop aboard the Southern Belle, a popular riverboat cruise for sunset and general sightseeing tours. If it were me, this would be a priority night one, as it's easily accessible from the city center and a great way to get your bearings. Otherwise, wake up and start your day with a coffee in hand and a stroll along the Chattanooga Riverwalk, lined with 16 miles of paved trails. Other fun activities include fishing, kayakin,g and paddle-boarding, all of which equipment can be rented. But the river comes alive more than ever this fall as a base for 3 Sisters Bluegrass Festival for a two-day affair October 3 – 4, and the one-of-a-kind Head of the Hooch Regatta, one of the largest rowing events in the world at the turn of November. Travel Tip: If Bluegrass music is your jam, the World of Bluegrass is taking over Chattanooga through 2027, beginning September 16, 2025 — Read all about what it entails here! Witness Stunning Nature: Staggering Waterfalls & Sweeping Outlooks Ruby Falls isn't just one of Tennessee's most eye-popping natural wonders — that can be said for the entirety of…",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/Move-Over-Nashville-This-Underrated-City-Is-Tennessees-Trendiest-Fall-Destination-.jpg",
    "source": "https://www.traveloffpath.com/move-over-nashville-this-underrated-city-is-tennessees-trendiest-fall-destination/"
  }
]