[
  {
    "slug": "decode-the-art-fair-lingo-with-our-armory-show-bingo-card",
    "title": "Decode the Art Fair Lingo With Our Armory Show Bingo Card",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Each year, come September, we all pretend the world isn’t burning and put on our best oversized shirt to work our way through the maze of booths that is New York’s Armory Show. For those of you who want to know where to go and what to see, here’s our guide to the fall’s fairs …",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/fair-bingo.jpg?fit=1200%2C900&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038245/art-fair-armory-show-2025-bingo-card/",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <graphic src=\"https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/bingo-card-1-1200x1488.jpg?resize=1200%2C1488&amp;quality=90&amp;ssl=1\"/>\n    <p>Each year, come September, we all pretend the world isn’t burning and put on our best oversized shirt to work our way through the maze of booths that is New York’s Armory Show. For those of you who want to know where to go and what to see, here’s our <a href=\"https://hyperallergic.com/1037354/nyc-fall-2025-art-fair-guide/\">guide to the fall’s fairs</a>. And for my fellow cynics, behold our Bingo Card. This edition is peppered with classic phrases you might hear in the art world (and what they <i>really</i> mean). </p>\n    <p>So I’ll see you there! I’ll be holding an iced matcha latte, rolling my eyes at yet another pair of Margiela Tabi shoes, standing in a sandwich line longer than any artist’s waiting list, trying to decode what that gallery meant by “the art resists categorization” … oh, hey, BINGO! — <i>Valentina Di Liscia</i>, <i>News Editor</i></p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1038245/art-fair-armory-show-2025-bingo-card/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-prescient-politics-of-nancy-buchanan-s-art",
    "title": "The Prescient Politics of Nancy Buchanan’s Art",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "LOS ANGELES — Truthfully, Nancy Buchanan: A Retrospective at the Brick, a comprehensive survey of the LA-based artist’s work, is as sprawling and diverse as the city she calls home. Buchanan studied art at the University of California, Irvine, from 1965 to 1971, along with fel…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/NB1-copy.jpg?fit=1482%2C1063&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1036988/prescient-politics-of-nancy-buchanan-art-the-brick-los-angeles/",
    "author": "AventurOO Editorial",
    "body": "<p>LOS ANGELES — <i> Truthfully, Nancy Buchanan: A Retrospective</i> at the Brick, a comprehensive survey of the LA-based artist’s work, is as sprawling and diverse as the city she calls home. Buchanan studied art at the University of California, Irvine, from 1965 to 1971, along with fellow classmates (and single mothers) Barbara T. Smith and Marcia Hafif, who would become her longtime friends and collaborators. Soon, LA peers Chris Burden, Ulysses Jenkins, and Michael Zinzun, among many others, would also work with Buchanan, together helping to define the 1970s Southern California art scene. As core faculty at the California Institute of the Arts (CalArts) for more than 30 years, as well as a founding member of the experimental F Space Gallery, and an integral part of </p>\n<p><a href=\"https://thewomansbuilding.org\">the Woman’s Building</a>, Buchanan has remained deeply engaged with the city’s artistic community for more than five decades.</p>\n<p>The exhibition’s curators draw from an expansive body of work spanning video, performance, drawing, painting, sculpture, collage, and installation. Each of the space’s nine galleries focuses on a theme that runs through Buchanan’s oeuvre, such as hair, interiors, and consumption. Early works reveal her eager engagement with both feminist politics and consumer culture; in the mock video advertisement “These Creatures” (1979), images of young women with ghoulishly applied makeup are paired with a male voiceover that asks “Isn’t it amazing that we allow them to live among us, these creatures that we can and do control?”</p>\n<p>Equally unsettling are a number of pieces that deal with military intervention and weapons technology. The installations “<a href=\"https://primo.getty.edu/primo-explore/fulldisplay/GETTY_ALMA21126289310001551/GRI\">Fallout from the Nuclear Family</a>” (1980) and “Security” (1985) incorporate documents from Buchanan’s father’s career as a nuclear physicist and the artist’s own research into his complicated involvement in the development of atomic weapons. In the same gallery, “…And Babies?” (2003–6) presents a large glass jar, like one might see in a laboratory setting, containing a video projection of malformed fetuses and deceased babies that Buchanan witnessed in a hospital in Vietnam, preserved to document the effects of the US use of Agent Orange in that country in the 1960s. Perhaps more horrifying is that Buchanan’s work could easily be replicated to reference <a href=\"https://www.theguardian.com/world/2010/dec/30/faulluja-birth-defects-iraq\">the birth defects caused by depleted uranium used in the US invasion of Iraq in 2004</a>, and other untold military conflicts.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1036988/prescient-politics-of-nancy-buchanan-art-the-brick-los-angeles/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "reclaiming-a-whitewashed-history-of-the-great-depression",
    "title": "Reclaiming a Whitewashed History of the Great Depression",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "When the United States Department of Agriculture established the Farm Security Administration (FSA) in 1937, hoping to provide aid to rural communities affected by the Great Depression, it also implemented a photography project headed by government official Roy Stryker. The ph…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/dzNBe-scaled.jpeg?fit=2560%2C1843&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038134/reclaiming-a-whitewashed-history-of-the-great-depression-museum-art-light-kansas/",
    "author": "AventurOO Editorial",
    "body": "<p>When the United States Department of Agriculture established the Farm Security Administration (FSA) in 1937, hoping to provide aid to rural communities affected by the Great Depression, it also implemented a photography project headed by government official Roy Stryker. The photographs were meant to generate support for the agency, allowing the public to witness the impacts of the Depression for themselves. Made by recruited photographers and then selected by Stryker for inclusion in traveling exhibitions and news outlets, the chosen images overwhelmingly depicted White families — a narrow and literally whitewashed view of rural America.</p>\n<p><i> Crafting Sanctuaries: Black Spaces of the Black Great Depression South</i>, a new exhibition at the Museum of Art and Light in Manhattan, Kansas, showcases a broader view of FSA imagery, focusing on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, Russell Lee, Marion Post Wolcott, Arthur Rothstein, Ben Shahn, and Jack Delano across six states: Alabama, Georgia, Louisiana, Florida, Mississippi, and Missouri. </p>\n<p>Presented in partnership with Art Bridges Foundation, the photos highlight the intimacy of life among one’s community — private quarters, public gathering spaces — and the care taken to build one together. The exhibition, curator Tamir Williams told <i>Hyperallergic</i>, “is an examination of the significance of Black Southerners investing in their spatial worlds — and more largely in beauty — while living through this intense period of economic hardship and racial violence.”</p>\n<p>During the summer of 2023, Ashley Holland, curator and director of Curatorial Initiatives for the Art Bridges Foundation, approached Williams to curate its first in-house traveling exhibition, drawing from the FSA photography collection. At the time, they’d just begun a job there as a curatorial research assistant.</p>\n<p>“I came across Nicholas Natanson’s <i> The Black Image in the New Deal: The Politics of FSA Photography</i> (1992) and Sarah Boxer’s ‘</p>\n<p><a href=\"https://www.theatlantic.com/magazine/archive/2020/12/whitewashing-the-great-depression/616936/\">Whitewashing the Great Depression</a>’ (2020) for</p>\n<p><i>The Atlantic</i>,” Williams said. “I knew that I wanted to focus on this issue of the absence of Black and other non-White persons from the larger visual memory of the Great Depression — and specifically explore how and why this exclusion happened and how it could be redressed.”</p>\n<p>Williams spent a week at the Library of Congress poring over the digital FSA collection. They were drawn to images of small homes built by both White and Black laborers, particularly in La Forge, Missouri. Curious about “what home and homemaking might have looked like for other Black persons and families beyond La Forge,” they expanded their research.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1038134/reclaiming-a-whitewashed-history-of-the-great-depression-museum-art-light-kansas/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "art-dealers-get-candid-ahead-of-the-armory-show",
    "title": "Art Dealers Get Candid Ahead of the Armory Show",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Joe Amrhein and Susan Swenson were going to sit out the Armory Show this fall for the first time in a quarter century until they got a call last month from the fair’s director.",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/armory.jpg?fit=2355%2C1864&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038050/new-york-art-dealers-get-candid-ahead-of-the-armory-show-2025/",
    "author": "AventurOO Editorial",
    "body": "<p>Joe Amrhein and Susan Swenson were going to sit out the Armory Show this fall for the first time in a quarter century until they got a call last month from the fair’s director.</p>\n<p>The owners of Pierogi Gallery in Brooklyn’s Williamsburg neighborhood initially did not apply this year due to the show’s rising booth costs, which can exceed tens of thousands of dollars. Pierogi is planning the next phase of its business, which could include <a href=\"https://hyperallergic.com/970425/a-williamsburg-family-reunion-at-pierogi-gallery-30th-anniversary-opening/\">relocating to Lower Manhattan</a>. </p>\n<p>But Armory executives Kyla McMillan and J. Tyler Woodall appealed to Pierogi and the fair’s shared history — in 2016, Amrhein suggested the Armory use an empty space to display Jonathan Schipper’s <a href=\"https://www.jonathanschipper.com/slow-motion-car-crash\">installation</a> of a Volkswagen Golf crashing into a wall; the presentation of large-scale art has since become a cornerstone of the show. They recently negotiated a smaller exhibition space for Pierogi with a lower rate, enabling the gallery to return.</p>\n<p>“We had been on the fence about it since the economy is very uncertain and it’s a big investment,” Swenson said. “We’re not one of the big box galleries. Some of them have their own economies now.”</p>\n<p>The Armory Show has come a long way from exhibiting several New York gallerists on three floors of the Gramercy Park Hotel in the mid-1990s. Since 2021, the fair has set up camp at the spacious Javits Center near Manhattan’s Hudson Yards, where it will host some 230 galleries from more than 35 countries from September 4 through 7.</p>\n<p>The show also has new owners. Two years after Frieze <a href=\"https://www.frieze.com/article/frieze-acquires-armory-show-and-expo-chicago\">acquired</a> the Armory Show and EXPO Chicago, its parent company, Endeavor Group Holdings, sold its roster of art fairs for <a href=\"https://variety.com/2025/biz/news/ari-emanuel-buys-frieze-endeavor-group-1236383561/\">$200 million</a> to Hollywood superagent Ari Emmanuel. The former Endeavor CEO envisions Frieze as a key piece of a new global events company he formed this year, and perhaps one positioned to compete with Art Basel’s dominance in the contemporary art market.</p>\n<p>But with a reported downturn in the market, galleries have been weighing their options.</p>\n<p>Once mainstays at the Armory, blue-chip institutions have instead drifted toward Frieze’s <a href=\"https://hyperallergic.com/1011006/frieze-new-york-is-back-to-its-old-ways/\">spring fair</a>, the Art Dealers Association of America’s (ADAA) Art Show (before it was abruptly <a href=\"https://hyperallergic.com/1032202/as-adaas-art-show-changes-course-a-nonprofit-is-left-in-limbo/\">canceled</a> this year), or TEFAF New York — or they are skipping the New York fairs entirely. David Zwirner hasn’t exhibited at the Amory Show since <a href=\"https://www.davidzwirner.com/fairs/2022/the-armory-show\">2022</a>, and chose to show at ADAA several years before that. Pace Gallery’s last year at the Armory was <a href=\"https://www.pacegallery.com/artfairs/the-armory-show-4/#:~:text=At%20The%20Armory%20Show%202019%2C%20Pace%20Gallery%20will%20present%20a,of%20twelve%20LED%20panel%20artworks.\">2021</a>. Gagosian hasn’t shown at the Amory since <a href=\"https://gagosian.com/fairs-and-collecting/fairs/armory-show-new-york-2020-rudolf-polanszky/\">2020</a>, back when it was held at Piers 92 and 94. Lisson hasn’t been at the fair since <a href=\"https://www.lissongallery.com/news/lisson-gallery-at-the-armory-show-s-25th-edition\">2019</a>.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1038050/new-york-art-dealers-get-candid-ahead-of-the-armory-show-2025/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "facing-15m-budget-deficit-calarts-lays-off-workers",
    "title": "Facing $15M Budget Deficit, CalArts Lays Off Workers",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "A round of layoffs at the California Institute of the Arts (CalArts) this summer is raising alarms at one of the best-known arts schools in the country as the institution grapples with rising costs.",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/1620px-2012-1104-CalArts01.jpg?fit=1620%2C1080&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038229/facing-15m-budget-deficit-calarts-lays-off-workers/",
    "author": "AventurOO Editorial",
    "body": "<p>A round of layoffs at the California Institute of the Arts (CalArts) this summer is raising alarms at one of the best-known arts schools in the country as the institution grapples with rising costs.</p>\n<p>The Santa Clarita-based private arts school laid off nine administrative employees in July, including five unionized workers and four non-union workers, claiming in a schoolwide message that CalArts needed to cut expenses in the face of a projected <a href=\"https://calarts.edu/sites/default/files/2025-05/Toward%20a%20Sustainable%20Financial%20Future%20for%20CalArts.pdf\">$15 million deficit</a>.</p>\n<p>“The nine staff positions, as well as about a dozen vacant staff positions, are being eliminated as part of a necessary workforce reduction, which will enable CalArts to address a structural deficit, prioritize student-facing services, and better align our staffing with current and projected enrollments to continue providing exceptional educational opportunities to our students,” a CalArts spokesperson told <i>Hyperallergic</i>.</p>\n<p>But faculty and staff members are questioning the administration’s decision, arguing that the layoffs could harm the school’s ability to train and nurture the next generation of artists.</p>\n<p>“Everyone was disappointed in this having to happen at all when we’re working so hard to try to better serve the population,” Emily Lytle-Painter, a web and digital media producer at CalArts and union member, told <i>Hyperallergic</i>. “When we were trying to go into discussions with the administration, we felt like there were other avenues.”</p>\n<p>Tensions between CalArts employees and school leadership have been simmering since last fall, when dozens of faculty and staff <a href=\"https://www.instagram.com/p/DCikoHURbCM/?hl=en\">decided to form a union</a> after enduring what they described as years of stagnant wages, increased workloads, and minimal benefits. In December, CalArts faculty <a href=\"https://hyperallergic.com/972509/calarts-staff-and-faculty-move-to-unionize/\">delivered a letter</a> to President Ravi Rajan announcing their intention to organize with United Auto Workers in a unit that would represent approximately 600 workers. They held elections in March and ratified the union a month later.</p>\n<p>At the same time, the school had been struggling with enrollment, which <a href=\"https://www.insidehighered.com/news/institutions/specialized-colleges/2024/04/08/enrollment-declines-threaten-small-independent#:~:text=Though%20it\"s%20enrollment%20has%20also,creative%20industries%2C%E2%80%9D%20Rajan%20said.\">declined</a> by about 12 percent since the pandemic, from 1,532 students in 2019 to 1,353 students in 2023 (tuition surpassed <a href=\"https://calarts.edu/admissions-aid/tuition/tuition-and-fees/cost-attendance\">$60,000</a> per year in 2025–26). </p>\n<p>In an April 2024 interview, Rajan told <i>Inside Higher Education</i> that CalArts was “<a href=\"https://www.insidehighered.com/news/institutions/specialized-colleges/2024/04/08/enrollment-declines-threaten-small-independent#:~:text=Though%20it\"s%20enrollment%20has%20also,creative%20industries%2C%E2%80%9D%20Rajan%20said.\">fiscally sound</a>.” But the school proceeded with several budget cuts to reduce its operating costs, including tighter spending controls, hiring delays and travel limitations, and adjustments to admissions and financial aid packages. These measures, Rajan said in a schoolwide message, saved the school $5.5 million.</p>\n<p>This spring, CalArts sought to reduce its headcount and sent voluntary separation and early retirement notices to between 50 and 60 faculty and staff, union leaders estimated. But only 32 employees, including 22 faculty and 10 staff, took the school’s offer and Rajan moved ahead with layoffs despite vociferous <a href=\"https://www.instagram.com/p/DN3-oBcEmIH/?igsh=MXExOWNyY2VhY2J5Yg%3D%3D\">objections</a> from the union. </p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1038229/facing-15m-budget-deficit-calarts-lays-off-workers/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-2025-ny-art-book-fair-returns-to-moma-ps1",
    "title": "The 2025 NY Art Book Fair Returns to MoMA PS1",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Initiated in 2006, the NY Art Book Fair (NYABF) is a celebration and international gathering for artists’ book publishers to distribute their work, connect with broad audiences, and nurture new and longstanding relationships. This year’s fair marks an exciting and long-awaited…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/megan-mack-185915-1-1-scaled.jpg?fit=2560%2C1707&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1037592/the-2025-ny-art-book-fair-returns-to-moma-ps1/",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <p>Initiated in 2006, the <a href=\"https://bit.ly/3UL7B7w\">NY Art Book Fair (NYABF)</a> is a celebration and international gathering for artists’ book publishers to distribute their work, connect with broad audiences, and nurture new and longstanding relationships. This year’s fair marks an exciting and long-awaited return to <a href=\"https://bit.ly/4n2LZ2w\">MoMA PS1</a>, Printed Matter’s venue partner from 2009–2019, a pivotal decade in expanding the fair’s reach and impact, establishing NYABF as a cornerstone for the distribution of artists’ books and the preeminent gathering point for celebrating the form. This partnership also exemplifies a shared commitment to creating spaces where audiences can engage with new ideas and perspectives, while reaffirming Printed Matter’s core mission dedicated to the dissemination, understanding, and appreciation of artists’ books.</p>\n    <p>NYABF 2025 takes place from Thursday, September 11, through Sunday, September 14, and will feature a wide range of interdisciplinary artistic practices, including self-publishing artists, collectives, small presses, institutions, rare and out-of-print book dealers, and art book distributors. With each fair, Printed Matter continues to foreground programs that address the present moment, while also working to increase awareness around artists’ books by providing various access points for visitors to engage with printed material in enriching and discursive ways.</p>\n    <p>This upcoming iteration of the fair includes special projects and installations by Boo-Hooray, Bread &amp; Puppet Press, Corraini Edizioni, Hat &amp; Beard Press, Special Special and 4N, Three Star Books, and an exhibition of archival material from The Detroit Printing Co-op. Two new screen-printed artist editions, “Untitled” (2025) by Huma Bhabha and “The 2nd Merlyn” (2025) by Richard Tuttle, will also be released during the fair.</p>\n    <p>Join <a href=\"https://bit.ly/4mCAa3m\">Printed Matter</a> on Thursday, September 11, from 7–10 PM for the Opening Night celebration, with music from Lydo, Sydney Spann, and voyeur. The first five hundred guests will also receive a limited ticket edition by Lyric Shen.</p>\n    <p>\n      <strong>To learn more, visit </strong>\n      <strong>pmabf.org</strong>\n      <strong>.</strong>\n    </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1037592/the-2025-ny-art-book-fair-returns-to-moma-ps1/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "an-impressionist-s-ode-to-male-sensuality",
    "title": "An Impressionist’s Ode to Male Sensuality",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "An Impressionist's Ode to Male Sensuality Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic…",
    "bodyHtml": "<p>An Impressionist's Ode to Male Sensuality Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review An Impressionist’s Ode to Male Sensuality A retrospective of the work of Gustave Caillebotte illuminates the painter’s radical focus on the male form and the lives of men. by Debra Brehmer 48 seconds ago August 29, 2025 Gustave Caillebotte, \"Self-Portrait at the Easel\" (1879); Private Collection, France (photo © Caroline Coyner Photography) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member .</p>\n<p>CHICAGO — The Impressionist artists working in France in the 1800s clearly liked women.</p>\n<p>While landscapes and still lifes studded their oeuvres, they turned repeatedly to the subjects of dancers, opera singers, boaters, bathers, strollers, book readers, barmaids, and picturesque, rosy-cheeked gals in fashionable gowns and big hats.</p>\n<p>Male painters found the female form not only tantalizing but a symbol of modernity, as women explored new social access and fashions.</p>\n<p>They felt that being artists gave them license to peer (or leer).</p>\n<p>Only recently have art historians shed light on another, lesser-known Impressionist artist, Gustave Caillebotte, whose contrarian gaze primarily focused on men and the male body.</p>\n<p>A major exhibition of his work that originated at the Musée d’Orsay in Paris is now on view at the Art Institute of Chicago.</p>\n<p>The midwestern museum choose to change the show’s title from the original Gustave Caillebotte: Painting Men to the less definitive Gustave Calllibotte: Painting His World .</p>\n<p>Both are apt.</p>\n<p>The show, to its credit, does not speculate on Caillebotte’s sexuality, but rather floats intrigue: Why did this artist choose to focus on the male body?</p>\n<p>The question teases the viewer by way of wall labels that identify his models as bachelors and note that he lived out of wedlock with a woman, with little known about the nature of their relationship.</p>\n<p>She is listed as “friend” in census data.</p>\n<p>The show charts Caillebotte’s path from Paris haute bourgeois life to a country home along the Seine where a coterie of male friends frequently visited.</p>\n<p>Here, plein-air painting, yachting, and gardening occupied him until his death at age 45.</p>\n<p>These facts function to keep the audience scrutinizing the paintings like detectives searching for evidence of homoerotic desire (or not).</p>\n<p>The AIC’s Gloria Groom, who co-curated the show, stated declaratively in the French newspaper Le Figaro , “His subject matter is radical during the time because men were not supposed to stare at men, and he’s staring at men.” Gustave Caillebotte, “Man at His Bath” (1884); Museum of Fine Arts, Boston (photo © 2025 Museum of Fine Arts, Boston) Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up The most riveting painting in the exhibition, “Man at his Bath” (1884), portrays a well-built, naked man from the back as he towels his upper torso.</p>\n<p>His pale buttocks are tinged with pink after the hot soak.</p>\n<p>The masculine stance of splayed feet allows for the painterly definition of each leg.</p>\n<p>A night shirt or towel occupies the floor in the foreground with his shoes near a chair holding folded clothing.</p>\n<p>Wet footprints mark his trail, bringing an immediacy to the scene.</p>\n<p>Compare this to Edgar Degas’s many female bathers, who bend,…</p>",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Self-Portrait-at-the-Easel.jpg?fit=2500%2C1910&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1037994/gustave-caillebotte-impressionist-ode-to-male-sensuality/",
    "sourceName": "hyperallergic.com",
    "author": "Debra Brehmer"
  },
  {
    "slug": "the-rise-of-contemporary-art-puzzles",
    "title": "The Rise of Contemporary Art Puzzles",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Rise of Contemporary Art Puzzles Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic…",
    "bodyHtml": "<p>The Rise of Contemporary Art Puzzles Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Features The Rise of Contemporary Art Puzzles A handful of independent jigsaw companies are bringing art by living artists into a playful new medium. by Aaron Short 6 seconds ago August 29, 2025 A puzzle of Tim Okamura’s painting “Rosie No. 1” (2016) produced by Apostrophe (photo by and courtesy Wesley Volcy; all other photos Aaron Short/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member .</p>\n<p>When Rami Metal walks through the scores of booths at the Armory Show, he looks not only for attention-grabbing paintings but also those that would make great puzzles. “I try to find things that are more detailed and have more variance of color,” he said. “If you have 1,000 pieces and 200 of them are pieces of sky, it’s not fun.</p>\n<p>You’ll get through 80 percent of the puzzle and say, ‘Ugh, the sky.’” Museum gift shops have sold puzzle sets of Impressionist and abstract masterworks for years, but there have been few options on the market featuring works by living artists who haven’t yet had their MoMA retrospective.</p>\n<p>That’s starting to change.</p>\n<p>A handful of independent jigsaw companies, including Metal’s Kinstler Puzzles and Apostrophe Puzzles , have been licensing the work of painters virtually unknown outside the art world for their brainteasers.</p>\n<p>Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up Rami Metal started Kinstler Puzzles in August 2021 after realizing there were few contemporary art puzzles in the market.</p>\n<p>Apostrophe founder Mandi Masden was inspired to launch her Brooklyn-based puzzle company in 2019 after she came across a portrait by artist Charly Palmer that was outside her budget.</p>\n<p>Her friend gave her a custom puzzle of the artwork instead, prompting her to think about how puzzles could make contemporary art more accessible to the public. “I was really into puzzles as a kid, and I knew a lot of us had memories of them from our childhoods, but the industry itself felt stuck in the past,” Masden said. “I wanted to make puzzles that focused on celebrating the talent, creativity, and perspective of artists of color, while catering to a segment of the market largely ignored by the industry.” Metal, also a passionate puzzler, found himself fitting together tiny cardboard pieces of Pieter Bruegel’s “The Tower of Babel” (c. 1563) and Hieronymus Bosch’s “The Garden of Earthly Delights” (c. 1490–1510) for hours at a time well into adulthood.</p>\n<p>It was while he gallery-hopped in Chelsea and breezed through art fairs that he realized that the worlds of art puzzles and contemporary art rarely overlapped, and became inspired to combine them.</p>\n<p>Pitching the idea of producing puzzles out of contemporary art to galleries and artists before he actually launched his business was harder.</p>\n<p>But Washington-based artist Andrea Joyce Heimer liked the concept, and licensed a rendition of her 2019 painting, “In The Summer We Started Drinking During The Hot Of The Day And By Night Time We Were Monsters.” He launched Kinstler in 2021 with two additional puzzles by artists Simone Johnson and Rusudan Khizanishvili.</p>\n<p>Kinstler released a puzzle of artist Ken Gun…</p>",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/kItut-scaled.jpeg?fit=2560%2C1706&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1037461/the-rise-of-contemporary-art-puzzles/",
    "sourceName": "hyperallergic.com",
    "author": "Aaron Short"
  },
  {
    "slug": "i-never-was-a-graffiti-artist",
    "title": "I Never Was a Graffiti Artist",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "I Never Was a Graffiti Artist Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic…",
    "bodyHtml": "<p>I Never Was a Graffiti Artist Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Comics I Never Was a Graffiti Artist Revisiting my teenage years working for artists Freedom and Crash and renovating Keith Haring’s Pop Shop, I wrestle with the ironies of parenting as my son takes up tagging. by Jesse Lambert 1 minute ago August 29, 2025 Share using Native tools Share Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Graffiti Jesse Lambert Jesse Lambert is an artist based in, Queens, NY.</p>\n<p>He makes nonfiction comics about art, politics, public health, travel, and his unconventional childhood.</p>\n<p>He is currently working on a graphic memoir about...</p>\n<p>More by Jesse Lambert Leave a comment Cancel reply Only Members may post a comment.</p>\n<p>If you already have a membership, then sign in .</p>\n<p>Become a member now.</p>\n<p>Most Popular The Artist Whose Fauci Portraits Enraged the White House Reclaiming a Whitewashed History of the Great Depression The Shocking Allure of Erotic Abstraction Art Dealers Get Candid Ahead of the Armory Show An Ancient Roman Guide to Trump’s Authoritarian Playbook The Latest The Rise of Contemporary Art Puzzles A handful of independent jigsaw companies are bringing art by living artists into a playful new medium. by Aaron Short The Fetishistic Fiction of Museum “Tibetan” Shrines Institutions peddle a Western aesthetic of “traditional” Tibetan shrines without scholarly backing, negating their limitless lived variety. by Melissa R.</p>\n<p>Kerin Announcement The 2025 NY Art Book Fair Returns to MoMA PS1 This year’s fair features over 250 local and international artists’ book publishers, alongside a full weekend of programs and performances from September 11 through 14.</p>\n<p>The Artist Whose Fauci Portraits Enraged the White House Hugo Crosthwaite, whose stop-motion animation about the scientist was targeted by the Trump administration, talks to Hyperallergic about the work’s backstory. by Isa Farfan The Shocking Allure of Erotic Abstraction A show on Louise Bourgeois, Eva Hesse, and Alice Adams gives a sense of how different, even alarming, these pieces would have been to viewers in the 1960s. by Olivia McEwan Reclaiming a Whitewashed History of the Great Depression A new exhibition focuses on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, and Ben Shahn. by Monica Uszerowicz Art Dealers Get Candid Ahead of the Armory Show Amid market unease and slimmer blue-chip participation, some galleries see an opportunity to cultivate collectors at the mammoth Manhattan fair. by Aaron Short Announcement UT Austin’s Harry Ransom Center Provides Funded Fellowships in the Arts and Humanities The humanities library and museum will award up to 50 fellowships to support scholars, artists, and writers conducting on-site archival research.</p>\n<p>Facing $15M Budget Deficit, CalArts Lays Off Workers Faculty and union members are questioning the staff cuts, arguing that they will harm the school’s ability to nurture the next generation of artists. by Aaron Short Smithsonian Latino Gallery Quietly Closes for Nine Months As Trump goes after the institution, a temporary space for the National Museum of the American Latino closed ahead of schedule in preparation for America’s 250th programming. by Isa Farfan Facebook Instagram LinkedIn Hyperallergic is a forum for serious, playful, and radical thinking about art in the world today.</p>\n<p>Founded in 2009, Hyperallergic is headquartered in Brooklyn, New York.</p>\n<p>Home Latest Podcast About Contact Us Advertise Jobs Submissions My Account Membership Newsletters Donate © 2025 Hyperallergic Powered by Newspack Privacy Policy Sign in Close Sign in with Google Or Enter the code sent to your email.</p>\n<p>Email address Enter your password Sign in by entering the code we sent to , or clicking the magic link in the email.</p>\n<p>Continue Resend code Email me a one-time code instead Forgot password Create…</p>",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/09/JL_graffiti.jpg?fit=1200%2C900&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1029597/i-never-was-a-graffiti-artist/",
    "sourceName": "hyperallergic.com",
    "author": "Jesse Lambert"
  },
  {
    "slug": "the-fetishistic-fiction-of-museum-tibetan-shrines",
    "title": "The Fetishistic Fiction of Museum “Tibetan” Shrines",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Fetishistic Fiction of Museum “Tibetan” Shrines Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content…",
    "bodyHtml": "<p>The Fetishistic Fiction of Museum “Tibetan” Shrines Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Opinion The Fetishistic Fiction of Museum “Tibetan” Shrines Institutions peddle a Western aesthetic of “traditional” Tibetan shrines without scholarly backing, negating their limitless lived variety. by Melissa R.</p>\n<p>Kerin 16 seconds ago August 29, 2025 The \"Tibetan Buddhist Shrine Room\" at the Smithsonian Institute’s National Museum of Asian Art in Washington, DC, assembled by Alice S.</p>\n<p>Kandell (all photos Melissa R.</p>\n<p>Kerin/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member .</p>\n<p>If American museums were the only source of information about Tibetan Buddhist shrines, one would come away with the impression that shrines are elaborate, pristine environments layered with thangka paintings and silken finery amidst rows of statuary and ritual objects organized atop beautifully crafted wooden furniture.</p>\n<p>Enveloped by recordings of soft Buddhist chanting and illuminated by flickering LED butter lamps, the shrine rooms of the former Rubin Museum of Himalayan Art in New York and the Smithsonian’s National Museum of Asian Art in Washington, DC suspend visitors in a sumptuous, carefully curated environment.</p>\n<p>To this end, curators have intentionally omitted labels or didactics, ostensibly to preserve the viewer’s contemplative experience.</p>\n<p>Touted as “ magnificent ” and seen as a “ refuge in uncertain times ,” these immersive spaces have long captivated the public and media alike.</p>\n<p>But what if these beloved spaces, attracting thousands of visitors each year, are just sites of appropriation — of both tangible and intangible cultural heritage?</p>\n<p>In light of the Brooklyn Museum of Art’s recent opening of its six-year loan of the Rubin Museum’s Tibetan Buddhist Shrine Room, I think the question is worth reexamining.</p>\n<p>The sensory-immersive “Tibetan Buddhist Shrine Rooms” popular in American museums since 2010 differ markedly from their predecessors of the 1930s and ’40s, when institutions such as the Newark Museum of Art in New Jersey and the Jacques Marchais Museum of Tibetan Art in Staten Island displayed modest altars featuring Tibetan Buddhist devotional objects.</p>\n<p>Collector Alice Kandell first promoted the immersive shrine experience when she gifted a collection of over 220 Tibetan Buddhist objects to the Arthur M.</p>\n<p>Sackler Gallery of the Smithsonian.</p>\n<p>In a 2013 essay in Art of Merit , Kandell writes about this gift and her collecting practices, claiming that she “wanted the shrine to be as authentic as it would have been in Tibet.” A quotation from Smithsonian curator Debra Diamond notes the restrictions that came with Kandell’s gift, such as the “long-term display of the objects within a liturgically appropriate and distinctly separate shrine room gallery” (emphasis added), which the Smithsonian obliged.</p>\n<p>In 2010, the Rubin Museum of Art (RMA) accepted a loan of Kandell’s “shrine”; in 2013, it created its own version and kept it on view until 2024.</p>\n<p>Kandell shrines have also been displayed at the Michael C.</p>\n<p>Carlos Museum at Emory University (2016) and gifted to the Minneapolis Institute of Art .</p>\n<p>The Rubin Museum of Art’s “Tibetan Buddhist Shrine Room” in February 2025 The Rubin Museum of Art’s “Tibetan Buddhist Shrine Room” in February 2025 Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up In these aforementioned displays, the “shrines”…</p>",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/7_1.jpg?fit=2400%2C1800&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038180/the-fetishistic-fiction-of-museum-tibetan-shrines/",
    "sourceName": "hyperallergic.com",
    "author": "Melissa R. Kerin"
  },
  {
    "slug": "the-artist-whose-fauci-portraits-enraged-the-white-house",
    "title": "The Artist Whose Fauci Portraits Enraged the White House",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Artist Whose Fauci Portraits Enraged the White House Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip…",
    "bodyHtml": "<p>The Artist Whose Fauci Portraits Enraged the White House Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Features Trump Administration The Artist Whose Fauci Portraits Enraged the White House Hugo Crosthwaite, whose stop-motion animation about the scientist was targeted by the Trump administration, talks to Hyperallergic about the work’s backstory. by Isa Farfan 23 hours ago August 29, 2025 A still from Hugo Crosthwaite's commissioned portrait of Dr.</p>\n<p>Anthony Fauci (all images courtesy Hugo Crosthwaite) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member .</p>\n<p>In 2019, Hugo Crosthwaite became the first Latino artist to win the Smithsonian National Portrait Gallery’s (NPG) prestigious triennial Outwin Boochever Portrait Competition.</p>\n<p>The Tijuana-born and San Diego-based illustrator received the contest’s grand prize: $25,000 and a portrait commission for the museum’s permanent collection.</p>\n<p>He chose to depict Anthony Fauci, then the director of the National Institute of Allergy and Infectious Diseases (NIAID), in a stop-motion format that captures the nuances of his complicated legacy, including his criticized and then celebrated oversight of the HIV/AIDs epidemic.</p>\n<p>Last week, Crosthwaite found his hard-won commission on a list of Smithsonian items that the White House found objectionable.</p>\n<p>He was one of at least three Mexican-born artists whose work was included on Trump’s art hit list , along with illustrator Rigoberto González and painter Felipe Galindo Gómez . “My first reaction was surprise,” Crosthwaite shared in an interview with Hyperallergic. “But then later on, [I] felt a bit of pride to be included in this list of other wonderful artists and wonderful projects that talk about the diversity of the United States’ history.” Hugo Crosthwaite was born in Tijuana and now lives in San Diego.</p>\n<p>In 2022, after winning the Outwin competition, Crosthwaite and the NPG considered a list of individuals for a portrait.</p>\n<p>They agreed on Fauci as the commission’s subject.</p>\n<p>At the time, the infectious disease specialist was a polarized figure: a revered pandemic hero and a detested political opponent of the right.</p>\n<p>Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up “I jumped at the chance of doing this because it was 2022, we were in the middle of the COVID-19 pandemic,” Crosthwaite told Hyperallergic . “He became a symbol of this fight between science and truth, against conspiracy theories; Dr.</p>\n<p>Fauci kind of epitomizes the nation’s current political divide.” The five-minute stop motion animation, “A Portrait of Dr.</p>\n<p>Anthony Fauci” (2022), begins by portraying him as a young scientist in a lab.</p>\n<p>Later, a man infected by an unnamed virus becomes emaciated until he disappears into a black hole that morphs into a scene from ACT UP protests.</p>\n<p>Men carry signs that read “Silence = Death” and “Killed by the System.” Behind them, skeletons look to the sky.</p>\n<p>Still from “A Portrait of Dr.</p>\n<p>Anthony Fauci” (2022) The artwork references the AIDs memorial quilt before transitioning into a segment about the COVID-19 pandemic, in which a woman’s lungs explode into tiny bits of paper.</p>\n<p>Fauci is portrayed next to the White House press briefing room podium, where he often gave virus updates alongside Trump.</p>\n<p>Crosthwaite included a thumbs-up icon moving erratically up and down behind the podium, and Fauci off to…</p>",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/whitehousefauci.jpeg?fit=2140%2C1610&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038060/hugo-crosthwaite-artist-whose-fauci-portraits-enraged-the-white-house/",
    "sourceName": "hyperallergic.com",
    "author": "Isa Farfan"
  },
  {
    "slug": "the-shocking-allure-of-erotic-abstraction",
    "title": "The Shocking Allure of Erotic Abstraction",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Shocking Allure of Erotic Abstraction Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic…",
    "bodyHtml": "<p>The Shocking Allure of Erotic Abstraction Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review The Shocking Allure of Erotic Abstraction A show on Louise Bourgeois, Eva Hesse, and Alice Adams gives a sense of how different, even alarming, these pieces would have been to viewers in the 1960s. by Olivia McEwan 23 hours ago August 29, 2025 Alice Adams, \"Sheath\" (1964) (© Howcroft Photography, Boston; photo courtesy the Courtauld, all other photos Olivia McEwan/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member .</p>\n<p>LONDON — Some of the Courtauld’s previous exhibitions have suffered from insufficient curation .</p>\n<p>Abstract Erotic: Louise Bourgeois, Alice Adams, Eva Hesse , on the other hand, strikes the exact right balance.</p>\n<p>Drawing on scholar Jo Applin’s research, curator Alexandra Gerstein has taken as a starting point the work of feminist curator and critic Lucy Lippard, who coined the titular term to describe this sensuous s trand of art emerging in 1960s New York.</p>\n<p>Making perhaps the best use yet of the Courtauld’s teeny exhibition spaces next to the permanent collection, this small but unstuffed show gives proper breathing space for artistic dialogue and, crucially, for the viewer to engage in exploring differences and similarities between works and practices for themselves.</p>\n<p>In 1966, Lippard curated the exhibition Eccentric Abstraction to capture a new wave of sculptures created from unusual, pliable materials like wire, plastic mesh, netting, and latex, which evoked tactile organic forms and, by extension, the human body.</p>\n<p>This is the Courtauld’s first show devoted to standalone sculpture, and the contrast between these blob-like forms and its Impressionist-heavy permanent collection may go some way to recreate just how different — even alarming — these pieces will have appeared to 1960s audiences just getting over the shock of Abstract Expressionism’s rehauling of formalist painting.</p>\n<p>Installation view of Abstract Erotic: Louise Bourgeois, Eva Hesse, Alice Adams , featuring works by Eva Hesse and Alice Adams (all photos Olivia McEwan/ Hyperallergic ) The three artists are each afforded an introductory caption presenting historical context.</p>\n<p>No direct written comparisons are made between them, nor any attempt to force commonality, for historically, there is none other than their working in generally the same space and time.</p>\n<p>This is good curating: The show allows viewers to ask and think for themselves.</p>\n<p>Its skill lies in making suggestions via the pieces selected for display, allowing for robust visual comparison.</p>\n<p>Viewers won’t be able to ignore the strain of eroticism that stems from their irresistible tactility, which is both alluring and fear-inducing, nor their uncanny resemblance to certain human appendages ( ahem ).</p>\n<p>Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up Applin and Gerstein do point out that all three artists’ experimentation with latex marked a turning point in their explorations of eroticism and the unconscious.</p>\n<p>The exhibition’s most well-known artist, Bourgeois, was born in Paris in 1911 and moved to New York in 1938.</p>\n<p>Duly included here is her “Filette (Sweeter Version)” (1968–99/ 2006), unmistakably an erect penis (or, more accurately, one yanked upwards by string) in urethane rubber, given the ambiguous French title “Little Girl.” Adams graduated from Columbia University with a degree…</p>",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/eed0c-scaled.jpeg?fit=2560%2C2113&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1035805/the-shocking-allure-of-erotic-abstraction-courtauld-gallery/",
    "sourceName": "hyperallergic.com",
    "author": "Olivia McEwan"
  }
]