[
  {
    "slug": "a-view-from-the-easel",
    "title": "A View From the Easel",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Welcome to the 300th installment — woohoo! — of A View From the Easel, a series in which artists reflect on their workspace. This week, artists bring a Parisian sensibility to Nebraska and return to their dream studio after two decades. Want to take part? Check out our submission guidelines and share a bit about your studio with us through this form! All mediums and workspaces are welcome, including your…",
    "excerptExtended": "Welcome to the 300th installment — woohoo! — of A View From the Easel, a series in which artists reflect on their workspace. This week, artists bring a Parisian sensibility to Nebraska and return to their dream studio after two decades. Want to take part? Check out our submission guidelines and share a bit about your studio with us through this form! All mediums and workspaces are welcome, including your home studio. Laurie Victor Kay, Omaha, Nebraska How long have you been working in this space? I’ve been in my studio, LVK Atelier, for about one year. I moved into the space shortly after my mom died from a very short battle with cancer. Moving here meant seismic change for me — leaving my family home, marriage, and longtime former studio. My mom worked with arts and accessibility. Her spirit is everywhere, and it is truly an amazing space. Every visitor feels the strong, positive, creative energy. When I moved in, I began imagining how I wanted my studio to feel, planning for months before starting construction. I was literally rebuilding myself while building my studio space. The first of many projects as a newly independent mid-career artist who had lost her mom and left her marriage to find herself. Describe an average day in your studio. My daily routine changes often. Constants: coffee. A long run, early-morning yoga, meditation — even a few times a week. Emails and Instagram. I read and journal. Each day is different because my practice is so varied. When I am making new work, I try to really let myself feel free. Music is so important to me. I like it loud — too loud for my neighbors. So many genres … I travel to time periods, places in the world, places in my mind with music. My Composition series is about music. How does the space affect your work? It is magical! The space is like a blank palette with which I can make anything. It is energetic in that my work is received and felt. I meditate often, balancing that with loud music. I feel so free here. During the first months in this space, I bought Yves Klein matte blue paint, and drew Buddhist quotes on the kitchen walls. I made a pact to be intentional about everything entering my space. I was leaving negative energy and needed a space to heal and grow. I wanted to use every corner in the space conceptually. I wanted a true artist’s home — welcoming, colorful, like a cabinet of curiosities; weird, filled with me. How do you interact with the environment outside your studio? I’m extremely involved with the art community in Omaha. This community is the reason I’ve stayed in this city. Omahans are down-to-earth and embrace bold ideas. The top three projects in my career were on the campus of the University of Nebraska Medical Center. Although I’ve moved further from the arts area, I’ve found the most important part of making art is feeling supported. My community is all over Omaha but also the world. I believe community is everywhere. Sometimes one close friend is one’s entire community. I want to continue to know my neighbors and support the arts organizations that support me. What do you love about your studio? One, I love feeling my mom’s presence. She was a mother to many beyond my family. She died too soon but left a legacy felt here. She worked with people who didn’t have access to art. Two, I love my trees. My home/studio has two massive oaks right through it. Three, I love that the studio is mine. I feel so free and independent now and don’t have to answer to anyone but myself. It was a long road to get here. What do you wish were different? I just wish people could be kinder to one another … you know? In terms of my studio, I wish it were in Paris or closer to the ocean so I could surf. I love my community, but my heart lives in Paris and other parts of France. I surfed in Biarritz recently and would love to be closer. Omaha is…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/laurie-katz-studio-trees.jpg",
    "source": "https://hyperallergic.com/1037524/a-view-from-the-easel-300/",
    "sourceName": "hyperallergic.com",
    "author": "Lakshmi Rivera Amin"
  },
  {
    "slug": "your-guide-to-nyc-s-fall-art-fairs",
    "title": "Your Guide to NYC’s Fall Art Fairs",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "It’s about that time of year when the slight crisping of the air signals that the balmy summer is departing, but hasn’t disappeared just yet. Suddenly, the fluorescent lights, lively chatter, and overpriced opening wine flowing onto the New York City streets beckon the passerby who has spent all summer tanning in Central Park. It’s fall art fair season, at last. As usual, the season’s kicking off with the gargantuan…",
    "excerptExtended": "It’s about that time of year when the slight crisping of the air signals that the balmy summer is departing, but hasn’t disappeared just yet. Suddenly, the fluorescent lights, lively chatter, and overpriced opening wine flowing onto the New York City streets beckon the passerby who has spent all summer tanning in Central Park. It’s fall art fair season, at last. As usual, the season’s kicking off with the gargantuan Armory Show next week, followed by a lineup of shows that range from the alternative (zines!) to the conservative and historical (Independent 2oth Century). This year brings a few changes, though: the unexpected cancellation of the Art Dealers Association of America’s annual Art Show, for instance, typically an anchor of the autumn fairs. Volta is also skipping its NYC edition, while Clio is having two fairs in the same month. The art market might be topsy-turvy, but your fairgoing experience doesn’t have to be. Our handy guide below is here to help navigate your way through it all. The Armory Show September 5–7 | thearmoryshow.com Javits Center, 429 Eleventh Avenue, Midtown West, Manhattan The Goliath of the city’s art fairs, the Armory Show will once again descend upon the shopping mall-esque Javits Center to kick off New York’s fall season. More than 230 galleries will convene for the colossal event, with spotlight booths focused on the late artist Ming Fay and installation artist Sylvie Hayes-Wallace, among others. For the first time, the fair’s Platform section will be curated by a nonprofit, Souls Grown Deep, which will celebrate Black artistry from the American South with an exhibition of paintings, assemblages, sculptures, and textile works. Another fresh feature this year is the inaugural design-focused Function section, showcasing sculptural assemblages and installation works by Nikita Gale, Cauleen Smith, Ryan Johnson, and Gee’s Bend Quiltmakers. The Armory’s programming will also extend beyond the boundaries of Hudson Yards in a focused series of multi-borough partnership presentations. At the Queens Museum, a collaboration with Gagosian will produce a monumental banner reproduction of Honor Titus’s tennis painting “Louis Malle Practice” (2025) on the institution’s facade. Times Square Arts and the Whitney Museum of American Art will host nightly viewings of media artist Marina Zurkow’s multi-channel animation “The River is a Circle (Times Square Edition)” across 95 synchronized electronic billboard displays throughout the city. Independent 20th Century September 4–7 | independenthq.com Casa Cipriani, 10 South Street, The Battery, Manhattan The modern art sibling fair of the contemporary-focused Independent fair returns to Manhattan’s Battery neighborhood with 31 galleries and arts nonprofits for its fourth edition. Solo, duo, and group presentations notably spotlight works by self-taught artists, Lebanese women artists, and influential figures from Latin America. Attendees can also check out a host of programs, including a live discussion between installation artist Judy Pfaff and author Joe Fig and a roundtable between directors of the Storm King Art Center, Princeton University Art Museum, the Aldrich Contemporary Art Museum, and Aspen Art Museum. Art on Paper September 4–7 | ny.thepaperfair.com Pier 36, 299 South St, New York, New York Don’t underestimate the versatility of this pulpy, everyday material. Returning to its usual venue at Pier 36 on the East River, this year’s Art on Paper fair will showcase boundary-pushing artworks from over 100 galleries, such as Pace-represented artist Nina Katchadourian’s playful ecological sculptures made from found paper items. The show’s meta mini bookfair, BOOKsmART, will also return with exhibitors from more than 20 presses, including Oreades Press, Axis Press, and Central Booking. Installations like feminist participatory artist Mary Beth Edelson’s Story Gathering Boxes series (1972–2014) and Ruben Castillo’s woodcuts and lithocuts exploring queer intimacy attest to the medium’s endless possibilities. Salon Zürcher: 100 Women of Spirit +, Part 3 September 2–7 | galeriezurcher.com Zürcher Gallery, 33 Bleecker Street, Soho, Manhattan Returning for its 33rd edition as an intimate and quieter satellite fair of the Armory Show, 100 Women of Spirit + brings together 11 women artists at its Bleeker Street home. Deriving its name from the French phrase femme d’esprit, referring to intellectual and witty women, this year’s fair features psychedelic paintings by Amy Cheng, welded steel constellations by Dutch-born artist Marieken Couchius, and oil self-portraits by trauma-informed psychotherapist Trissy Callan.…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/roots-copy.jpg",
    "source": "https://hyperallergic.com/1037354/nyc-fall-2025-art-fair-guide/",
    "sourceName": "hyperallergic.com",
    "author": "Isa Farfan and Maya Pontone"
  },
  {
    "slug": "is-jenny-saville-the-uk-s-greatest-living-painter",
    "title": "Is Jenny Saville the UK’s Greatest Living Painter?",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "LONDON — Of all the YBAs (Young British Artists) of the 1990s — including upstarts like Damien Hirst and Tracey Emin, mouthing off petulantly to the art establishment with dead livestock and unmade beds — it is Jenny Saville who has been most entrenched in the history of art. It is also Saville who can most convincingly claim to be Britain’s greatest living painter since the death of Lucien Freud…",
    "excerptExtended": "LONDON — Of all the YBAs (Young British Artists) of the 1990s — including upstarts like Damien Hirst and Tracey Emin, mouthing off petulantly to the art establishment with dead livestock and unmade beds — it is Jenny Saville who has been most entrenched in the history of art. It is also Saville who can most convincingly claim to be Britain’s greatest living painter since the death of Lucien Freud (sorry, David Hockney). The artist’s superb draughtsmanship skills, informed by absorption and understanding of the Old Masters, are combined with a painterly technique that manipulates its plasticity for all its worth. (Ironically, Tracey Emin is a professor of drawing at the Royal Academy despite having no capacity for drawing.) Saville’s style is as complete and significant as that of Freud. It is hard to overestimate the impact of Saville’s early works on British contemporary painting. Her paintings often disappear into the most discerning private ownership. Those in public collections are the rare anomaly in her current survey, The Anatomy of Painting, at the National Portrait Gallery. As a result, some of that impact is recreated for those viewing her art for the first time. Enormous in scale, her uncomfortably close cropped depictions of women’s faces and nude bodies abound in the joy of painterly modeling, from bare — nude — patches of canvas to her swift, thick, viscous slathers, to dappled dry brush blends. The large scale alone may shock people accustomed to viewing only reproductions on screen. The distribution of muted and contrasting tones is sophisticated. In short, there is a wealth of virtuosic brushwork to drink in. Considering the painterly bombast, it is perhaps a pedantic complaint that the National Portrait Gallery has mounted an exhibition that has not a single “portrait” in it. We are given only a few of the sitters’ identities, and neither the museum nor Saville expound any particular reason for portraying them, nor any painter-sitter relationships to speak of. Hers is an academic interest with only perfunctory gestures toward body image issues, and pieces explicitly covering gender identity are absent. In “Plan” (1993), one of the exhibition’s key works, Saville contours the nude flesh like ordinance survey map terrain, while “Ruben’s Flap” (1998–99) references the fleshy folds favored by the Dutch master, updated to the “real” folds of contemporary unidealized body types. In her most color-saturated rendering of flesh, “Figure 11.23” (1997), she deploys flat red more in the Renaissance discipline of cangiante – using depth of color rather than muted tones for shade – rather than realistically depicting blood. Similarly, a fantastic sequence of mother and child images that reference both Pietas and Maestas from Michelangelo, with bulbous children bending toward us, entasis-style, echo distinctly his Madonna of Bruges or the soft sfumato of Raphael, reimagined in colored pencil. Saville fails, though, to wear her influences on her sleeve when channeling her love for de Kooning into her compositions from the mid to late 2010s. Her attempts to break down nudes into intertwining layers of limbs and squiggles, shattering them with de Kooning-like surface articulation, feel forced, and obscure her gift for three-dimensional modeling. “Out of one, two (symposium)” (2016) nods to Cy Twombly simply by overlaying the nude figures with scribbles. Her academic attempts at abstraction — the opposite of Renaissance Old Master figure modeling — seem to be at the expense of her work’s soul. Arguably, it is the conventional “portraits” — simply framed faces, rendered on an enormous scale — that are strangely anaemic (notice duplications of the same portrait with varying degrees of effort) and, more recently, louder in tone yet quieter in effect. The final room should be renamed “rainbow filter,” for here the palette is split into the entire spectrum, as rainbows are projected onto the visages, rather like a social media filter. For all the power of her early work, perhaps the oversaturated digital world demands that she dial her painterly tropes to eleven to stay relevant: colors are unnaturally zingy; oil sticks are deployed in vigorous strokes, creating a sense of “angry” brushwork; collages are more disjointed than previous ones. This is where some commentary on the sitters and her relationships with them would…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Reverse-2002-2003-by-Jenny-Saville-Private-Collection-courtesy-Gagosian-©-Jenny-Saville.jpg",
    "source": "https://hyperallergic.com/1036158/jenny-saville-uk-greatest-living-painter-national-portrait-gallery-london/",
    "sourceName": "hyperallergic.com",
    "author": "Olivia McEwan"
  },
  {
    "slug": "photographs-that-depict-alzheimer-s-with-dignity",
    "title": "Photographs That Depict Alzheimer’s With Dignity",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "In photographer Alicia Vera’s portrait of her mother, Concepcion, she gazes skyward, her expression somewhere between curious and awestruck. The image has enough stylistic mottling and grain to obscure any sort of background, but Concepcion is clear: broad cheekbones, bejeweled ears, eyes full of wonder—maybe. Vera is a deeply humanistic image-maker, and it’s impossible to differentiate between a posed subject and a candid one. She approaches both with generosity. Isolated,…",
    "excerptExtended": "In photographer Alicia Vera’s portrait of her mother, Concepcion, she gazes skyward, her expression somewhere between curious and awestruck. The image has enough stylistic mottling and grain to obscure any sort of background, but Concepcion is clear: broad cheekbones, bejeweled ears, eyes full of wonder—maybe. Vera is a deeply humanistic image-maker, and it’s impossible to differentiate between a posed subject and a candid one. She approaches both with generosity. Isolated, the phrase “va a llover toda la noche,” which translates in English to “it’s going to rain all night,” feels like a snippet of poetry or song. A few years ago, it was a note left on Vera’s door by her mother. Now, it’s the title of Vera’s new project, and a self-published book of the same name, documenting Concepcion’s Alzheimer’s disease diagnosis and Vera’s experience processing it. “Every time I go home to Miami, I stay in my childhood home,” Vera shares. “My mom loves to leave notes on the door. I kept this one; a year or so later, when I was taking out all this material I had, I thought, ‘this is exactly what this feels like.’” The portrait of her mother is one of many in Va a Llover Toda La Noche (2025); alongside Vera’s portraits, the book includes archival images of Concepcion over the last several decades, text messages, emails, and other personal ephemera. Vera, who is based in Mexico City, is an award-winning editorial and commercial photographer, and her personal projects feature some of her most captivating images. In “Basketball in the Sierra Norte of Oaxaca” (2018), she captured the Copa Mixe, a basketball tournament for Indigenous Mixe youth in Sierra Norte; for “Stripped” (2009–11), she spent years documenting strippers in Miami and the Bay Area. Her photos are devoid of the voyeuristic quality often visible in like-minded series by other artists; instead, she seems warmly welcomed, like a relative. She’s been photographing her own family, too, “since forever,” she says. “I think I knew deep down, one day, everything’s going to be so different. Every time I would go home, I would take a ton of pictures.” Concepcion was diagnosed with Alzheimer’s disease in 2018, which prompted Vera to begin photographing her more. In a Spanglish epilogue to the book, Vera writes, in English: “After my mom was diagnosed with Alzheimer’s, I felt devastated, overwhelmed, anxious and helpless.” In Spanish, she adds: “Mi mamá se me iba a ir. En mi desesperación de entender lo que le estaba pasando y porque nunca realmente sentí que la conocí, empecé este proyecto llamado, Va a Llover Toda La Noche” (My mom was going to leave me. In my desperation to understand what was happening to her, and because I never really felt like I knew her, I started this project called Va a Llover Toda La Noche.) Vera’s understanding of her mother’s own personhood was limited by the challenges of their relationship—a too-common dynamic among mothers and daughters, and one that Vera has long hoped to correct. “She grew up in Mexico and I grew up in the US, so there were a lot of cultural differences,” she says. “In my 20s, I moved away and realized, ‘I really miss my mom.’ We started having these phone calls, and it hit me that my mom was an entire human … I remember trying to make an effort to get to know her, asking her really specific questions. When my mom got diagnosed, I was like, ‘Wait, but I’m just starting to get to know you.’” In Va a Llover Toda La Noche, she continues getting to know her. There are childhood photos of little Concepcion, messages she’s sent to Vera, pages of Vera’s own journals: “My mom, mi hermosa, who I’ve been terrible to for so many years, has Alzheimer’s. Mi mami …. There’s medicine, pills, and patches, but she’s refusing to take anything despite her telling us that she would do everything possible …. Mi bella madre ….” The last sentence is interrupted by a drawing. Vera repeats mi madre, my mom, like an incantation. She finds parallels between their lives in Mexico City, decades apart — a selfie of Vera in the grass…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/2zqNE-scaled.jpeg",
    "source": "https://hyperallergic.com/1037506/alicia-vera-photographs-depict-alzheimers-with-dignity/",
    "sourceName": "hyperallergic.com",
    "author": "Monica Uszerowicz"
  },
  {
    "slug": "pennsylvania-museum-sues-trump-administration-over-grant-cuts",
    "title": "Pennsylvania Museum Sues Trump Administration Over Grant Cuts",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "A Pennsylvania art museum is suing the Trump administration after the government terminated a $750,000 federal grant for collection conservation earlier this year. The Woodmere Art Museum in Philadelphia filed a lawsuit yesterday, August 26, against President Donald Trump, the Institute of Museum and Library Services (IMLS), the agency’s Interim Director Keith Sonderling, and other administration officials, months after the agency revoked its Fiscal Year 2024 “Save America’s Treasures” grant.…",
    "excerptExtended": "A Pennsylvania art museum is suing the Trump administration after the government terminated a $750,000 federal grant for collection conservation earlier this year. The Woodmere Art Museum in Philadelphia filed a lawsuit yesterday, August 26, against President Donald Trump, the Institute of Museum and Library Services (IMLS), the agency’s Interim Director Keith Sonderling, and other administration officials, months after the agency revoked its Fiscal Year 2024 “Save America’s Treasures” grant. The museum, which operates out of a 19th-century mansion in the city’s Chestnut Hill neighborhood, alleges that Trump officials usurped Congress’s authority to distribute federal funds by prematurely terminating its grant. The IMLS grant that the Woodmere received is administered in partnership with the National Park Service and awarded to “historic properties and collections.” After receiving the grant, according to the lawsuit, the museum initiated an “ambitious conservation project” to prepare an exhibition of Philadelphia artists in 2026, timed with America’s 250th celebrations. The museum received just $195,000 of its total grant before its termination. The Woodmere hopes the IMLS will restore its funding so that it can continue its original planned project to install new storage facilities, address collection crowding, and improve cataloguing efforts. “This has delayed critical preservation, digitization, and conservation of our collection — work we hope to resume if the grant is reinstated,” Woodmere Art Museum Director and CEO William Valerio told Hyperallergic. With the grant expiration approaching in September, the museum stated in court papers that it has exhausted non-litigious methods of restoring the grant, including a formal appeal. Trump signed an executive order in March demanding that the IMLS and several other federal agencies cease operations of non-statutory functions, effectively dismantling the organization. The lawsuit asks the court to reinstate its grant and declare Trump’s gutting of the IMLS “unlawful” or “unconstitutional.” The president proposed eliminating the organization’s funding in his Fiscal Year 2026 budget proposal, which also excluded the National Endowment for the Arts from federal dollars. A federal judge declined to block Trump’s dismantling of the agency in June after other judges blocked some of his actions. The IMLS has not yet responded to Hyperallergic’s request for comment.",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/woodmere.jpg",
    "source": "https://hyperallergic.com/1037363/pennsylvania-museum-sues-trump-administration-over-grant-cuts/",
    "sourceName": "hyperallergic.com",
    "author": "Isa Farfan"
  },
  {
    "slug": "wafaa-bilal-asks-what-it-means-to-be-arab-in-america",
    "title": "Wafaa Bilal Asks What it Means to be Arab in America",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "CHICAGO — Though Wafaa Bilal was born in Iraq and is based in New York, his survey at the Museum of Contemporary Art Chicago, Indulge Me, can be called a homecoming of sorts. In 2007, the accomplished yet underrated artist captured the art world’s attention with his durational performance “Domestic Tension,” wherein he lived for 30 days inside the exhibition space of Chicago’s FlatFile Gallery; a web camera broadcast his…",
    "excerptExtended": "CHICAGO — Though Wafaa Bilal was born in Iraq and is based in New York, his survey at the Museum of Contemporary Art Chicago, Indulge Me, can be called a homecoming of sorts. In 2007, the accomplished yet underrated artist captured the art world’s attention with his durational performance “Domestic Tension,” wherein he lived for 30 days inside the exhibition space of Chicago’s FlatFile Gallery; a web camera broadcast his movements while a paintball gun was available for anyone to remotely fire at him via a website. Reconstructed as an open-face cubicle inside the museum’s pristine gallery space, the splatters of thousands of yellow paintballs on its interior walls do not convey the torturous persistence of the gun as forcefully as the brief video diary screened on a small monitor nearby. In an increasingly distressed voice, the goggled Bilal unironically thanks his audience for their participation as the gun processes a ceaseless string of firing commands. For a significant survey, the exhibition is remarkably spare. Curator Bana Kattan selected five major projects, each one integrating technology, performance, and a conceptual approach to the conditions of being Arab in the United States in the post-9/11 era. In “3rdi,” Bilal surgically implanted a web camera to the back of his head and attached it to an internet-connected laptop slung at his waist. Each minute, the camera would take an image and send it via the laptop to a live website feed. We are privy to an oversized presentation of a year’s worth of these images, projected on a 14-foot scrim diagonally bisecting the gallery and synced to the date and time they were originally taken. While Bilal once again submits himself to anonymous public scrutiny, making literal the Arab-American condition, the seemingly arbitrary images show the view from behind, telling us not where he is going but where he has been. The project title can be parsed as “third eye,” referring both literally to the camera and conceptually to the watchful eye of the state, but can also be read in Western-transliterated Arabizi as “my land,” pointing to the places from which Bilal has fled as a political refugee who could not look back. The latest project on view, “In a Grain of Wheat,” exhibits Bilal’s persistent concern with the technological mediation of contemporary culture. Responding to the destruction of Iraqi cultural heritage by ISIS, the artist collaborated with a scientist and coder team to scan the Metropolitan Museum of Art’s lamassu and write its form into the DNA of a grain of wheat. The specific mechanics of this process are not comprehensible via the minimal didactics presented, so viewers must accept that the sculpture lives in the wheat as an act of faith in the art and science of the project. Aptly, the work demands a devotional gesture. To partake of the wheat, one must bend down before the replica winged bull to reach for the pile of seeds at its hooves. More than two decades after the American invasion of Iraq, to see mostly young non-Arab Americans readily perform this gesture of supplication to an iconic symbol of Iraqi cultural heritage makes me think that perhaps this country has forgotten its devastating entanglement with Iraq after all. Bilal, of course, cannot. Wafaa Bilal: Indulge Me continues at the MCA Chicago (220 East Chicago Avenue, Chicago, Illinois) through October 19. The exhibition was curated by Bana Kattan with Iris Colburn.",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Combined.jpg",
    "source": "https://hyperallergic.com/1031267/wafaa-bilal-asks-what-it-means-to-be-arab-in-america-mca-chicago/",
    "sourceName": "hyperallergic.com",
    "author": "Elliot Josephine Leila Reichert"
  }
]