[
  {
    "slug": "when-chinese-astrology-becomes-portraiture",
    "title": "When Chinese Astrology Becomes Portraiture",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "When Chinese Astrology Becomes Portraiture Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Features When Chinese Astrology Becomes Portraiture When John Clang read my ziwei doushu chart, he helped me discover a new way of depicting myself — without a camera, pencil, or paintbrush. by AX Mina August 24, 2025 August 25, 2025 John Clang at Galerie Lelong before my ziwei doushu reading earlier this month (photo AX Mina/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Portraiture has always been a slightly misleading art form. A good portrait gives the viewer the sense that they can peer into the essence of the sitter. It’s a glimpse, a passing moment in a person’s life. But to know someone more fully, we have to see them in their totality, from birth to death, through all the major seasons of their life and in relationship with their most important people. I first came across the expansive portraiture of artist John Clang in 2010 when he began the Being Together series , which depicts diasporic families photographed together via Skype. A Singaporean artist living far from family after moving to New York, Clang stages the photos so that one half of the family is projected onto the wall, as if in the physical presence of the other half. For those of us living in diaspora with loved ones in other countries, togetherness also means being together across time. Some live in an ostensible future and others in an ostensible past, both close together and distant. As Clang wrote in a piece for LensCulture , diasporic families can be “made whole again through the use of a third space, a site that is…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/john-clang-ax-reading-lelong.jpg"
  },
  {
    "slug": "with-cafecito-cups-and-direct-action-miami-artists-rise-against-alliga",
    "title": "With Cafecito Cups and Direct Action, Miami Artists Rise Against “Alligator Alcatraz”",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "With Cafecito Cups and Direct Action, Miami Artists Rise Against “Alligator Alcatraz” Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Features With Cafecito Cups and Direct Action, Miami Artists Rise Against “Alligator Alcatraz” As the notorious detention center faces legal setbacks, an exhibition in Little Havana underscores the need to keep resisting. by Andrea Contreras August 24, 2025 August 22, 2025 Left to right: Isabella Marie Garcia, Fola Akinde, Agua Dulce, and Motyko outside the Artists as Activists exhibition in Miami (photo courtesy A4A, all others Andrea Contreras/ Hyperallergic , unless noted otherwise) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . MIAMI — On a July afternoon, in an abandoned boutique sandwiched unassumingly between a dentist’s office, a Latin grocery store, and a barbershop, Little Havana residents and artists gathered for their afternoon cafecito ritual. But instead of coffee, the plastic fluted espresso cups held swamp mud from the Everglades and checkpoint soil from the entrance to Alligator Alcatraz, the notorious immigrant detention center at the center of a lawsuit alleging violations of the National Environmental Policy Act and Miccosukee land protections . On Thursday, August 21, a judge ordered the halting of operations at the prison, but the state quickly filed a motion to appeal the decision. The performance by Miami artist Agua Dulce, titled “Untitled (todo lo que toques se transforma)” (2025), took place at the opening of The Artist As Activist , curated by Isabella Marie Garcia with works by members of Artists 4 Artists (A4A). In recent history, the advocacy group has mobilized in response to local challenges like the censorship of political art for Palestine, inequitable pay, and funding cuts . But since Alligator Alcatraz’s construction,…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/theartistasactivist-21.jpeg?fit=2400%2C1848&quality=90&ssl=1"
  },
  {
    "slug": "ancient-sculptures-recovered-from-sunken-city-off-alexandria",
    "title": "Ancient Sculptures Recovered From Sunken City Off Alexandria",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Ancient Sculptures Recovered From Sunken City Off Alexandria Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Ancient Sculptures Recovered From Sunken City Off Alexandria Statues including an intact sphinx and a Ptolemaic figure were hoisted out of the water on the Egyptian coast. by Maya Pontone August 22, 2025 August 22, 2025 The remains of a sunken city were pulled from the waters at Abu Qir bay in Alexandria on August 21, 2025. (photo by Khaled Desouki/AFP via Getty Images) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Pieces of limestone buildings, marble and granite royal statues, and the remains of a merchant ship are among the relics of an ancient sunken city retrieved by Egyptian authorities off the shores of Alexandria. Dating back more than 2,000 years, the artifacts were reportedly hoisted from a submerged archaeological site in Abu Qir Bay yesterday, August 21. Egyptian officials told Agence France-Presse that the area may be part of the long-lost seaport Canopus, a prominent trade, religious, and luxury hub that flourished during Egypt’s Ptolemaic dynasty and the Roman empire. A combination of rising sea levels and continuous earthquakes drowned the metropolis and neighboring Thonis-Heracleion approximately 1,200 years ago. Like its ancient predecessors, Alexandria is also vulnerable to rising sea levels. The United Nations estimates that at least a third of the historic city will be underwater or uninhabitable by 2050, displacing 1.5 million of its six million residents. Divers watch as a crane recovers a statue from the depths at Abu Qir Bay. (photo by Khaled Desouki/AFP via Getty Images) Get the latest art news, reviews and opinions from Hyperallergic. Daily Weekly Opportunities Sign up The resurfaced artifacts include remnants of…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/GettyImages-2230468057.jpg"
  },
  {
    "slug": "kenny-nguyen-the-divine-eye",
    "title": "Kenny Nguyen: The Divine Eye",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Kenny Nguyen: The Divine Eye Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Announcement Kenny Nguyen: The Divine Eye Torn strips of silk reflect Caodaist temple architecture in this massive installation, inviting Halsey Institute visitors to engage with the history of Vietnam. by The Halsey Institute of Contemporary Art August 22, 2025 August 22, 2025 Kenny Nguyen, “The Great Palace Installation” (2025), hand-cut silk fabric, acrylic paint, canvas, mounted on wall, 18 columns Kenny Nguyen: The Divine Eye is an evocative, large-scale installation that invites viewers to engage with the rich spiritual and cultural history of Vietnam through the lens of Caodaism. Rooted in the synthesis of Eastern and Western philosophies, Caodaism — a syncretic religion founded in Vietnam in the 1920s — serves as both inspiration and metaphor in this work, which is on view at the Halsey Institute of Contemporary Art at the College of Charleston in South Carolina through December 6. In his practice, Nguyen transforms torn strips of silk by dipping them into acrylic paint, layering them onto canvas, and hanging them dynamically on the wall to construct new topographies. Now for the first time, his technique has been adapted to form columns that reflect Caodaism’s distinctive temple architecture, marrying traditional Eastern elements with Western influences to create a visual dialogue between the past and the present, the local and the global. Kenny Nguyen, “The Great Palace Installation” (2025), hand-cut silk fabric, acrylic paint, canvas, mounted on wall, 18 columns Caodaism emerged in response to the tumultuous history of Vietnam in the early 20th century, during a time of colonial occupation and national struggle. In the face of foreign domination and the erosion of indigenous cultural practices, this new religion synthesized elements from Buddhism, Taoism, Confucianism, Christianity, and other world religions to form a unifying spiritual force. Although Nguyen is not a practicing member of the faith himself, his grandmother was a member of the temple that inspired his work. This connection left a lasting imprint on his understanding of Caodaism and its significance to the Vietnamese people. For the artist, the creation of “The Divine Eye” (2025) is deeply personal. Nguyen’s use of silk is deliberate and symbolic. By pushing the limits of the material, he aims to emphasize concepts of…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Kenny-Nguyen-The-Divine-Eye-1.jpg?fit=2400%2C1600&quality=90&ssl=1"
  },
  {
    "slug": "erasure-of-rainbow-memorial-for-pulse-shooting-victims-raises-alarm-in",
    "title": "Erasure of Rainbow Memorial for Pulse Shooting Victims Raises Alarm in Florida",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Erasure of Rainbow Memorial for Pulse Shooting Victims Raises Alarm in Florida Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Erasure of Rainbow Memorial for Pulse Shooting Victims Raises Alarm in Florida State Senator Carlos Guillermo Smith called the state’s reported paving over of the street crossing a “disgusting betrayal.” by Maya Pontone August 22, 2025 August 22, 2025 Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . The Orange Avenue crossing before and after it was paved over (image courtesy Office of Mayor Buddy Dyer) Orlando residents and Florida public officials are decrying the state’s removal of a rainbow crosswalk memorial honoring the victims of the 2016 Pulse nightclub shooting. Late Wednesday evening, August 20, state officials reportedly paved over a multicolored street crossing on Orange Avenue that stood for nearly a decade as a tribute to the 49 people killed in the Orlando mass shooting, who were primarily LGBTQ+ and Latine. The crosswalk is located just steps away from the site of the massacre, which occurred when a gunman opened fire at the local gay nightclub Pulse. In late 2023, the City of Orlando purchased the property to erect a permanent memorial to the victims. The pave-over follows the passage of new legislation in June that prohibits pavement surface signage and art that “is associated with social, political, or ideological messages or images and does not serve the purpose of traffic control.” Issued by the administrations of Florida Governor Ron DeSantis and President Donald Trump, the law has jeopardized dozens of colorful LGBTQ+ street signage across the state. Get the latest art news, reviews and opinions from Hyperallergic. Daily Weekly Opportunities Sign up Orlando Mayor Buddy Dyer called the…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/rainbow.jpg"
  },
  {
    "slug": "trump-targets-lgbtq-history-migrants-and-more-in-chilling-smithsonian-",
    "title": "Trump Targets LGBTQ+ History, Migrants, and More in Chilling Smithsonian Hit List",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Trump Targets LGBTQ+ History, Migrants, and More in Chilling Smithsonian Hit List Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Trump Administration Trump Targets LGBTQ+ History, Migrants, and More in Chilling Smithsonian Hit List The White House’s 26-point bulleted memo includes Amy Sherald’s painting of a transgender woman and an animation of Anthony Fauci. by Isa Farfan August 21, 2025 August 21, 2025 Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Rigoberto A. González, “Refugees Crossing the Border Wall into South Texas” (2020) was among the artworks targeted in a statement from the White House on August 21, 2025. (photo courtesy the artist) In the wake of Trump’s Truth Social rant earlier this week, in which he accused the Smithsonian of focusing too much on “how bad slavery was,” the White House released a list targeting specific exhibitions and artworks at the institution as it vows to purge it of “divisive narratives.” The 26-point bulleted memo titled “President Trump Is Right About the Smithsonian,” published today, August 21, comes days after the Trump administration demanded that the Smithsonian hand over information about curatorial processes, exhibitions, and other programs so that government officials can make “content corrections.” In today’s memo, the administration took particular aim at programs that recognized LGBTQ+ individuals, humanized migrants, and referenced political figures who have strayed from conservative platforms, including former National Institute of Allergy and Infectious Diseases Director Anthony Fauci, abolitionist Angela Davis, and socialist 2024 presidential candidate Claudia De la Cruz. Get the latest art news, reviews and opinions from Hyperallergic. Daily Weekly Opportunities Sign up Also on the list is Amy Sherald’s 2024 painting “Trans Forming Liberty,” which was slated to be included in…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/rigoberto-thumbnail.jpg"
  },
  {
    "slug": "the-indigenous-artist-making-dazzling-labubu-regalia",
    "title": "The Indigenous Artist Making Dazzling Labubu Regalia",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Indigenous Artist Making Dazzling Labubu Regalia Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Features The Indigenous Artist Making Dazzling Labubu Regalia Tlingit artist Lily Hope dresses the collectible toy monsters in outfits inspired by traditional Ravenstail and Chilkat weaving practices passed on by her elders. by Monica Uszerowicz August 25, 2025 August 25, 2025 Lily Hope (Tlingit) dresses Labubus in traditional Ravenstail regalia, woven robes and headdresses made of Merino wool. (photo courtesy @sydneyakagi) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . One of the greatest pleasures of owning a Labubu, the massively popular and elusively obtainable line of toy monsters designed by Kasing Lung and sold by Pop Mart, is customizing it. Labubus have been adorned with gel tips , dressed in Prada , and topped with the Puerto Rican straw hats known as pavas (effectively creating a jíbabubu ) and pretend Louis Vuitton . Textile-savvy Labubu owners have dressed their cunicular trolls as Totoro , Sailor Moon , and, at Singapore’s Nine Emperor Gods Festival, religious devotees . Alaskan Chilkat and Ravenstail Weaver Lily Hope (Tlingit) (photo courtesy @sydneyakagi) Given this recent history, multidisciplinary artist, performer, educator, and mother Lily Hope’s Labubus are part of a growing lineage. But hers are especially unique. The Tlingit artist, born and based in Juneau, Alaska, is trained in both Ravenstail and Chilkat weaving practices. She learned the art forms from her ancestors and elders, including her late mother, Clarissa Rizal — one of the last living apprentices of Master Chilkat Weaver Jennie Thlunaut — and weaver Kay Field Parker. Hope’s Labubus are dressed in traditional Ravenstail regalia, woven robes, and headdresses made of Merino wool. “They’re actually repurposed dance cuffs,”…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/labubu-regalia.jpg?fit=2400%2C1800&quality=90&ssl=1"
  },
  {
    "slug": "why-did-eco-activists-get-years-in-prison-for-only-588-in-damages",
    "title": "Why Did Eco-Activists Get Years in Prison for Only $588 in Damages?",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Why Did Eco-Activists Get Years in Prison for Only $588 in Damages? Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Why Did Eco-Activists Get Years in Prison for Only $588 in Damages? The famous “souping” of a van Gogh painting raises questions about what counts as peaceful protest versus violent crime. by Hrag Vartanian August 25, 2025 August 25, 2025 Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Vincent van Gogh says a little soup is fine, as a treat. (edit Hrag Vartanian/ Hyperallergic ) In October 2022, many members of the public were shocked when two environmental activists threw Andy Warhol’s favorite soup muse at a Vincent van Gogh painting. New evidence now suggests that the damage was far less than initially feared and may not have warranted the harsh two-year sentence for Phoebe Plummer and the 20-month sentence for Anna Holland. The two Just Stop Oil activists hurled soup at van Gogh’s 1888 painting “Sunflowers” in London’s National Gallery and then glued themselves to the wall, an act that made global headlines. The painting was protected by thick security glass, but social media reacted strongly to the protest that aimed to draw attention to the climate crisis. A Freedom of Information request from Novara Media revealed that the museum’s head of framing, Peter Schade, estimated the cost of retouching the frame at £150 (~$203). According to the media outlet, the museum also spent around £250 (~$338) restoring the wall, plus £35 (~$47) for paint, totaling about £435 (~$588) for all damages. In September 2024, when reporting on the sentencing, the BBC said that the pair caused £10,000 worth of damage to the gold-colored frame of the glass-covered painting…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/van-gogh-JSO-edit.jpg"
  },
  {
    "slug": "ut-austin-s-harry-ransom-center-provides-funded-fellowships-in-the-art",
    "title": "UT Austin’s Harry Ransom Center Provides Funded Fellowships in the Arts and Humanities",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "UT Austin’s Harry Ransom Center Provides Funded Fellowships in the Arts and Humanities Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Announcement Opportunities UT Austin’s Harry Ransom Center Provides Funded Fellowships in the Arts and Humanities The humanities library and museum will award up to 50 fellowships to support scholars, artists, and writers conducting on-site archival research. by Harry Ransom Center 58 minutes ago August 25, 2025 Friedländer Studio, “Poster for Harry Houdini's water torture cell escape at the Circus Busch in Berlin” (1912), Harry Houdini Papers, Harry Ransom Center, the University of Texas at Austin. Gift of the Hoblitzelle Foundation. The Harry Ransom Center at the University of Texas at Austin invites applications for its 2026–2027 research fellowship program . Up to 50 fellowships will be awarded to support projects that require substantial on-site use of the center’s internationally renowned collections in the humanities. Fellowships are open to graduate students, current and former academic faculty at any career stage, and independent researchers — including journalists and artists — whose work engages deeply with archival materials. Residency lengths range from one week to two months, with stipends provided to support travel and research. The center’s collections span literature, photography, film, art, and cultural history, offering rich opportunities for interdisciplinary exploration. The Lorne Michaels Collection, one of the latest additions to the Ransom Center archives, will be available for research starting January 2026. Research conducted by humanities scholars contributes to a dynamic body of knowledge that reshapes our understanding of what is preserved and valued in our communities. Applicants are encouraged to review the individual residency types and qualifications outlined in the application instructions. The deadline to apply is November 3, 2025 (5pm CST). About the Center The Harry Ransom Center is a humanities research library and museum that supports discovery, creativity, and scholarship. Its collections include nearly 45 million literary manuscripts, one million rare books, five million photographs, and more than 100,000 works of art. To learn more, visit ransom.center/fellowships . Share using Native tools Share Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Opportunities , Texas Leave a comment Cancel reply Only Members may post a comment. If you…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/PA00043_HoudiniH_osf_9_001_Stitched.jpg?fit=1875%2C1394&quality=90&ssl=1"
  },
  {
    "slug": "this-novel-is-the-art-world-s-black-mirror",
    "title": "This Novel Is the Art World’s Black Mirror",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "This Novel Is the Art World’s Black Mirror Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Book Review This Novel Is the Art World’s Black Mirror We all know the protagonists of Vincenzo Latronico’s Perfection . You’ve seen them at the gallery openings, on Instagram. In fact, there’s a good chance you are them. by Lisa Yin Zhang August 25, 2025 August 25, 2025 Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Book cover of Vincenzo Latronico’s Perfection (2022), translated by Sophie Hughes and published by New York Review Books (image courtesy New York Review Books) I started reading Italian novelist Vincenzo Latronico’s Perfection (2022) splayed out languidly on the beach. Then I was sitting up, nerves ablaze, and then on the train, the world outside whizzing past unnoticed, and then in bed that night, my Kindle having temporarily usurped my iPhone, and then it was over. I felt abuzz, delirious, called out. Reading Perfection is as uncanny and disturbing as looking at your doppelganger. I’m not a Southern European emigré to Berlin, like the main characters, Anna and Tom. But I am a part of the art world of New York, and their East Berlin reads a lot to me like my Brooklyn and Lower East Side. Because, as Latronico himself points out, their neighborhood could “just as well have been New York — or anywhere in the world, for that matter.” Translated by Sophie Hughes and published in English earlier this year, Perfection is fundamentally about making meaning in a world where the real and digital, the local and global, have fused into one hybrid, monstrous, relentless thing. Latronico lampoons a specifically white-collar, self-styled cultural person with an art…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Perfection-1-1-copy.jpg"
  },
  {
    "slug": "sandra-poulson-s-haunted-house",
    "title": "Sandra Poulson’s Haunted House",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sandra Poulson’s Haunted House Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review Sandra Poulson’s Haunted House Sculptures based on household objects make history palpable, layering colonial legacies, trade networks, and Angolan national memory. by Lisa Yin Zhang 1 hour ago August 22, 2025 Detail of Sandra Poulson, \"Confessionário\" (2024), pine, veneered oak, steel, and glass (all photos Lisa Yin Zhang/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . The Surrealists understood that so much depends on context: What is ordinary lining a glove, for instance, becomes grotesque in a teacup . Angolan artist Sandra Poulson — who studied fashion in Lisbon and London, and lives between the latter, Angola’s capital, Luanda, and Amsterdam — operates under a similar ethos of off-kilter recontextualization. In her first museum exhibition, at MoMA PS1, she presents wooden assemblages embedded in or punctured by the floating signifiers connected with Angola after its Civil War (1975–2002), which began immediately after the nation gained independence from Portugal. A bed frame lurches drunkenly toward the viewer; a mirror sits sullenly in the corner, a headboard bolts upright like a soldier. Across these mostly household objects, Poulson emphasizes that history is something that haunts you as you sleep, as you dress, as you look at yourself in the mirror. Several complex circuits converge in Poulson’s work: the global trade routes that brought this specific wood into the artist’s path; symbols connected to important events in Angolan history as they intersect with world events; and, finally, Poulson’s own stylistic iconography. The material itself is freighted: Vintage Dutch objects made from wood that might be sourced from Angola sit along chipboard furniture made in China in an American…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/IMG_1018.jpg?fit=2400%2C1800&quality=90&ssl=1"
  },
  {
    "slug": "the-life-or-death-art-of-hamad-butt",
    "title": "The Life-or-Death Art of Hamad Butt",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Life-or-Death Art of Hamad Butt Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review The Life-or-Death Art of Hamad Butt A survey centers the threat of disease and the complex, often contradictory emotions stirred up by the risk of contagion. by Anna Souter 3 hours ago August 22, 2025 Installation view of Hamad Butt: Apprehensions at Whitechapel Gallery, London (photo by Damian Griffiths, courtesy Whitechapel; all others Anna Souter/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . LONDON — There is something both frightening and fascinating about a sculpture that could kill you. Hamad Butt’s Familiars (1992) is a series of three sculptures that, if broken, could toxify the air and cause significant harm. “Familiars 3: Cradle” resembles a huge Newton’s cradle, common as a desk toy, wherein a ball is dropped against a stationary line of similar balls, causing the one at the other end to swing away before it falls back to repeat the process. In this case, however, the spheres are made of vacuum-sealed glass containing greenish-yellow chlorine gas — playing with this toy would spell disaster. This series exemplifies Butt’s career-long exploration of risk and contagion. Made at the height of the AIDS epidemic, and shortly after the artist’s own diagnosis, which would lead to his premature death two years later, Familiars throws oblique light on the threat of disease and the complex, often contradictory emotions thrown up by the risk of contagion. Another piece in the series, “Familiars 1: Substance Sublimation Unit,” consists of a ladder whose rungs are glass tubes containing a heating element and iodine crystals. The heaters periodically turn on and off, sublimating the iodine into an eerie purple…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/DSC5420LR.jpg?fit=1400%2C933&quality=90&ssl=1"
  },
  {
    "slug": "us-parks-agency-fires-ranger-who-displayed-trans-pride-flag-in-yosemit",
    "title": "US Parks Agency Fires Ranger Who Displayed Trans Pride Flag in Yosemite",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "US Parks Agency Fires Ranger Who Displayed Trans Pride Flag in Yosemite Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News US Parks Agency Fires Ranger Who Displayed Trans Pride Flag in Yosemite Hanging flags on the famous vertical wall of El Capitan is a tradition that many climbers have long participated in. by Maya Pontone August 26, 2025 August 26, 2025 Shannon “SJ” Joslin displayed this Transgender pride flag from the face of El Capitan in Yosemite National Park. (photo by Mitchell Overton, courtesy SJ Joslin) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . As the Trump administration ramps up efforts to erase LGBTQ+ voices and communities of color from the historical narrative , Yosemite National Park has terminated the employment of a park ranger after they displayed a transgender pride flag on a landmark rock formation during their off-duty hours. Shannon “SJ” Joslin, a ranger and wildlife biologist who has been working at the park since 2021, said they were fired from their “dream job” on August 12 in an Instagram post . According to Joslin, Temporary Deputy Superintendent Ray McPadden of the National Park Service (NPS) told them that they had “[failed] to demonstrate acceptable conduct” after they hung the Trans Pride flag on the face of the granite monolith El Capitan. “The messages my termination send out to the public is that if you have an identity that has been turned into a ‘ideology’ not in line with the current administration, your rights will be different than other Americans that fall into the ‘ideal standard’ for who and what a person should be, look like, and believe in,” Joslin told Hyperallergic . An NPS spokesperson told Hyperallergic…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/trans-flag-overtone-mitchell.jpg"
  },
  {
    "slug": "new-york-area-shows-to-see-right-now",
    "title": "New York Area Shows to See Right Now",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "New York Area Shows to See Right Now Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Guide New York Area Shows to See Right Now From James Bidgood’s homoerotic photographs to Jeremy Frey’s basketry, there’s still plenty of art to see before the fall art season starts up. by Lisa Yin Zhang , Daniel Larkin , Julie Schneider and Alexandra M. Thomas August 26, 2025 August 27, 2025 James Bidgood, “Pan” (late 1960s) (image courtesy CLAMP, New York, © Estate of James Bidgood) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . As the summer winds down and the season of art fairs and openings approaches, you might assume that the entire art world is on vacation right now. Don’t make the mistake of taking your own vacation from art just yet — there’s still plenty to see. For starters, visit CLAMP’s showcase of James Bidgood’s homoerotic photographs from the 1960s, a phantasmagoria of mythological cosplay closing this weekend. An exhibition of Beauford Delaney’s drawings at the Drawing Center is another must-see, as it focuses on the importance of this medium in the artist’s practice, and Sandra Poulson’s work, currently at MoMA PS1, is a fascinating take on the political life of domestic symbols and objects. Meanwhile, a quick trip to Greenwich, Connecticut, will lead you to the Bruce Museum, where Jeremy Frey’s stunning basketry awaits. And while you’re out and about in the city, make sure to check out American Art Catalogues’s small but potent show of paintings by Joe Brainard , up through this weekend. — Natalie Haddad, Reviews Editor James Bidgood: Dreamlands CLAMP , 247 West 29th Street, Chelsea, Manhattan Through August 29 James Bidgood, “Bruce Kirkman Leaning on…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Bidgood_Pan-hires-copy.jpeg"
  },
  {
    "slug": "colorado-town-settles-with-native-artist-who-brought-free-speech-lawsu",
    "title": "Colorado Town Settles With Native Artist Who Brought Free Speech Lawsuit",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Colorado Town Settles With Native Artist Who Brought Free Speech Lawsuit Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Colorado Town Settles With Native Artist Who Brought Free Speech Lawsuit The town of Vail canceled Danielle SeeWalker’s residency last year after she shared an unrelated painting in support of Palestine on her Instagram. by Isa Farfan August 25, 2025 August 25, 2025 Danielle SeeWalker with her artwork \"G is for Genocide\" (2024) (all images courtesy Danielle SeeWalker) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Húŋkpapȟa Lakȟóta painter Danielle SeeWalker has settled a civil rights lawsuit with the town of Vail, Colorado, more than a year after the municipality cancelled her artist residency over a pro-Palestine artwork. Brought by the American Civil Liberties Union (ACLU) of Colorado, the suit claimed that the town had violated the artist’s constitutional right to free speech. In last week’s settlement, Vail agreed to several concessions, including funding an art program “for underrepresented and economically disadvantaged people” and hosting a powwow led by SeeWalker every year for the next five years. “The intention is to allow other underrepresented artists, including Native American people, to have the opportunity of creating art in the town of Vail in place of my own missed opportunity,” SeeWalker said in a statement. The settlement also included Vail’s commitment to sponsor a “community forum” on Israel and Palestine that would include interfaith leaders and host an annual Indigenous-led cultural sensitivity training for employees of the municipality’s Arts and Public Places Department. Get the latest art news, reviews and opinions from Hyperallergic. Daily Weekly Opportunities Sign up A spokesperson for the town of Vail did not respond to Hyperallergic ‘s inquiries about…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/GisforGenocideinstudio.jpg"
  },
  {
    "slug": "dust-storm-blows-away-ukrainian-artwork-at-burning-man",
    "title": "Dust Storm Blows Away Ukrainian Artwork at Burning Man",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Dust Storm Blows Away Ukrainian Artwork at Burning Man Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Dust Storm Blows Away Ukrainian Artwork at Burning Man The monumental work “Black Cloud” was destroyed within hours of installation on Ukraine’s Independence Day. by Maya Pontone August 25, 2025 August 25, 2025 The 50-foot-tall inflatable installation \"Black Cloud\" was swept away by powerful gusts of wind at Burning Man in Nevada. (all photos and video by Gregory Vepryk, courtesy Black Cloud) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Ferocious desert stormwinds have swept away a colossal Ukrainian artwork within hours of its installation at the annual Burning Man cultural festival in Nevada. A visual metaphor for the impending threat of war, the 50-foot-tall (~15.2-meter-tall) inflatable “Black Cloud” was destroyed shortly after debuting at the Black Rock Desert event yesterday, August 24, on Ukraine’s Independence Day. The work consisted of 45 interconnected blow-up forms with flashing strobes and a continuous soundscape created from real audio of warfare in Ukraine. General producer Vitaliy Deynega wrote on Facebook that although the installation was intended to withstand such weather conditions, it was torn apart in less than 15 minutes. The installation served as a visual metaphor of the threat of impending war. Get the latest art news, reviews and opinions from Hyperallergic. Daily Weekly Opportunities Sign up Fierce gusts of wind tore apart the inflatable installation within 15 minutes. “It was a feeling I experienced only once before — in February 2022, when I woke up to explosions and sirens,” Deynega said in a statement shared with Hyperallergic . The powerful dust storm, accompanied by 50 mph winds, has reportedly resulted in at least four…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/black-clopud-far-away.jpg"
  },
  {
    "slug": "we-are-all-picasso-s-fishermen",
    "title": "We Are All Picasso’s Fishermen",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "We Are All Picasso’s Fishermen Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Opinion We Are All Picasso’s Fishermen The artist painted a balmy summer scene in August 1939. Could anyone imagine the impending horrors? by Hakim Bishara August 25, 2025 August 25, 2025 Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Pablo Picasso’s “Night Fishing at Antibes” (1939) at the Museum of Modern Art in New York (all photos Hakim Bishara/ Hyperallergic ) A quick perusal of the headlines these days is enough for one to conclude that dictators don’t die but multiply, and that history doesn’t repeat itself — it vomits in its own mouth. The year is 1939. It’s a balmy August night, lit by a big, yellow moon. Two fishermen in a boat are earning their keep out there off the shore of Antibes in southern France. One of them aims at a large, curmudgeonly fish with a pitchfork, the other tries his luck with a fishing line. A cautious crab keeps a safe distance. Gas lamps reflect on the water’s surface and flicker into the air. A girl on a bike observes the whole scene from a high dock while licking an ice cream. She’s there with a friend, it seems. Luxurious Monaco is less than an hour away by car. Beachy Nice is even closer. Everything looks fine and lovely. But beneath these calm waters swirl malignant tides that portend the onset of a Second, much deadlier World War just a few weeks away. Get the latest art news, reviews and opinions from Hyperallergic. Daily Weekly Opportunities Sign up This scene in Pablo Picasso’s “Night Fishing at Antibes” stopped me in my tracks during a…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/image00003-scaled.jpeg?fit=2560%2C1375&quality=90&ssl=1"
  },
  {
    "slug": "the-black-feminist-subconscious-of-ufuoma-essi-s-films",
    "title": "The Black Feminist Subconscious of Ufuoma Essi’s Films",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Black Feminist Subconscious of Ufuoma Essi’s Films Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review The Black Feminist Subconscious of Ufuoma Essi’s Films Two works on view at MoMA attest to the artist’s great skill: articulating her focus on marginalized histories through aesthetic and sensory means. by Natalie Haddad August 25, 2025 August 25, 2025 Ufuoma Essi, \"Bodies In Dissent\" (2021), scanned Super 8mm film (color), 6 min. (image courtesy the artist) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . At first glance, the two Super 8 films that comprise Ufuoma Essi’s exhibition at the Museum of Modern Art (MoMA) seem to compete for attention. “Bodies In Dissent” (2021) juxtaposes the artist’s footage of a performer with archival film of a 1960s jazz concert and a dancer in a succinct six minutes. On the opposite side of the gallery, “Half Memory” (2024) coalesces three years of filming in the United Kingdom, United States, and France into an allusive, nonlinear 27 minutes. Soon, though, the two works come to complement each other, their dreamlike atmospheres opening onto shared themes of history and memory threaded through with the voices of Black artists and intellectuals. In “Bodies In Dissent,” Essi’s scenes of artist Nambi Kiyira performing in a grassy green field are interspersed with black and white video of then-married jazz drummer Max Roach and singer Abbey Lincoln during a 1964 concert, and archival clips of dancer Loretta Abbott. Kiyira, wearing a long black dress, is seen alternately from afar and up close, backed by audio from the concert. “Half Memory” takes Toni Morrison’s essay “The Site of Memory” (1986) and her concept of “rememory” — repressed memories returning via a…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/2021_Bodies-In-Dissent_Still-1.jpg?fit=2000%2C1451&quality=90&ssl=1"
  },
  {
    "slug": "africa-wants-a-more-accurate-world-map",
    "title": "Africa Wants a More Accurate World Map",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Africa Wants a More Accurate World Map Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Africa Wants a More Accurate World Map The current standard misrepresents the continent’s scale, which activists argue reinforces misconceptions about its significance. by Isa Farfan August 27, 2025 August 27, 2025 The African Union endorsed a map that reflects the truer relative size of the continent. (map public domain via Equal Earth ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . The African Union, an intergovernmental organization of 55 African countries, endorsed a version of the world map that more accurately reflects the continent’s scale earlier this month, as first reported by Reuters . The union said it would back the Correct the Map campaign to pressure governments and global organizations to phase out the widely used Mercator map in favor of the Equal Earth projection first proposed in 2018. The former distorts the Earth’s poles, making landmasses like Greenland and Antarctica appear disproportionately large. Advocates for the change argue that the map misrepresents and diminishes the world’s perception of the African continent. The Equal Earth map, on the other hand, enlarges the continent to more accurately reflect its relative size. First devised in 1569 by Flemish cartographer Gerardus Mercator, the ubiquitous Mercator projection features longitude lines that are equally spaced vertically across the globe. Latitude lines, however, are unevenly spaced, with the gaps between them growing wider the further out they are from the equator. This scaling creates a distorted, stretched-out effect at the top and bottom of the Earth. As a result, Greenland appears about equal in size to the entire African continent, when in reality the latter is about 14 times larger…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/EqualEarth.jpg"
  },
  {
    "slug": "landmark-raphael-retrospective-is-coming-to-the-met",
    "title": "Landmark Raphael Retrospective Is Coming to The Met",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Landmark Raphael Retrospective Is Coming to The Met Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Landmark Raphael Retrospective Is Coming to The Met The High Renaissance master’s first comprehensive international loan exhibition in the United States will feature pieces never before shown together. by Maya Pontone August 26, 2025 August 27, 2025 Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Raphael, “The Virgin and Child with Infant Saint John the Baptist in a Landscape (The Alba Madonna)” (1509–11) (image courtesy National Gallery of Art, Washington) “How generous and kind Heaven sometimes proves to be,” mused Italian Renaissance artist and historian Giorgio Vasari, “when it brings together in a single person the boundless riches of its treasures and all those graces and rare gifts that over a period of time are usually divided among many individuals.” Writing in his foundational 1550 Lives of the Artists , Vasari was describing none other than Raffaello Sanzio da Urbino — known as Raphael — the High Renaissance titan who was, in his words, among our “mortal gods.” Though centuries have passed since this text was written, Raphael’s masterful synthesis of clarity, beauty, and harmony remains resonant, as evinced by the announcement of a major upcoming exhibition of the artist’s work at the Metropolitan Museum of Art. Raphael: Sublime Poetry , opening in the spring, will feature more than 200 drawings, paintings, tapestries, and decorative works by the illustrious artist in the first comprehensive international loan exhibition in the United States dedicated to his oeuvre. Raphael, “The Ecstasy of Saint Cecilia with Saints Paul, John the Evangelist, Augustine, and Mary Magdalene” (1515–16), (image by Scala / Art Resource, NY, courtesy Polo Museale dell’Emilia Romagna,…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/ectasy-crop.jpg"
  },
  {
    "slug": "amy-sherald-speaks-out-on-cancelling-her-smithsonian-show",
    "title": "Amy Sherald Speaks Out on Cancelling Her Smithsonian Show",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Amy Sherald Speaks Out on Cancelling Her Smithsonian Show Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Amy Sherald Speaks Out on Cancelling Her Smithsonian Show “When governments police museums, they are not simply policing exhibitions. They are policing imagination itself,” the artist wrote in a new opinion essay. by Isa Farfan August 26, 2025 August 26, 2025 \"I cannot in good conscience comply with a culture of censorship, especially when it targets vulnerable communities,\" wrote artist Amy Sherald in her recent opinion essay. (photo by Arturo Holmes via Getty Images) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Amy Sherald, the painter most widely known for her portrait of former First Lady Michelle Obama, detailed her decision to withdraw her exhibition from the Smithsonian’s National Portrait Gallery (NPG) amid concerns over censorship at the institution in a new opinion piece . On MSNBC ’s opinion blog last Sunday, August 24, Sherald condemned the Trump administration’s ongoing efforts to reshape the Smithsonian Institution, cautioning that it could “rewrite” history. “When governments police museums, they are not simply policing exhibitions. They are policing imagination itself,” Sherald wrote in her opinion, titled “Censorship has taken hold at the Smithsonian. I refused to play along.” The artist cancelled the NPG’s planned exhibition of her touring show, Amy Sherald: American Sublime , in July, claiming that she learned the institution was considering removing her painting “Trans Forming Liberty” (2024). The work envisions the Statue of Liberty as a Black trans woman, modeled after drag performer and musician Arewà Basit , and graced the cover of the New Yorker earlier this month . Get the latest art news, reviews and opinions from Hyperallergic. Daily Weekly…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/amy-sherald-dec-2024.jpg"
  },
  {
    "slug": "the-artist-freeing-museums-captive-instruments",
    "title": "The Artist Freeing Museums’ Captive Instruments",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Artist Freeing Museums’ Captive Instruments Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Features The Artist Freeing Museums’ Captive Instruments In an interview with Hyperallergic , Satch Hoyt shared his process of “un-muting” African musical objects long relegated to storage. by Noah Angell August 26, 2025 August 27, 2025 Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Satch Hoyt (undated) (photo by and courtesy Gabriel Schimmeroth) HAMBURG, Germany — “Ok, stop the cameras,” the head conservator commanded from the belly of the storage department. “I want to hear what these instruments sound like without Satch wearing the gloves.” The other assembled staff, seated in a scatter of folding chairs beneath the MARKK ethnographic museum in Hamburg, lowered their phones and tucked them away. These museum workers had gathered in the MARKK’s basement to oversee and document artist and musician Satch Hoyt “un-mute” the African instrument collection, as he calls it. A masterful player of wind and percussion alike, Hoyt has been working to gain access to African instrument collections in colonial and ethnographic museums so that they may be played again. Within certain African diasporic traditions, some of these instruments are understood as tools to communicate with the creator and ancestors. Thus, this un-muting is not a mere symbolic act protesting the enforced dormancy of museum storage, but an affirmation of fluid continuity between the living and ancestral realms. Surrounded by masks and statues in the dimly lit storage den, who seemed to be watching, Hoyt dispensed with the white archival gloves he had previously been instructed to wear. He then began, gently, to play a sanza. Get the latest art news, reviews and opinions from Hyperallergic. Daily Weekly Opportunities…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/ZySr9-scaled-1.jpeg"
  },
  {
    "slug": "an-ancient-roman-guide-to-trump-s-authoritarian-playbook",
    "title": "An Ancient Roman Guide to Trump’s Authoritarian Playbook",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "An Ancient Roman Guide to Trump’s Authoritarian Playbook Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Features An Ancient Roman Guide to Trump’s Authoritarian Playbook The authors of a new anthology argue that we can understand and counter authoritarianism’s rapid expansion today by looking at culture in the time of Julius Caesar. by Sarah E. Bond August 26, 2025 August 27, 2025 Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Jean-Léon Gérôme, “The Death of Caesar” (1867), oil on canvas (image public domain via the Walters Art Museum) Authoritarianism is on the rise across the globe, including in the United States. In April 2025, NPR reported that in a survey of over 500 political scientists, the majority believed that the United States was moving from a liberal democracy toward authoritarianism. And that was before June, when regular Americans took to the streets in record numbers to oppose it. Over 5 million turned out to support the “ No Kings ” marches across the country on June 14 to protest Trump’s policies and a “military parade” on his birthday, budgeted at $45 million . But where can we turn to for resistance strategies? Might the historical rise of authoritarianism in the ancient world help us understand its rapid expansion today? A freely downloadable book by top ancient historians across the globe, How Republics Die: Creeping Authoritarianism in Ancient Rome and Beyond (De Gruyter, 2025), argues that it can. In the new anthology, edited by Frederik Juliaan Vervaet, David Rafferty, and Christopher J. Dart, the authors collectively claim that readers can use Ancient Roman history to make sense of the rapid descent into fascism in the United States. A key reason for choosing…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/jean-leon-gerome-death-of-caesar_featured.jpg"
  },
  {
    "slug": "skawennati-s-cyberpunk-future-is-now",
    "title": "Skawennati’s Cyberpunk Future Is Now",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Skawennati’s Cyberpunk Future Is Now Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Features Skawennati’s Cyberpunk Future Is Now The artist’s mid-career survey features Indigenous sci-fi retellings of Hotinonshón:ni cosmology and histories, expressed through her avatars. by Rea McNamara August 26, 2025 August 28, 2025 Skawennati, (left) “Circle Wampum” (2017) and (right) “Otsitsakáion Cosplay Costume” (2017) (all photos Rea McNamara/ Hyperallergic , unless otherwise noted) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . OTTAWA — I first encountered multidisciplinary artist Skawennati in person at her December 2019 talk at the former McLuhan Centre for Communication and Technology in Toronto. I recall that the artist wore Barbie-doll pink; I later learned that she is a Barbie fan. At the talk, Skawennati introduced herself as both an urban Kanien’kehá:ka (Mohawk) woman and a cyberpunk avatar. She discussed her longtime practice of costuming avatars as a means of realizing Indigenous peoples’ self-determination in the Aboriginal Territories in Cyberspace (AbTeC) — a thriving, futuristic island she maintains in the virtual world, Second Life. Later, she shared work-in-progress documentation for the project Calico & Camouflage (2020–22), a fashion line of Turtle Island “resistance wear” — her interpretation of traditional ribbon shirts and combat pants as Kanien’kehá:ka protest gear — for both avatars and IRL models. At the time, I was taken by Skawennati’s commitment to working within a massive multiplayer virtual world that was, in my view, a ghost town. She was adamant that if the platform were to “sunset,” she would stop making her avatars: “In the end, I know it’s not mine,” she shared with me in a 2020 interview for an Art in America profile . The Montreal-based artist utilizes these characters, as…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/NGC.jpg"
  },
  {
    "slug": "a-view-from-the-easel",
    "title": "A View From the Easel",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "A View From the Easel Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Community A View From the Easel A View From the Easel “I wanted a true artist’s home — welcoming, colorful, like a cabinet of curiosities; weird, filled with me.” by Lakshmi Rivera Amin August 28, 2025 August 28, 2025 Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Welcome to the 300th installment — woohoo! — of A View From the Easel, a series in which artists reflect on their workspace. This week, artists bring a Parisian sensibility to Nebraska and return to their dream studio after two decades. Want to take part? Check out our submission guidelines and share a bit about your studio with us through this form ! All mediums and workspaces are welcome, including your home studio. Laurie Victor Kay , Omaha, Nebraska Get the latest art news, reviews and opinions from Hyperallergic. Daily Weekly Opportunities Sign up How long have you been working in this space? I’ve been in my studio, LVK Atelier, for about one year. I moved into the space shortly after my mom died from a very short battle with cancer. Moving here meant seismic change for me — leaving my family home, marriage, and longtime former studio. My mom worked with arts and accessibility. Her spirit is everywhere, and it is truly an amazing space. Every visitor feels the strong, positive, creative energy. When I moved in, I began imagining how I wanted my studio to feel, planning for months before starting construction. I was literally rebuilding myself while building my studio space. The first of many projects as a newly independent mid-career artist who had lost her mom and…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/laurie-katz-studio-trees.jpg"
  },
  {
    "slug": "your-guide-to-nyc-s-fall-art-fairs",
    "title": "Your Guide to NYC’s Fall Art Fairs",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "An Insider’s Guide to NYC’s Fall 2025 Art Fairs Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Guide Your Guide to NYC’s Fall Art Fairs What to see at the Armory Show and beyond — from a sceney exhibition in an office building to a beloved art book fair back at MoMA PS1. by Isa Farfan and Maya Pontone August 27, 2025 August 28, 2025 Christopher Myers, \"Proserpere\" (2024) will be on view at the Armory Show. (image courtesy James Cohan Gallery) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . It’s about that time of year when the slight crisping of the air signals that the balmy summer is departing, but hasn’t disappeared just yet. Suddenly, the fluorescent lights, lively chatter, and overpriced opening wine flowing onto the New York City streets beckon the passerby who has spent all summer tanning in Central Park. It’s fall art fair season, at last. As usual, the season’s kicking off with the gargantuan Armory Show next week, followed by a lineup of shows that range from the alternative (zines!) to the conservative and historical (Independent 2oth Century). This year brings a few changes, though: the unexpected cancellation of the Art Dealers Association of America’s annual Art Show, for instance, typically an anchor of the autumn fairs. Volta is also skipping its NYC edition, while Clio is having two fairs in the same month. The art market might be topsy-turvy, but your fairgoing experience doesn’t have to be. Our handy guide below is here to help navigate your way through it all. Get the latest art news, reviews and opinions from Hyperallergic. Daily Weekly Opportunities Sign up The Armory Show September 5–7 | thearmoryshow.com Javits…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/roots-copy.jpg"
  },
  {
    "slug": "is-jenny-saville-the-uk-s-greatest-living-painter",
    "title": "Is Jenny Saville the UK’s Greatest Living Painter?",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Is Jenny Saville the UK’s Greatest Living Painter? Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review Is Jenny Saville the UK’s Greatest Living Painter? Enormous in scale, Saville’s uncomfortably close-cropped depictions of women’s faces and nude bodies abound in the joy of painterly modeling. by Olivia McEwan August 27, 2025 August 28, 2025 Jenny Saville, \"Reverse\" (2002–3), oil on canvas; Private Collection (courtesy Gagosian © Jenny Saville; all other photos Olivia McEwan/ Hyperallergic unless otherwise noted) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . LONDON — Of all the YBAs (Young British Artists) of the 1990s — including upstarts like Damien Hirst and Tracey Emin, mouthing off petulantly to the art establishment with dead livestock and unmade beds — it is Jenny Saville who has been most entrenched in the history of art. It is also Saville who can most convincingly claim to be Britain’s greatest living painter since the death of Lucien Freud (sorry, David Hockney). The artist’s superb draughtsmanship skills, informed by absorption and understanding of the Old Masters, are combined with a painterly technique that manipulates its plasticity for all its worth. (Ironically, Tracey Emin is a professor of drawing at the Royal Academy despite having no capacity for drawing.) Saville’s style is as complete and significant as that of Freud. It is hard to overestimate the impact of Saville’s early works on British contemporary painting. Her paintings often disappear into the most discerning private ownership. Those in public collections are the rare anomaly in her current survey, The Anatomy of Painting , at the National Portrait Gallery. As a result, some of that impact is recreated for those viewing her art for the first time.…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Reverse-2002-2003-by-Jenny-Saville-Private-Collection-courtesy-Gagosian-©-Jenny-Saville.jpg"
  },
  {
    "slug": "photographs-that-depict-alzheimer-s-with-dignity",
    "title": "Photographs That Depict Alzheimer’s With Dignity",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Photographs That Depict Alzheimer's With Dignity Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Features Photographs That Depict Alzheimer’s With Dignity Alicia Vera documents and processes her mother’s disease diagnosis in a new book. by Monica Uszerowicz August 27, 2025 August 28, 2025 Work by Alicia Vera in Va a Llover Toda La Noche (2025), with the caption: \"Mom in Mexico City, a year prior to her Alzheimer's diagnosis. She was already showing symptoms — misplacing things, withdrawing from social activities, mood changes and increased memory loss.\" (all images courtesy Alicia Vera) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . In photographer Alicia Vera’s portrait of her mother, Concepcion, she gazes skyward, her expression somewhere between curious and awestruck. The image has enough stylistic mottling and grain to obscure any sort of background, but Concepcion is clear: broad cheekbones, bejeweled ears, eyes full of wonder—maybe. Vera is a deeply humanistic image-maker, and it’s impossible to differentiate between a posed subject and a candid one. She approaches both with generosity. Isolated, the phrase “va a llover toda la noche,” which translates in English to “it’s going to rain all night,” feels like a snippet of poetry or song. A few years ago, it was a note left on Vera’s door by her mother. Now, it’s the title of Vera’s new project, and a self-published book of the same name, documenting Concepcion’s Alzheimer’s disease diagnosis and Vera’s experience processing it. “Every time I go home to Miami, I stay in my childhood home,” Vera shares. “My mom loves to leave notes on the door. I kept this one; a year or so later, when I was taking out all this material I had,…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/2zqNE-scaled.jpeg"
  },
  {
    "slug": "pennsylvania-museum-sues-trump-administration-over-grant-cuts",
    "title": "Pennsylvania Museum Sues Trump Administration Over Grant Cuts",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Pennsylvania Museum Sues Trump Administration Over Grant Cuts Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Trump Administration Pennsylvania Museum Sues Trump Administration Over Grant Cuts The president effectively dismantled the Institute of Museum and Library Services, leaving hundreds of federal fund recipients in the lurch. by Isa Farfan August 27, 2025 August 27, 2025 Woodmere's Maguire Hall (courtesy of the Woodmere Art Museum) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . A Pennsylvania art museum is suing the Trump administration after the government terminated a $750,000 federal grant for collection conservation earlier this year. The Woodmere Art Museum in Philadelphia filed a lawsuit yesterday, August 26, against President Donald Trump, the Institute of Museum and Library Services (IMLS), the agency’s Interim Director Keith Sonderling, and other administration officials, months after the agency revoked its Fiscal Year 2024 “Save America’s Treasures” grant. The museum, which operates out of a 19th-century mansion in the city’s Chestnut Hill neighborhood, alleges that Trump officials usurped Congress’s authority to distribute federal funds by prematurely terminating its grant. The IMLS grant that the Woodmere received is administered in partnership with the National Park Service and awarded to “historic properties and collections.” After receiving the grant, according to the lawsuit, the museum initiated an “ambitious conservation project” to prepare an exhibition of Philadelphia artists in 2026, timed with America’s 250th celebrations. The museum received just $195,000 of its total grant before its termination. The Woodmere hopes the IMLS will restore its funding so that it can continue its original planned project to install new storage facilities, address collection crowding, and improve cataloguing efforts. Get the latest art news, reviews and opinions from Hyperallergic. Daily Weekly Opportunities…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/woodmere.jpg"
  },
  {
    "slug": "wafaa-bilal-asks-what-it-means-to-be-arab-in-america",
    "title": "Wafaa Bilal Asks What it Means to be Arab in America",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Wafaa Bilal Asks What it Means to be Arab in America Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review Wafaa Bilal Asks What it Means to be Arab in America The Iraqi artist’s Chicago survey show uses technology and performance to address the experience of his identity in the post-9/11 era. by Elliot Josephine Leila Reichert August 27, 2025 August 27, 2025 Wafaa Bilal, \"Rendering of Canto III\" (2024) (© Wafaa Bilal, courtesy the artist) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . CHICAGO — Though Wafaa Bilal was born in Iraq and is based in New York, his survey at the Museum of Contemporary Art Chicago, Indulge Me , can be called a homecoming of sorts. In 2007, the accomplished yet underrated artist captured the art world’s attention with his durational performance “Domestic Tension,” wherein he lived for 30 days inside the exhibition space of Chicago’s FlatFile Gallery; a web camera broadcast his movements while a paintball gun was available for anyone to remotely fire at him via a website. Reconstructed as an open-face cubicle inside the museum’s pristine gallery space, the splatters of thousands of yellow paintballs on its interior walls do not convey the torturous persistence of the gun as forcefully as the brief video diary screened on a small monitor nearby. In an increasingly distressed voice, the goggled Bilal unironically thanks his audience for their participation as the gun processes a ceaseless string of firing commands. For a significant survey, the exhibition is remarkably spare. Curator Bana Kattan selected five major projects, each one integrating technology, performance, and a conceptual approach to the conditions of being Arab in the United States in the post-9/11 era.…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Combined.jpg"
  },
  {
    "slug": "this-beautiful-city-in-washington-is-the-pacific-northwest-s-best-kept",
    "title": "This Beautiful City In Washington Is the Pacific Northwest’s Best Kept Secret",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "This Beautiful City In Washington Is the Pacific Northwest’s Best Kept Secret - Travel Off Path Skip to Content Search Search for: Close Search × Home Travel News Traveler Tools 1 Minute Trip Check Entry Requirement Checker Travel Advisory Checker Cancun Resort Finder Cabo Resort Finder About About Us Work With Us Press Contact Us Premium Get Premium Members Only Sign in This Beautiful City In Washington Is the Pacific Northwest’s Best Kept Secret Posted on Last updated: August 29, 2025 4 Comments Posted By: Tyler Fox Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date. You know that sweet spot where a trip feels polished and effortless but still outdoorsy and spontaneous? That was Bellevue. I expected “nice.” I didn’t expect to spend mornings zipping through new-growth trees, afternoons cruising past waterfront mansions on a whisper-quiet boat, and evenings hopping between skyline views and cozy neighborhood patios without ever feeling stressed or rushed. But that's exactly how our long weekend went down and why I think Bellevue is the most “have-it-all” city break in the Pacific Northwest right now. Why Bellevue Works (Even If You’re “Not A City Person”) Bellevue has major-city energy! World-class dining, slick hotels, and shiny shopping await, but it also lets you vanish into parks, lakes, and leafy trails in minutes. One second you’re grabbing a latte; the next you’re biking next to a blueberry farm or kayaking a quiet slough with turtles popping up next to your paddle. It’s clean, it’s easy, and summer here is perfect . We based ourselves at The Bellevue Collection , a trio of properties (Bellevue Square, Lincoln Square, and Bellevue Place) connected by skybridges. Let me translate… movie theaters, VR arenas, restaurants, and both of our hotels were a weather-proof stroll apart. No logistics math, no Ubers for short hops. Just wander. @traveloffpath The Bellevue Collection Is THE Place To Stay when visiting Bellevue! ♬ original sound – reeltemplates.pro Where We Stayed: W Bellevue vs. The Westin We split the stay to compare vibes, but never even had to cross a street thanks to the skybridge connections! We loved both stays, but if you're wondering which one you'd like more here is what we thought: W Bellevue — Young, buzzy energy with fun public spaces. We arrived early, dropped our bags, and literally went upstairs to catch a movie while the room finished—then walked back via skybridge to check in. If you like a stylish scene with a great bar…",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/A-view-of-the-Bellevue-skyline-acroos-Lake-Washington.jpg"
  },
  {
    "slug": "five-of-the-world-s-safest-countries-for-2025",
    "title": "Five of the world's safest countries for 2025",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "Five of the world's safest countries for 2025 Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Five of the world's safest countries for 2025 8 days ago Share Save Lindsey Galloway Share Save Getty Images In a year marked by conflict, five nations continue to rank among the world's most peaceful. Residents reveal how policies and culture shape daily life and create a sense of calm. In 2025, peace can feel like a rare commodity. Global wars are escalating, border security is tightening, and trade tensions continue to mount. According to the 2025 Global Peace Index (GPI), the number of state-based conflicts has reached its highest level since World War Two, with three more breaking out this year alone. Many countries are responding with increased militarisation. Yet despite those grim statistics, some nations continue to prioritise peace. The GPI, produced by the Institute for Economics & Peace , tracks 23 indicators, from external conflicts and military expenditure to safety and security measures like terrorism and homicide. The countries ranked at the top of the index have been remarkably consistent for nearly two decades, showing the stability that peaceful policies can bring over the long haul. We spoke to residents in some of the world's most peaceful counties to learn about how those policies shape day-to-day life – and what gives them a unique sense of security and calm. Iceland Ranked number one since 2008, Iceland remains the world's most peaceful nation, leading across all three domains: safety and security, ongoing conflict and militarisation. It even recorded a 2% improvement this year, widening the gap from the second-place country on the list. For locals, that sense of safety is baked into everyday life. \"While harsh weather conditions, especially in winter, may not always…",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lyg34j.jpg"
  },
  {
    "slug": "spain-s-135-year-old-scenic-british-train-line",
    "title": "Spain's 135-year-old scenic British train line",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "Spain's 135-year-old scenic British train line through 'bandit country' Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Spain's 135-year-old scenic British train line through 'bandit country' 23 August 2025 Share Save Andrew Lofthouse Share Save Alamy Mr Henderson's Railway takes passengers on a scenic journey from the Bay of Gibraltar through the stunning Andalusian countryside – and Spain's brigand past. As I stepped aboard Mr Henderson's Railway in the Spanish city of Algeciras, the sun's rays pierced through the branches of juniper trees, and we chugged away from the glittering Bay of Gibraltar. The three-carriage retro British train soon trundled over the Guadiaro river, and cork forests framed the green-and-ochre patchwork fields as we wound our way north into the heart of Andalusia. Ride the train You can purchase tickets for Mr Henderson's Railway here. Three trains a day travel between Algeciras and Bobadilla. One-way tickets cost €18.70 and round-trip tickets cost €29.90. Two hundred years after the British invented the modern railway , this Victorian-era line, launched in 1892, still weaves its way between mainland Europe's southernmost rail station in Algeciras, through the stunning Serranía de Ronda region to its terminus in Bobadilla. During the three-hour journey the diesel-powered carriages slowly climb the single track to nearly 800m above sea level while journeying through 16 tunnels and across 20 bridges. The route offers passengers up-close views of rural Andalusian pueblos blancos (white hill towns) and undulating countryside, seamlessly reconnecting travellers with the golden age of train travel. Gibraltar's strategic location at the western entrance of the Mediterranean has long lured overseas powers, including the British. After Spain ceded \" The Rock \" to Britain in 1713, the opening of the Suez Canal in 1869 increased the headland's strategic importance. But in…",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lyjky1.jpg"
  },
  {
    "slug": "sleep-at-europe-s-unluckiest-train-station",
    "title": "Sleep at 'Europe's unluckiest train station'",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "The century-long saga of Europe's unluckiest train station Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live The century-long saga of Europe's unluckiest train station 22 August 2025 Share Save Richard Collett Share Save Richard Collett Once hailed as the \"Titanic of the Pyrenees\", Canfranc International Station in northern Spain was plagued by disaster, derailment and decades of abandonment. Now, almost 100 years after its grand opening, the Beaux-Arts giant has been reborn as a five-star hotel – and could soon welcome international trains again. Monstrous in scale yet elegant in design, Canfranc International Station's 200m-long, Beaux-Arts facade seems curiously out of place in a mountain village of just 500 residents. But this behemoth tucked high in the Spanish Pyrenees isn't merely incongruous; it's often called Europe's unluckiest train station. When it opened to great fanfare in 1928, the lavish new transit hub was meant to shuttle hundreds of thousands of passengers between Canfranc and the French city of Pau. But almost from the start, misfortune struck. A fire gutted the building just three years later; the Great Depression slowed repairs; then the Spanish Civil War ground services to a halt. During World War Two, Canfranc became a hotbed of intrigue where Jewish refugees, escaped POWs and downed Allied airmen were smuggled across the border from Nazi-occupied France under the noses of German soldiers and Gestapo agents stationed on the French-controlled side. In 1970, a disastrous train derailment destroyed a key bridge on the French side, severing the line for good. The station was abandoned soon after. Almost a century after its opening, however, the \"Titanic of the Pyrenees\" – as it became known – is finally turning its bad luck around. In 2023, after years of renovation, the station reopened as a…",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0ly61v8.jpg"
  },
  {
    "slug": "how-europe-s-oldest-language-ended-up-on-us-trees",
    "title": "How Europe's oldest language ended up on US trees",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "How Europe's oldest language ended up on US trees Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live How Europe's oldest language ended up on US trees 21 August 2025 Share Save Haley Harrison Share Save Haley Harrison The US' Basque immigrants turned to sheepherding in order to survive. Today, their legacy can be found in unique wooden tree carvings they left throughout the American West. Iñaki Arrieta Baro remembers the day he trekked through the sagebrush, desert and wooded trails of Northern Nevada with a Basque-American family to locate a very special ancestral heirloom. Tracing their grandfather's footsteps, the group followed GPS coordinates to a remote location on what is now a private ranch. Among a grove of aspens, they found what they were looking for: a tree engraved decades ago with their grandfather's name. \"We were standing in the same place where their grandfather stood,\" says Arrieta Baro, head librarian of the Jon Bilbao Basque Library at the University of Nevada, Reno. \"It was very emotional.\" Between the US Pacific coast and the state of Wyoming, stories from the region's 19th and 20th-Century Basque immigrant sheepherders unfold across the malleable bark of quaking aspen trees, turning rugged alpine forests into history books. From names and cartoon images to hometown homages and political messages etched in Euskara, E urope's oldest living language , these arborglyphs – tree carvings – offer a quiet glimpse into these often forgotten lives. \"The arborglyphs are a lens through which to understand the Basque immigrant community and sheepherding,\" says Arrieta Baro. Carefully placing a piece of tree trunk in front of me, he directs my attention to its inscription: \"Jesús María El Cano, 26-7.\" Getty Images Immigrant Basque sheepherders left arborglyphs throughout the American west (Credit: Haley…",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0ly36tk.jpg"
  },
  {
    "slug": "smithsonian-latino-gallery-quietly-closes-for-nine-months",
    "title": "Smithsonian Latino Gallery Quietly Closes for Nine Months",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Smithsonian Latino Gallery Quietly Closes for Nine Months Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Trump Administration Smithsonian Latino Gallery Quietly Closes for Nine Months As Trump goes after the institution, a temporary space for the National Museum of the American Latino closed ahead of schedule in preparation for America’s 250th programming. by Isa Farfan August 28, 2025 August 29, 2025 Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . The Molina Family Latino Gallery at the Smithsonian National Museum of American History, which has served as the home of the nascent Latino museum, will stay closed until April 2026. (all images courtesy Felipe Galindo) On Friday morning, August 22, illustrator Felipe Galindo Gómez opened his email to find a note from his friend. “Have you seen this?” the message read, and linked to the White House’s bullet-pointed list targeting Smithsonian artworks and exhibitions . There it was: an image of his 1999 illustration “4th of July from the south border.” Since 2022, Galindo’s work had been reproduced on a label about anti-immigrant prejudice as part of ¡Presente! A Latino History of the United States in the National Museum of American History’s (NMAH) Molina Family Latino Gallery. Over the last three years, the gallery space has served as the temporary location of the nascent National Museum of the American Latino, which is currently facing an uncertain future under the Trump administration. Now, the Molina gallery has quietly closed for the next nine months, Hyperallergic confirmed. After the White House featured his work in its hit list, Galindo, who also goes by the name “Feggo,” said he traveled from New York City to Washington, DC, to see whether it was still…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/felipe.jpg"
  },
  {
    "slug": "adrift-in-betye-saar-s-crepuscular-dreamscape",
    "title": "Adrift in Betye Saar’s Crepuscular Dreamscape",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Adrift in Betye Saar’s Crepuscular Dreamscape Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review Adrift in Betye Saar’s Crepuscular Dreamscape The artist’s site-specific commission at the Huntington makes you feel like you’re floating in space, or suspended underwater. by Jasmine Weber August 28, 2025 August 28, 2025 Installation view of Betye Saar, \"Drifting Toward Twilight\" (2023) (all photos Jasmine Weber/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . SAN MARINO, Calif. — Standing in the gallery of Betye Saar: Drifting Toward Twilight , you are bathed in oceanic, cobalt blue light. The buzz of neon lights drones in the background. It’s hard to say if the temperature has truly dropped, or if it’s psychosomatic, that the atmosphere has cooled your skin just by the power of suggestion. You’re floating in space, or suspended underwater — gravity works differently here. The phases of the moon are painted on the wall in a matte metallic silver, and a small poem by Saar is draped across the wall: “The moon keeps vigil as a lone canoe drifts into a sea of tranquility seeking serenity in the twilight.” In the middle of the room, a long canoe, 17 feet across, sits atop a bed of branches, bramble, and sheets of jagged wood. At either tip of the ship is a watchful eye guiding the raft in both directions. Two sentinels — antiques affixed with antlers — keep watch at each end. Saar has crafted a fantastical scene; you can envision the boat careening upriver, striding forth. The vessel is occupied by bird cages confining animal antlers and seated upon miniature chairs fit only for a toddler — or, perhaps, spirits who…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/IMG_3141-3.jpeg"
  },
  {
    "slug": "world-s-largest-van-gogh-collection-faces-uncertain-future",
    "title": "World’s Largest Van Gogh Collection Faces Uncertain Future",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "World’s Largest Van Gogh Collection Faces Uncertain Future Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News World’s Largest Van Gogh Collection Faces Uncertain Future The artist’s namesake museum in Amsterdam says it will be forced to shutter if the government doesn’t raise its subsidies for sustainability and repairs. by Maya Pontone 17 hours ago August 28, 2025 Exterior of the Van Gogh Museum in Amsterdam (photo courtesy the Van Gogh Museum) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Since 1973, Vincent van Gogh masterpieces including his beloved sunflowers, wistful wheatfields, and self-portraits have been housed in Amsterdam’s Van Gogh Museum. The institution was established via a historic 1962 agreement between the painter’s nephew and the Dutch government to ensure the long-term preservation of hundreds of paintings, drawings, and letters comprising van Gogh’s oeuvre. Now, the museum says that the collection’s future is uncertain, citing a dispute with the Dutch Ministry of Education, Culture and Science (OCW) over the funding for costly maintenance repairs and sustainability efforts mandated by the state. In a legal complaint, the institution claims that the Dutch government is violating its decades-old agreement by refusing to provide sufficient subsidies to cover the cost of the three-year, €104 million (~$121 million) project. Under the Dutch Heritage Act, national museums, including the Van Gogh Museum, the Rijksmuseum, and the Kröller-Müller Museum, receive annual housing subsidies to help them maintain and preserve their collections. But the Van Gogh Museum says that this yearly government funding — currently €8,428,300 (~$9.8 million) — falls short of the more than €11 million (~$12.8 million) needed to help it finance much-needed renovations to its fire and security alarms, climate control system, and internal…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/van-gogh-museum.jpg"
  },
  {
    "slug": "required-reading",
    "title": "Required Reading",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Required Reading Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Community Required Reading Required Reading This week: The ethics of design, Noguchi Museum workers speak out, Native communities on the closure of “Alligator Alcatraz,” Letterboxd woes, music classes in Gaza, and more. by Lakshmi Rivera Amin August 28, 2025 August 28, 2025 The annual Black and White Photo Awards consistently serves as a reminder of the beauty of the form, which Ansel Adams famously preferred (\"With black-and-white I feel free, and confident of results,\" he said, per Ansel Adams in Color ). This year's creativity prize went to Adebayo Rotilu's \"Electric Silhouette,\" a humming composition of laser beams and shadow that feels like a chimera of photography, drawing, and optical illusion. (photo by Adebayo Rotilu, courtesy Black and White Photo Awards ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . ‣ Design is a minefield of ethical dilemmas, incentivizing companies to work with exploitative clients and making it difficult for employees to say no. Elizabeth Goodspeed spoke with a few designers, writing in It’s Nice That : Questions about client ethics are tricky enough when you know exactly who you’re working for. Things get even murkier when work is licensed, resold, or embedded with no direct link between creator and end user. For type designers, this is the norm. Once a font is released, it can surface almost anywhere, often without warning. Jesse Ragan, cofounder of XYZ Type, says custom projects feel relatively straightforward to assess ideologically: if he doesn’t believe in a client, he can simply turn down the work. Retail fonts are a different story. A typeface is made in isolation long before it’s used, and can be licensed…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/b-and-w-adebayo-rotilu.jpeg"
  },
  {
    "slug": "seeing-new-mexico-through-the-looking-glass",
    "title": "Seeing New Mexico Through the Looking Glass",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Seeing New Mexico Through the Looking Glass Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review Seeing New Mexico Through the Looking Glass The 12th SITE Santa Fe International takes reflection as its cue, offering mirror images, doubles, reversals, and echoes in which multiple perspectives and timelines unfold. by Nancy Zastudil August 28, 2025 August 29, 2025 Installation view of Godfrey Reggio, Once Upon a Time (2022) (photo Nancy Zastudil/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . SANTA FE — In 1998, science fiction writer Ted Chiang published “Story of Your Life,” in which aliens come to Earth in “looking glasses,” mirrored spaceships that act as communication devices. The central character, linguist Dr. Louise Banks, is tasked with deciphering the aliens’ language. In turn, she begins to see time like they do — as simultaneous events — and ultimately glimpses her own future. A reference to “Story of Your Life” is tucked into the exhibition guidebook for Once Within a Time , SITE Santa Fe’s 12th International. Curator Cecilia Alemani identified Chiang as one of the exhibition’s 27 “figures of interest” — catalysts for the 71 participating artists and more than two dozen writers. What struck me about Alemani’s inclusion of Chiang’s writing was not the reference to extraterrestrial life (many readers will be familiar with the accounts of UFO sightings in New Mexico), but the surreal, endlessly fascinating phenomenon of the looking glass. Once Within a Time takes reflection as a major cue. Within each curated theme, such as “The Wheel of Telling” and “The Secret Life of Puppets,” are mirror images, doubles, reversals, and echoes, along with symmetries of place, histories, peoples, and legends —…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/SITE3.jpg"
  },
  {
    "slug": "edward-burra-s-satirical-surrealism",
    "title": "Edward Burra’s Satirical Surrealism",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Edward Burra’s Satirical Surrealism Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review Edward Burra’s Satirical Surrealism The painter wanted to experience the shock of strangeness, to embrace the allure of the louche, the forbidden, the disapproved of. by Michael Glover 27 minutes ago August 28, 2025 Edward Burra, \"Cornish Clay Mines\" (1970); Private Collection (all images © The estate of Edward Burra, courtesy Lefevre Fine Art, London, unless otherwise noted) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . LONDON — Edwards Burra was a chronically ill English painter, suffering from debilitating arthritis and asthma throughout much of his life. Hailing from the upper classes of southern England, with regularized, side-parted, tamped-down hair, he spent much of his life in headlong flight from his upbringing. Burra wanted to experience the shock of strangeness, to embrace the allure of the louche, the forbidden, the disapproved of. He sometimes left home for months at a time without even saying goodbye. Where has Edward gone? Nobody knew. Will he ever come back? Perhaps. First it was to Paris, and then to Spain, the United States, and Mexico. As you walk around his carefully curated, chronologically organized exhibition at Tate Britain of the best of a lifetime’s work, you can hear the drift of music in the air, the music Edward loved, the visceral excitement of jazz and how that excitement fed into the work of the Harlem years. You can even see a row of black vinyl discs along the wall. These were Edward’s records. Installation view of records and ephemera in Edward Burra at Tate Britain, London (photo Michael Glover/ Hyperallergic ) Get the latest art news, reviews and opinions from Hyperallergic.…",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/7.-Edward-Burra-Cornish-Clay-Mines-1970-Private-Collection.jpg"
  },
  {
    "slug": "5-underrated-u-s-cities-perfect-for-a-weekend-getaway-this-fall",
    "title": "5 Underrated U.S. Cities Perfect For A Weekend Getaway This Fall",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "5 Underrated U.S. Cities Perfect For A Weekend Getaway This Fall - Travel Off Path Skip to Content Search Search for: Close Search × Home Travel News Traveler Tools 1 Minute Trip Check Entry Requirement Checker Travel Advisory Checker Cancun Resort Finder Cabo Resort Finder About About Us Work With Us Press Contact Us Premium Get Premium Members Only Sign in 5 Underrated U.S. Cities Perfect For A Weekend Getaway This Fall Posted on Last updated: August 31, 2025 0 Comments Posted By: Travel Off Path Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date. The kids are back in school, the long, hazy days of summer are in the rearview mirror, and there’s a new kind of energy in the air. It's that magical time of year when you start thinking about cozy sweaters, crisp autumn air, and that first glorious sip of a pumpkin spice latte. You're holding on to that hope of a perfect weekend fall getaway. Sure, you could book the obvious trip to New York City, but let's be real—you'll be fighting for a patch of grass in Central Park with a million other people. What if you could get all the amazing fall vibes without the crowds? Here at Travel Off Path , we believe the best autumn trips are the ones that fly under the radar. We've found 5 incredible, underrated U.S. cities that are perfect for a quick escape this season. 🍂 ⛰️ Chattanooga, Tennessee The Ultimate Outdoor Adventure Hub While everyone flocks to Nashville or the Smokies, Chattanooga is the smart choice for an active fall weekend. Tucked into the Tennessee River Valley, the city is surrounded by mountains that explode with color in late October. The vibe is laid-back, the hiking is epic, and the views are 10/10. You Have To: Take the incline railway up Lookout Mountain to visit Rock City and Ruby Falls. The panoramic view of seven states is a classic for a reason. For a more chill experience, walk across the vibrant blue Walnut Street Bridge and explore the cool local shops and cafes in the NorthShore district. 🍖 Kansas City, Missouri The Cool & Cultured Midwest Surprise Forget what you think you know about “flyover country.” Kansas City is having a major moment, and fall is the perfect time to visit. This city is a powerhouse of culture, with world-class jazz clubs, a surprisingly hip arts scene, and, of course, the best barbecue on the planet. You…",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/5-Underrated-U.S.-Cities-Perfect-For-A-Weekend-Getaway-This-Fall.jpg"
  },
  {
    "slug": "4-important-tips-for-visiting-cancun-this-fall-according-to-experts",
    "title": "4 Important Tips For Visiting Cancun This Fall According To Experts",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "4 Important Tips For Visiting Cancun This Fall According To Experts - Travel Off Path Skip to Content Search Search for: Close Search × Home Travel News Traveler Tools 1 Minute Trip Check Entry Requirement Checker Travel Advisory Checker Cancun Resort Finder Cabo Resort Finder About About Us Work With Us Press Contact Us Premium Get Premium Members Only Sign in 4 Important Tips For Visiting Cancun This Fall According To Experts Posted on Last updated: August 31, 2025 0 Comments Posted By: Vinicius Costa Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date. Fall is arguably the best period to visit Cancun if you're hoping for smaller crowds and cheaper prices. After all, the July and August crowds are gone, hotels deliberately lower prices to attract more guests, and there are getaway deals galore… or are there? For years now, sun-seekers on a budget have waited impatiently for September to book their Cancun vacay, knowing they would get more bang for their buck, but as the experts have told us in 2025, this may no longer be the case. After all, ‘low' and ‘high' seasons are no longer existing concepts in the Caribbean hub. That's one of 4 things the Cancun Sun , the leading independent English-speaking authority on all things Mayan Riviera, has shared as we head into the (supposedly) quieter months: Cancun's ‘Low Season' Is a Thing of the Past If you're headed for Cancun this upcoming season, the main thing you should know is that those images of a deserted hotel strip, with a wide availability of first-come, first-served restaurants, and open slots on guided tours, may no longer be the case. As they have noted, ‘low season' now looks more like ‘less busy' . There are lower crowds than in winter, that's for sure, but if you're visiting on the weekend, you should expect a major influx of beach bums at public bathing areas, and partygoers to flock into the entertainment district. Long gone are the days you could just ‘chance it' and book stuff last-minute in the fall. Be it trendy restaurants, popular activities, like visiting cenotes or Mayan ruins, or spa appointments at your resort, you'd be wise to secure spots in advance. Who Will You Be Sharing the Resort With? The Cancun Sun also reiterates that, despite the continuous crowding, the type of crowd changes. After all, schools across the United States and Canada have resumed classes, so you can for sure expect to…",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/07/This-Is-How-To-Book-The-Perfect-Hotel-In-Cancun-According-To-Experts.jpg"
  },
  {
    "slug": "move-over-nashville-this-underrated-city-is-tennessee-s-trendiest-fall",
    "title": "Move Over Nashville! This Underrated City Is Tennessee’s Trendiest Fall Destination",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "Move Over Nashville! This Underrated City Is Tennessee's Trendiest Fall Destination - Travel Off Path Skip to Content Search Search for: Close Search × Home Travel News Traveler Tools 1 Minute Trip Check Entry Requirement Checker Travel Advisory Checker Cancun Resort Finder Cabo Resort Finder About About Us Work With Us Press Contact Us Premium Get Premium Members Only Sign in Move Over Nashville! This Underrated City Is Tennessee’s Trendiest Fall Destination Posted on Last updated: August 31, 2025 0 Comments Posted By: Sam Sears Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date. Sorry, Nashville . Broadway lights are dimming this fall in favor of another Tennessee city. As leaves begin to shed and temps begin to drop, the astounding Smokies scenery, neon honky-tonks, and ‘smooooth Tennessee whiskey' are far from the only draw to the “Volunteer State”. Expected to be the state's trendiest fall destination , largely backed by lively festivals and stunning natural attractions, this city is also deeply rooted in intriguing Civil War history, locomotive heritage resulting in scenic train rides , and ample ways to explore the outdoors in the midst of autumn's luminous colors. Chattanooga may not have been on your Bingo card this year, but it's not too late to swap it out for wherever else you had planned. Don't pass up the opportunity to explore perhaps Tennessee's most underrated getaway that will no doubt be overflowing with fall splendor, quintessential Southern charm, and surprisingly luxe stays for a city that's still clinging on to “hidden gem” status. Whiskey River, Take Your Mind Alright, there's no actual “whiskey river” per se, but one can dream, right? But in a state steeped in grandpappy's medicine, it goes without saying Chattanooga can go toe-to-toe with the best bars for a night out. Bar-hopping, as fun as it may be, is nowhere near the only fun thing to do here, despite a buzzing downtown with a mix of college crowds and people like me hanging on to their last sliver of youth. One instantly noticeable enticement to the city is the winding Tennessee River, that is still a blast to visit during the fall. Hop aboard the Southern Belle , a popular riverboat cruise for sunset and general sightseeing tours. If it were me, this would be a priority night one, as it's easily accessible from the city center and a great way to get your bearings. Otherwise, wake up and start your day with a coffee in…",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/Move-Over-Nashville-This-Underrated-City-Is-Tennessees-Trendiest-Fall-Destination-.jpg"
  },
  {
    "slug": "these-are-the-top-5-overnight-sleeper-trains-in-the-u-s-this-fall",
    "title": "These Are The Top 5 Overnight Sleeper Trains In The U.S. This Fall",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "These Are The Top 5 Overnight Sleeper Trains In The U.S. This Fall - Travel Off Path Skip to Content Search Search for: Close Search × Home Travel News Traveler Tools 1 Minute Trip Check Entry Requirement Checker Travel Advisory Checker Cancun Resort Finder Cabo Resort Finder About About Us Work With Us Press Contact Us Premium Get Premium Members Only Sign in These Are The Top 5 Overnight Sleeper Trains In The U.S. This Fall Posted on Last updated: August 30, 2025 0 Comments Posted By: Travel Off Path Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date. In recent years, a slower, more scenic mode of travel has made a huge comeback. Of course, we’re talking about overnight sleeper trains . 🚂 While Europe is buzzing with new night train routes, you might be wondering how you can hop on this trend here in the U.S. Good news: Amtrak is not only running its classic long-distance routes, but it's also in the middle of a massive upgrade, pouring billions into new and refurbished train cars that are hitting the rails right now. Here at Travel Off Path , we believe there’s no better time than fall to try them out. Taking in the stunning U.S. foliage from the comfort of a private room is a bucket-list experience. Based on the latest schedules and what travelers are raving about, here are 5 of Amtrak’s best overnight sleeper train routes for this fall. 💺 Yes, Amtrak Still Runs Sleeper Trains (And They're Getting Better!) Let's clear this up: Amtrak operates multiple long-distance routes with dedicated sleeper cars, and they are actively getting a facelift. These new and updated cars mean better seats, updated interiors, and a more comfortable ride. All of these routes feature private rooms, from the cozy Roomette to the more spacious Bedroom . A Roomette gets you two comfortable seats that convert into beds, while a Bedroom offers more space and includes a private in-room sink, shower, and toilet. No matter which you choose, all sleeper car tickets include your meals in the dining car—a huge perk! to be immune to theme conflicts. - This is the most reliable architecture for your live website. --> Find Your Perfect Fall Train Trip Answer one quick question to get matched with the perfect scenic railway for your autumn adventure. Start Matching What's Your Ideal Fall View? 🏔️ Crossing the Rockies & Sierras 🌊 Hugging the Pacific Coastline 🍂 Winding through the…",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/These-Are-The-Top-5-Overnight-Sleeper-Trains-In-The-U.S.-This-Fall-1.jpg"
  },
  {
    "slug": "5-underrated-destinations-in-mexico-for-a-crowd-free-getaway",
    "title": "5 Underrated Destinations In Mexico For A Crowd-Free Getaway",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "5 Underrated Destinations In Mexico For A Crowd-Free Getaway - Travel Off Path Skip to Content Search Search for: Close Search × Home Travel News Traveler Tools 1 Minute Trip Check Entry Requirement Checker Travel Advisory Checker Cancun Resort Finder Cabo Resort Finder About About Us Work With Us Press Contact Us Premium Get Premium Members Only Sign in 5 Underrated Destinations In Mexico For A Crowd-Free Getaway Posted on Last updated: August 30, 2025 0 Comments Posted By: Sam Sears Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date. Cancun. Cabo. Mexico City. What do these have in common? Global fame often results in mostly unavoidable crowds, unless you venture into the locals' gatekeepers' secret hideaways. At Travel Off Path , we consider ourselves to be Mexico's #1 fans, forging through the often dramatized security concerns and putting them to bed. I alone have been to 19 different destinations across the country with nothing but rave experiences from the ‘dangerous' streets of Tijuana to the little-known shores of Mahahual. So, allow us to be your tour guide this fall by presenting you 5 underrated getaways to avoid jam-packed beaches, anti-tourism protests, and entitled retirees surrounding the swim-up bar. Salud! Aguascalientes 🍷 With direct flights from Dallas, Houston, and LA, reaching one of Mexico's best-kept secrets is easier than you might think. I just got back from Aguascalientes for the first time and quickly developed a crush from the moment I stepped foot in the timeless city center. Let the towering Catedral de Aguascalientes become your North Star for an unforgettable getaway, packed with sensational cuisine, European-esque streets brimming with sidewalk cafes, and perhaps North America's most overlooked countryside vineyards, such as Vinocola Santossca — it's worth the trek! For budget travelers, you'll be hard-pressed to find anywhere cheaper. We're talking $2 museums , $3 lattes, and Uber rides under $5 across the city. And with a name like Aguascalientes, you know you gotta visit the hot springs. Baños Termales de Ojocaliente is a great place to unwind in a vintage bathhouse for under $20. Ixtapa-Zihuatanejo 🏝️ If you're craving Mexico's paradise shores (and who wouldn't?), you likely by default have searched and searched to craft a perfect vacation in Cancun, Cabo, or maybe Puerto Vallarta. I've been guilty of that too, but I also have so many Mexican trips under my belt I have. a leg up on following the crowds, which is why my most recent beach trip South of…",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/5-Underrated-Destinations-In-Mexico-For-A-Crowd-Free-Getaway.jpg"
  },
  {
    "slug": "move-over-rome-this-is-the-top-cultural-destination-in-italy-for-2026",
    "title": "Move Over Rome: This Is The Top Cultural Destination In Italy For 2026",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "Move Over Rome: This Is The Top Cultural Destination In Italy For 2026 - Travel Off Path Skip to Content Search Search for: Close Search × Home Travel News Traveler Tools 1 Minute Trip Check Entry Requirement Checker Travel Advisory Checker Cancun Resort Finder Cabo Resort Finder About About Us Work With Us Press Contact Us Premium Get Premium Members Only Sign in Move Over Rome: This Is The Top Cultural Destination In Italy For 2026 Posted on Last updated: August 30, 2025 0 Comments Posted By: Vinicius Costa Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date. Listen, there's no denying Rome is the most iconic destination in Italy, if not Europe as a whole: it's home to world-renowned landmarks like the Colosseum, the Trevi Fountain, and it even plays host to the Vatican City, so you can't be exactly mad at tourists for flocking there in the first place. Be that as it may, we can't be the only ones who feel the novelty of Rome has far worn off. It has been on the radar of travelers for at least two millennia, and things are only intensifying in the age of social media. We're called Travel Off Path for a reason, though, and as you might have guessed at this point, it's the lesser-known gems that truly pique our interest—and you know, if you happened to be looking for an underrated Italian destination yet to be spoiled by the masses, you've come to the right place : The Italian Capital Of Culture For 2026 Is… Every year, the Italian Ministry of Culture picks out a new ‘Capital of Culture'. In other words, a city that has contributed significantly to the country's cultural tapestry, and that's not necessarily Rome, Florence, or Venice. We've had Pesaro in 2024, Agrigento ( a hidden gem of Sicily ) in 2025, and for 2026, the crown goes to L'Aquila , the much-overlooked capital of Abruzzo, a small Italian region east of Rome, straddling the Adriatic Sea. However, if you're expecting turquoise seas, postcard-ready pebbly beaches, and vibrant beach bars, you might be in for a bit of a surprise. L'Aquila isn't coastal: in fact, it bestrides a hillside in the middle of the Apennine Mountains. With only around 70,000 residents, it's far smaller, more compact than the sprawling cities of Milan or Naples , and unlike these other metropolitan examples, it's not exactly outgrown its original, largely medieval townscape: A Medieval City Surrounded By…",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/Move-Over-Rome-This-Is-The-Top-Cultural-Destination-In-Italy-For-2026.jpg"
  },
  {
    "slug": "the-chaotic-mega-market-feeding-mexico-city",
    "title": "The chaotic mega-market feeding Mexico City",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "From trash to tasting menu: The market that feeds Mexico City's best restaurants Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live From trash to tasting menu: The market that feeds Mexico City's best restaurants 1 day ago Share Save La Carmina Share Save Rey Lopez How Central de Abasto, the world's largest market hidden in Mexico City's so-called \"trash district\", has become the unlikely backbone of its fine-dining revolution. Mexico City's status as one of the world's top culinary capitals is often credited to the creative tasting menus and celebrity chef collaborations found in its upscale Roma Norte neighbourhood. But the flavours served on those affluent, tree-lined streets often begin their journey to the plate at dawn – in a sprawling, chaotic market in one of the city's poorest boroughs. Located in Iztapalapa, Central de Abasto is the largest wholesale market in the world, covering 3.27 sq km – roughly the size of New York City's Central Park – and supplying 80% of the capital's produce. Between 04:00 and 08:00, the sprawl feels like a scene from Blade Runner, with buyers elbowing their way through narrow paths to haggle at thousands of warehouses and slapdash produce stalls. Diableros (hand-truck porters) sprint through the maze of crowds and beeping trucks, careful not to bump into colleagues balancing wooden crates on their heads. Whenever I hear a trilling whistle, I jump aside to let a \"little devil\" race past with a comically overloaded bundle. Central de Abasto opened in 1982 to replace La Merced, CDMX's colonial-era trading centre. Every day, it welcomes half a million visitors and handles more than 30,000 tons of produce from across Mexico. The ramshackle vibe is characteristic of Iztapalapa, historically derided as a \"trash district\" for its landfills and…",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lzqm6f.jpg"
  },
  {
    "slug": "where-americans-are-spending-labor-day-weekend",
    "title": "Where Americans are spending Labor Day Weekend",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "The last hurrah: Where American travellers are spending Labor Day weekend Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live The last hurrah: Where American travellers are spending Labor Day weekend 3 days ago Share Save Lynn Brown Share Save Getty Images New York City's Shakespeare in the Park is back this end-of-summer season (Credit: Getty Images) Seeing Shakespeare in New York, Bright Eyes in Seattle and Roald Dahl's Enormous Crocodile in London – these five destinations are topping lists for the last holiday of summer. For many Americans, Labor Day marks the unofficial end of summer; a long weekend for parades, barbecues and one last getaway before the school year begins. According to the American Automobile Association (AAA), the Transportation Security Administration expects 17.4 million people to travel between 28 August and 3 September, up from 17.2 million last year. Data from travel sites including AAA , Dollar Flight Club and Kayak show that domestic travel is up significantly, likely due to the fact that domestic flights are the cheapest they've been in five years. \"This Labor Day we're seeing one of the biggest splits in pricing we've ever tracked,\" says Jesse Neugarten, founder and CEO of Dollar Flight Club. \"Domestic flights are about 5% lower than last year and nearly 20% lower than 2019. On the flip side, international fares are still sky-high.\" According to Neugarten, international fares are two to three times higher on average, while domestic Labor Day fares are currently at a five-year low, with New York, Seattle and Boston being some of the most affordable US destinations overall. Even so, Americans aren't just staying close to home. There are several international destinations showing up on Labor Day travel hot lists, with Rome and London ranking among the…",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lznqcf.jpg"
  },
  {
    "slug": "france-s-picture-perfect-car-free-islands",
    "title": "France's picture-perfect car-free islands",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "The French Riviera's picture-perfect car-free island escape Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live The French Riviera's picture-perfect car-free island escape 4 days ago Share Save Erin Henk Share Save Getty Images (Credit: Getty Images) A brief ferry ride from the glitz of the French Riviera, the Hyères Islands offer an idyllic escape into protected pine forests, unspoilt beaches – and one of France's most unique communities. The ferry ride from the Giens Peninsula takes just about 15 minutes, but when my feet touch the vehicle-free streets of Porquerolles, the French Riviera's glittering mainland already feels worlds away. Porquerolles is one of the three Hyères Islands (Îles d'Hyères), an archipelago stretching eastward from Giens like an ellipsis in the Mediterranean Sea. While the French Rivera lures visitors with its glamorous resorts and timeless elegance, it's often overrun by traffic and showy crowds. These islands, covered in pine forests and blissfully car-free, offer an unassuming alternative to the glitz of Cannes and Saint-Tropez. Stepping off the ferry, the cacophony of cicadas floods my ears. I'm well-accustomed to this soundtrack of southern France, but I've never heard them at such a pitch – here, no motors cut their hum. The harbour is fringed with pines, palm trees and sunset-coloured houses. Cyclists whirl by, dismounting to stroll down the main thoroughfare, where everyone seems to have an ice cream in hand. Having sat in traffic for hours to enter Saint-Tropez and shoulder-bumped strangers along the crowded lanes of Èze, I've yearned to find an unspoilt corner of the French Rivera – one with thyme-scented breezes and luminous beaches. The Hyères Islands just might be it. Getty Images Porquerolles Island, just 7km across the sea from the French Riviera, is a cyclists' paradise (Credit: Getty…",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lz9p7m.jpg"
  },
  {
    "slug": "how-to-plan-an-extremely-last-minute-trip",
    "title": "How to plan an extremely last-minute trip",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "Forget planning: Three expert tips to take a last-minute break for less Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live Forget planning: Three expert tips to take a last-minute break for less 5 days ago Share Save Lynn Brown Share Save Getty Images With a bit of planning and a lot of flexibility last minute travel deals can still be found (Credit: Getty Images) Being willing to switch when, where and how you travel can still land you affordable trips on a week's notice. It's happened to us all. You go in to work on a Monday morning to find your colleagues gleefully discussing their plans for the upcoming long weekend – the long weekend you completely forgot was coming up. You're desperately in need of a break, but it seems too late to make plans now…. or is it? No need to settle for another weekend in your pyjamas watching The White Lotus for the seventh time. While planning ahead – ideally two weeks or more – is best in terms of both cost and availability, it's still possible to organise a reasonably priced holiday with less than a week's notice. Here are some expert tips on how to do it. Flexibility is key Flights are usually the hardest (and priciest) aspect of a super last-minute trip. \"Airlines tend to increase fares as the flight approaches,\" said Rachel Mumford, UK travel expert at KAYAK . \"So, while booking flights as early as possible is typically the best way to secure deals, that's not always possible.\" Mumford and other experts stressed that flexibility is the key to overcoming this hurdle. \"For travellers booking within the week, flexibility is your superpower,\" Jesse Neugarten, founder and CEO of Dollar Flight Club , told the…",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lyz47b.jpg"
  },
  {
    "slug": "pay-what-you-can-for-a-michelin-starred-meal",
    "title": "'Pay what you can' for a Michelin-starred meal",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "'Eat What You Want, Pay What You Can' at restaurants across Mexico City Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live 'Eat What You Want, Pay What You Can' at restaurants across Mexico City 6 days ago Share Save Lynn Brown Share Save Ana Lorenzana (Credit: Ana Lorenzana) Michelin-starred Masala y Maiz hopes to spread the trend across Mexico and around the world. When Norma Listman and Saqib Keval, owners and chefs at one of Mexico City's most popular restaurants, Masala y Maiz, won their first Michelin star, they were in New York City at a party for a fellow chef. \"Our team was calling us, and we weren't answering the phone,\" explains Listman with a laugh. \"And then the nerdiest of our managers, the most serious one calls, and I was like, he never calls unless something is wrong. Turns out that we were live on the stage [at the Michelin awards].\" The couple, known for establishing the restaurant's groundbreaking \"Eat What You Want, Pay What You Can\" initiative, is much more passionate about supporting community than prestigious accolades. Spending time celebrating a fellow chef they admire instead of attending an awards ceremony in honour of themselves is much more in Listman and Keval's wheelhouse. Ana Lorenzana For husband and wife Norma Listman and Saqib Keval, community was the main impetus behind expanding the \"Eat What You Want, Pay What You Can\" initiative (Credit: Ana Lorenzana) Take, for example, the pay-what-you-can model that has made Masala y Maiz so popular. Several times a year, restaurant-goers are offered a menu of the restaurant's signature Mexican, African and Indian-fusion dishes alongside an envelope in which to leave whatever payment they have available or deem acceptable. There is no bill and no reservations, guests…",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lyzlkq.jpg"
  },
  {
    "slug": "a-local-s-guide-to-the-best-wings-in-buffalo",
    "title": "A local's guide to the best wings in Buffalo",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "The Wing King's guide to the best wings in Buffalo Skip to content Watch Live British Broadcasting Corporation Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Home News Israel-Gaza War War in Ukraine US & Canada UK UK Politics England N. Ireland N. Ireland Politics Scotland Scotland Politics Wales Wales Politics Africa Asia China India Australia Europe Latin America Middle East In Pictures BBC InDepth BBC Verify Sport Business Executive Lounge Technology of Business Future of Business Innovation Technology Science & Health Artificial Intelligence AI v the Mind Culture Film & TV Music Art & Design Style Books Entertainment News Arts Arts in Motion Travel Destinations Africa Antarctica Asia Australia and Pacific Caribbean & Bermuda Central America Europe Middle East North America South America World’s Table Culture & Experiences Adventures The SpeciaList Earth Natural Wonders Weather & Science Climate Solutions Sustainable Business Green Living Audio Podcast Categories Radio Audio FAQs Video Live Live News Live Sport Home News Sport Business Innovation Culture Arts Travel Earth Audio Video Live Weather Newsletters Watch Live The Wing King's guide to the best wings in Buffalo 7 days ago Share Save Teja Lele Share Save Jalen Wright (Credit: Jalen Wright) National Buffalo Wing Festival founder Drew Cerza has made it his mission to promote his hometown's iconic dish. Here are what he deems the best wings in town. Born and raised in the city of Buffalo, New York, Drew Cerza is a passionate ambassador for his hometown's eponymous dish: the Buffalo wing. The SpeciaList Drew Cerza, Buffalo, NY's \"Wing King\", is the founder of the National Buffalo Wing Festival , and co-creator of the Buffalo Wing Trail ; a self-guided tour through 14 storied wing joints. A tireless ambassador for Buffalo wings, he has been featured on Food Network and the Travel Channel. Whether he's judging competitions, promoting local eateries or handing out hot wings in a chicken suit, Cerza has one mission: to give wings the global spotlight they deserve. (Credit: Jalen Wright) \"Fiery, crisp and delicious, the Buffalo wing is an American culinary icon,\" says Cerza, better known as the \" Wing King \". \"It's more than bar food; it's the centrepiece of festivals, Super Bowl parties and food challenges, showcasing our love of bold flavour and communal eating.\" Buffalo wings – chicken (not buffalo) wings doused in a mixture of Frank's Red Hot sauce and melted butter – were created serendipitously at the city's Anchor Bar in the 1960s, where the tangy, spicy combination, served with celery sticks and blue cheese dressing, was an instant hit. \"In time, the bar's late-night improvisation became a game-day staple – and a global phenomenon,\" says Cerza. While spicy chicken wings…",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lycczm.jpg"
  },
  {
    "slug": "the-artist-whose-fauci-portraits-enraged-the-white-house",
    "title": "The Artist Whose Fauci Portraits Enraged the White House",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Artist Whose Fauci Portraits Enraged the White House Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Features Trump Administration The Artist Whose Fauci Portraits Enraged the White House Hugo Crosthwaite, whose stop-motion animation about the scientist was targeted by the Trump administration, talks to Hyperallergic about the work’s backstory. by Isa Farfan 5 hours ago August 29, 2025 A still from Hugo Crosthwaite's commissioned portrait of Dr. Anthony Fauci (all images courtesy Hugo Crosthwaite) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . In 2019, Hugo Crosthwaite became the first Latino artist to win the Smithsonian National Portrait Gallery’s (NPG) prestigious triennial Outwin Boochever Portrait Competition. The Tijuana-born and San Diego-based illustrator received the contest’s grand prize: $25,000 and a portrait commission for the museum’s permanent collection. He chose to depict Anthony Fauci, then the director of the National Institute of Allergy and Infectious Diseases (NIAID), in a stop-motion format that captures the nuances of his complicated legacy, including his criticized and then celebrated oversight of the HIV/AIDs epidemic. Last week, Crosthwaite found his hard-won commission on a list of Smithsonian items that the White House found objectionable. He was one of at least three Mexican-born artists whose work was included on Trump’s art hit list , along with illustrator Rigoberto González and painter Felipe Galindo Gómez . “My first reaction was surprise,” Crosthwaite shared in an interview with Hyperallergic. “But then later on, [I] felt a bit of pride to be included in this list of other wonderful artists and wonderful projects that talk about the diversity of the United States’ history.” Hugo Crosthwaite was born in Tijuana and now lives in San Diego. In 2022, after winning the Outwin…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/whitehousefauci.jpeg?fit=2140%2C1610&quality=90&ssl=1"
  },
  {
    "slug": "the-shocking-allure-of-erotic-abstraction",
    "title": "The Shocking Allure of Erotic Abstraction",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Shocking Allure of Erotic Abstraction Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review The Shocking Allure of Erotic Abstraction A show on Louise Bourgeois, Eva Hesse, and Alice Adams gives a sense of how different, even alarming, these pieces would have been to viewers in the 1960s. by Olivia McEwan 5 hours ago August 29, 2025 Alice Adams, \"Sheath\" (1964) (© Howcroft Photography, Boston; photo courtesy the Courtauld, all other photos Olivia McEwan/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . LONDON — Some of the Courtauld’s previous exhibitions have suffered from insufficient curation . Abstract Erotic: Louise Bourgeois, Alice Adams, Eva Hesse , on the other hand, strikes the exact right balance. Drawing on scholar Jo Applin’s research, curator Alexandra Gerstein has taken as a starting point the work of feminist curator and critic Lucy Lippard, who coined the titular term to describe this sensuous s trand of art emerging in 1960s New York. Making perhaps the best use yet of the Courtauld’s teeny exhibition spaces next to the permanent collection, this small but unstuffed show gives proper breathing space for artistic dialogue and, crucially, for the viewer to engage in exploring differences and similarities between works and practices for themselves. In 1966, Lippard curated the exhibition Eccentric Abstraction to capture a new wave of sculptures created from unusual, pliable materials like wire, plastic mesh, netting, and latex, which evoked tactile organic forms and, by extension, the human body. This is the Courtauld’s first show devoted to standalone sculpture, and the contrast between these blob-like forms and its Impressionist-heavy permanent collection may go some way to recreate just how different — even alarming — these…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/eed0c-scaled.jpeg?fit=2560%2C2113&quality=90&ssl=1"
  },
  {
    "slug": "reclaiming-a-whitewashed-history-of-the-great-depression",
    "title": "Reclaiming a Whitewashed History of the Great Depression",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Reclaiming a Whitewashed History of the Great Depression Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Features Previews Reclaiming a Whitewashed History of the Great Depression A new exhibition focuses on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, and Ben Shahn. by Monica Uszerowicz 5 hours ago August 29, 2025 Russell Lee, \"Son of sharecropper in window of old home, Southeast Missouri Farms\" (1938/ 2024) (all photos courtesy Art Bridges) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . When the United States Department of Agriculture established the Farm Security Administration (FSA) in 1937, hoping to provide aid to rural communities affected by the Great Depression, it also implemented a photography project headed by government official Roy Stryker. The photographs were meant to generate support for the agency, allowing the public to witness the impacts of the Depression for themselves. Made by recruited photographers and then selected by Stryker for inclusion in traveling exhibitions and news outlets, the chosen images overwhelmingly depicted White families — a narrow and literally whitewashed view of rural America. Crafting Sanctuaries: Black Spaces of the Black Great Depression South , a new exhibition at the Museum of Art and Light in Manhattan, Kansas, showcases a broader view of FSA imagery, focusing on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, Russell Lee, Marion Post Wolcott, Arthur Rothstein, Ben Shahn, and Jack Delano across six states: Alabama, Georgia, Louisiana, Florida, Mississippi, and Missouri. Presented in partnership with Art Bridges Foundation, the photos highlight the intimacy of life among one’s community — private quarters, public gathering spaces — and the care taken to build one together. The exhibition, curator Tamir Williams told Hyperallergic ,…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/dzNBe-scaled.jpeg?fit=2560%2C1843&quality=90&ssl=1"
  },
  {
    "slug": "art-dealers-get-candid-ahead-of-the-armory-show",
    "title": "Art Dealers Get Candid Ahead of the Armory Show",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Art Dealers Get Candid Ahead of the Armory Show Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Art Dealers Get Candid Ahead of the Armory Show Amid market unease and slimmer blue-chip participation, some galleries see an opportunity to cultivate collectors at the mammoth Manhattan fair. by Aaron Short 5 hours ago August 29, 2025 Visitors navigate the labyrinthine booths of the 2024 Armory Show (photo Valentina Di Liscia/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Joe Amrhein and Susan Swenson were going to sit out the Armory Show this fall for the first time in a quarter century until they got a call last month from the fair’s director. The owners of Pierogi Gallery in Brooklyn’s Williamsburg neighborhood initially did not apply this year due to the show’s rising booth costs, which can exceed tens of thousands of dollars. Pierogi is planning the next phase of its business, which could include relocating to Lower Manhattan . But Armory executives Kyla McMillan and J. Tyler Woodall appealed to Pierogi and the fair’s shared history — in 2016, Amrhein suggested the Armory use an empty space to display Jonathan Schipper’s installation of a Volkswagen Golf crashing into a wall; the presentation of large-scale art has since become a cornerstone of the show. They recently negotiated a smaller exhibition space for Pierogi with a lower rate, enabling the gallery to return. “We had been on the fence about it since the economy is very uncertain and it’s a big investment,” Swenson said. “We’re not one of the big box galleries. Some of them have their own economies now.” Get the latest art news, reviews and opinions from Hyperallergic. Daily…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/armory.jpg?fit=2355%2C1864&quality=90&ssl=1"
  },
  {
    "slug": "facing-15m-budget-deficit-calarts-lays-off-workers",
    "title": "Facing $15M Budget Deficit, CalArts Lays Off Workers",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Facing $15M Budget Deficit, CalArts Lays Off Workers Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Facing $15M Budget Deficit, CalArts Lays Off Workers Faculty and union members are questioning the staff cuts, arguing that they will harm the school’s ability to nurture the next generation of artists. by Aaron Short August 29, 2025 August 30, 2025 California Institute of the Arts (photo by Bobak Ha'Eri, via Wikimedia Commons, CC BY 3.0 ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . A round of layoffs at the California Institute of the Arts (CalArts) this summer is raising alarms at one of the best-known arts schools in the country as the institution grapples with rising costs. The Santa Clarita-based private arts school laid off nine administrative employees in July, including five unionized workers and four non-union workers, claiming in a schoolwide message that CalArts needed to cut expenses in the face of a projected $15 million deficit . “The nine staff positions, as well as about a dozen vacant staff positions, are being eliminated as part of a necessary workforce reduction, which will enable CalArts to address a structural deficit, prioritize student-facing services, and better align our staffing with current and projected enrollments to continue providing exceptional educational opportunities to our students,” a CalArts spokesperson told Hyperallergic . But faculty and staff members are questioning the administration’s decision, arguing that the layoffs could harm the school’s ability to train and nurture the next generation of artists. Get the latest art news, reviews and opinions from Hyperallergic. Daily Weekly Opportunities Sign up “Everyone was disappointed in this having to happen at all when we’re working so hard to try to better serve…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/1620px-2012-1104-CalArts01.jpg?fit=1620%2C1080&quality=90&ssl=1"
  },
  {
    "slug": "the-2025-ny-art-book-fair-returns-to-moma-ps1",
    "title": "The 2025 NY Art Book Fair Returns to MoMA PS1",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The 2025 NY Art Book Fair Returns to MoMA PS1 Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Announcement The 2025 NY Art Book Fair Returns to MoMA PS1 This year’s fair features over 250 local and international artists’ book publishers, alongside a full weekend of programs and performances from September 11 through 14. by Printed Matter, Inc. August 29, 2025 August 28, 2025 2019 NY Art Book Fair (photo Megan Mack) Initiated in 2006, the NY Art Book Fair (NYABF) is a celebration and international gathering for artists’ book publishers to distribute their work, connect with broad audiences, and nurture new and longstanding relationships. This year’s fair marks an exciting and long-awaited return to MoMA PS1 , Printed Matter’s venue partner from 2009–2019, a pivotal decade in expanding the fair’s reach and impact, establishing NYABF as a cornerstone for the distribution of artists’ books and the preeminent gathering point for celebrating the form. This partnership also exemplifies a shared commitment to creating spaces where audiences can engage with new ideas and perspectives, while reaffirming Printed Matter’s core mission dedicated to the dissemination, understanding, and appreciation of artists’ books. NYABF 2025 takes place from Thursday, September 11, through Sunday, September 14, and will feature a wide range of interdisciplinary artistic practices, including self-publishing artists, collectives, small presses, institutions, rare and out-of-print book dealers, and art book distributors. With each fair, Printed Matter continues to foreground programs that address the present moment, while also working to increase awareness around artists’ books by providing various access points for visitors to engage with printed material in enriching and discursive ways. This upcoming iteration of the fair includes special projects and installations by Boo-Hooray, Bread & Puppet Press, Corraini Edizioni, Hat & Beard Press, Special Special and 4N, Three Star Books, and an exhibition of archival material from The Detroit Printing Co-op. Two new screen-printed artist editions, “Untitled” (2025) by Huma Bhabha and “The 2nd Merlyn” (2025) by Richard Tuttle, will also be released during the fair. Join Printed Matter on Thursday, September 11, from 7–10 PM for the Opening Night celebration, with music from Lydo, Sydney Spann, and voyeur. The first five hundred guests will also receive a limited ticket edition by Lyric Shen. To learn more, visit pmabf.org…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/megan-mack-185915-1-1-scaled.jpg?fit=2560%2C1707&quality=90&ssl=1"
  }
]