[
  {
    "slug": "an-impressionist-s-ode-to-male-sensuality",
    "title": "An Impressionist’s Ode to Male Sensuality",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "An Impressionist's Ode to Male Sensuality Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic…",
    "bodyHtml": "<p>An Impressionist's Ode to Male Sensuality Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review An Impressionist’s Ode to Male Sensuality A retrospective of the work of Gustave Caillebotte illuminates the painter’s radical focus on the male form and the lives of men. by Debra Brehmer 48 seconds ago August 29, 2025 Gustave Caillebotte, \"Self-Portrait at the Easel\" (1879); Private Collection, France (photo © Caroline Coyner Photography) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member .</p>\n<p>CHICAGO — The Impressionist artists working in France in the 1800s clearly liked women.</p>\n<p>While landscapes and still lifes studded their oeuvres, they turned repeatedly to the subjects of dancers, opera singers, boaters, bathers, strollers, book readers, barmaids, and picturesque, rosy-cheeked gals in fashionable gowns and big hats.</p>\n<p>Male painters found the female form not only tantalizing but a symbol of modernity, as women explored new social access and fashions.</p>\n<p>They felt that being artists gave them license to peer (or leer).</p>\n<p>Only recently have art historians shed light on another, lesser-known Impressionist artist, Gustave Caillebotte, whose contrarian gaze primarily focused on men and the male body.</p>\n<p>A major exhibition of his work that originated at the Musée d’Orsay in Paris is now on view at the Art Institute of Chicago.</p>\n<p>The midwestern museum choose to change the show’s title from the original Gustave Caillebotte: Painting Men to the less definitive Gustave Calllibotte: Painting His World .</p>\n<p>Both are apt.</p>\n<p>The show, to its credit, does not speculate on Caillebotte’s sexuality, but rather floats intrigue: Why did this artist choose to focus on the male body?</p>\n<p>The question teases the viewer by way of wall labels that identify his models as bachelors and note that he lived out of wedlock with a woman, with little known about the nature of their relationship.</p>\n<p>She is listed as “friend” in census data.</p>\n<p>The show charts Caillebotte’s path from Paris haute bourgeois life to a country home along the Seine where a coterie of male friends frequently visited.</p>\n<p>Here, plein-air painting, yachting, and gardening occupied him until his death at age 45.</p>\n<p>These facts function to keep the audience scrutinizing the paintings like detectives searching for evidence of homoerotic desire (or not).</p>\n<p>The AIC’s Gloria Groom, who co-curated the show, stated declaratively in the French newspaper Le Figaro , “His subject matter is radical during the time because men were not supposed to stare at men, and he’s staring at men.” Gustave Caillebotte, “Man at His Bath” (1884); Museum of Fine Arts, Boston (photo © 2025 Museum of Fine Arts, Boston) Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up The most riveting painting in the exhibition, “Man at his Bath” (1884), portrays a well-built, naked man from the back as he towels his upper torso.</p>\n<p>His pale buttocks are tinged with pink after the hot soak.</p>\n<p>The masculine stance of splayed feet allows for the painterly definition of each leg.</p>\n<p>A night shirt or towel occupies the floor in the foreground with his shoes near a chair holding folded clothing.</p>\n<p>Wet footprints mark his trail, bringing an immediacy to the scene.</p>\n<p>Compare this to Edgar Degas’s many female bathers, who bend,…</p>",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Self-Portrait-at-the-Easel.jpg?fit=2500%2C1910&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1037994/gustave-caillebotte-impressionist-ode-to-male-sensuality/",
    "sourceName": "hyperallergic.com",
    "author": "Debra Brehmer"
  },
  {
    "slug": "the-rise-of-contemporary-art-puzzles",
    "title": "The Rise of Contemporary Art Puzzles",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Rise of Contemporary Art Puzzles Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic…",
    "bodyHtml": "<p>The Rise of Contemporary Art Puzzles Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Features The Rise of Contemporary Art Puzzles A handful of independent jigsaw companies are bringing art by living artists into a playful new medium. by Aaron Short 6 seconds ago August 29, 2025 A puzzle of Tim Okamura’s painting “Rosie No. 1” (2016) produced by Apostrophe (photo by and courtesy Wesley Volcy; all other photos Aaron Short/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member .</p>\n<p>When Rami Metal walks through the scores of booths at the Armory Show, he looks not only for attention-grabbing paintings but also those that would make great puzzles. “I try to find things that are more detailed and have more variance of color,” he said. “If you have 1,000 pieces and 200 of them are pieces of sky, it’s not fun.</p>\n<p>You’ll get through 80 percent of the puzzle and say, ‘Ugh, the sky.’” Museum gift shops have sold puzzle sets of Impressionist and abstract masterworks for years, but there have been few options on the market featuring works by living artists who haven’t yet had their MoMA retrospective.</p>\n<p>That’s starting to change.</p>\n<p>A handful of independent jigsaw companies, including Metal’s Kinstler Puzzles and Apostrophe Puzzles , have been licensing the work of painters virtually unknown outside the art world for their brainteasers.</p>\n<p>Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up Rami Metal started Kinstler Puzzles in August 2021 after realizing there were few contemporary art puzzles in the market.</p>\n<p>Apostrophe founder Mandi Masden was inspired to launch her Brooklyn-based puzzle company in 2019 after she came across a portrait by artist Charly Palmer that was outside her budget.</p>\n<p>Her friend gave her a custom puzzle of the artwork instead, prompting her to think about how puzzles could make contemporary art more accessible to the public. “I was really into puzzles as a kid, and I knew a lot of us had memories of them from our childhoods, but the industry itself felt stuck in the past,” Masden said. “I wanted to make puzzles that focused on celebrating the talent, creativity, and perspective of artists of color, while catering to a segment of the market largely ignored by the industry.” Metal, also a passionate puzzler, found himself fitting together tiny cardboard pieces of Pieter Bruegel’s “The Tower of Babel” (c. 1563) and Hieronymus Bosch’s “The Garden of Earthly Delights” (c. 1490–1510) for hours at a time well into adulthood.</p>\n<p>It was while he gallery-hopped in Chelsea and breezed through art fairs that he realized that the worlds of art puzzles and contemporary art rarely overlapped, and became inspired to combine them.</p>\n<p>Pitching the idea of producing puzzles out of contemporary art to galleries and artists before he actually launched his business was harder.</p>\n<p>But Washington-based artist Andrea Joyce Heimer liked the concept, and licensed a rendition of her 2019 painting, “In The Summer We Started Drinking During The Hot Of The Day And By Night Time We Were Monsters.” He launched Kinstler in 2021 with two additional puzzles by artists Simone Johnson and Rusudan Khizanishvili.</p>\n<p>Kinstler released a puzzle of artist Ken Gun…</p>",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/kItut-scaled.jpeg?fit=2560%2C1706&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1037461/the-rise-of-contemporary-art-puzzles/",
    "sourceName": "hyperallergic.com",
    "author": "Aaron Short"
  },
  {
    "slug": "i-never-was-a-graffiti-artist",
    "title": "I Never Was a Graffiti Artist",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "I Never Was a Graffiti Artist Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic…",
    "bodyHtml": "<p>I Never Was a Graffiti Artist Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Comics I Never Was a Graffiti Artist Revisiting my teenage years working for artists Freedom and Crash and renovating Keith Haring’s Pop Shop, I wrestle with the ironies of parenting as my son takes up tagging. by Jesse Lambert 1 minute ago August 29, 2025 Share using Native tools Share Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Graffiti Jesse Lambert Jesse Lambert is an artist based in, Queens, NY.</p>\n<p>He makes nonfiction comics about art, politics, public health, travel, and his unconventional childhood.</p>\n<p>He is currently working on a graphic memoir about...</p>\n<p>More by Jesse Lambert Leave a comment Cancel reply Only Members may post a comment.</p>\n<p>If you already have a membership, then sign in .</p>\n<p>Become a member now.</p>\n<p>Most Popular The Artist Whose Fauci Portraits Enraged the White House Reclaiming a Whitewashed History of the Great Depression The Shocking Allure of Erotic Abstraction Art Dealers Get Candid Ahead of the Armory Show An Ancient Roman Guide to Trump’s Authoritarian Playbook The Latest The Rise of Contemporary Art Puzzles A handful of independent jigsaw companies are bringing art by living artists into a playful new medium. by Aaron Short The Fetishistic Fiction of Museum “Tibetan” Shrines Institutions peddle a Western aesthetic of “traditional” Tibetan shrines without scholarly backing, negating their limitless lived variety. by Melissa R.</p>\n<p>Kerin Announcement The 2025 NY Art Book Fair Returns to MoMA PS1 This year’s fair features over 250 local and international artists’ book publishers, alongside a full weekend of programs and performances from September 11 through 14.</p>\n<p>The Artist Whose Fauci Portraits Enraged the White House Hugo Crosthwaite, whose stop-motion animation about the scientist was targeted by the Trump administration, talks to Hyperallergic about the work’s backstory. by Isa Farfan The Shocking Allure of Erotic Abstraction A show on Louise Bourgeois, Eva Hesse, and Alice Adams gives a sense of how different, even alarming, these pieces would have been to viewers in the 1960s. by Olivia McEwan Reclaiming a Whitewashed History of the Great Depression A new exhibition focuses on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, and Ben Shahn. by Monica Uszerowicz Art Dealers Get Candid Ahead of the Armory Show Amid market unease and slimmer blue-chip participation, some galleries see an opportunity to cultivate collectors at the mammoth Manhattan fair. by Aaron Short Announcement UT Austin’s Harry Ransom Center Provides Funded Fellowships in the Arts and Humanities The humanities library and museum will award up to 50 fellowships to support scholars, artists, and writers conducting on-site archival research.</p>\n<p>Facing $15M Budget Deficit, CalArts Lays Off Workers Faculty and union members are questioning the staff cuts, arguing that they will harm the school’s ability to nurture the next generation of artists. by Aaron Short Smithsonian Latino Gallery Quietly Closes for Nine Months As Trump goes after the institution, a temporary space for the National Museum of the American Latino closed ahead of schedule in preparation for America’s 250th programming. by Isa Farfan Facebook Instagram LinkedIn Hyperallergic is a forum for serious, playful, and radical thinking about art in the world today.</p>\n<p>Founded in 2009, Hyperallergic is headquartered in Brooklyn, New York.</p>\n<p>Home Latest Podcast About Contact Us Advertise Jobs Submissions My Account Membership Newsletters Donate © 2025 Hyperallergic Powered by Newspack Privacy Policy Sign in Close Sign in with Google Or Enter the code sent to your email.</p>\n<p>Email address Enter your password Sign in by entering the code we sent to , or clicking the magic link in the email.</p>\n<p>Continue Resend code Email me a one-time code instead Forgot password Create…</p>",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/09/JL_graffiti.jpg?fit=1200%2C900&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1029597/i-never-was-a-graffiti-artist/",
    "sourceName": "hyperallergic.com",
    "author": "Jesse Lambert"
  },
  {
    "slug": "the-fetishistic-fiction-of-museum-tibetan-shrines",
    "title": "The Fetishistic Fiction of Museum “Tibetan” Shrines",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Fetishistic Fiction of Museum “Tibetan” Shrines Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content…",
    "bodyHtml": "<p>The Fetishistic Fiction of Museum “Tibetan” Shrines Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Opinion The Fetishistic Fiction of Museum “Tibetan” Shrines Institutions peddle a Western aesthetic of “traditional” Tibetan shrines without scholarly backing, negating their limitless lived variety. by Melissa R.</p>\n<p>Kerin 16 seconds ago August 29, 2025 The \"Tibetan Buddhist Shrine Room\" at the Smithsonian Institute’s National Museum of Asian Art in Washington, DC, assembled by Alice S.</p>\n<p>Kandell (all photos Melissa R.</p>\n<p>Kerin/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member .</p>\n<p>If American museums were the only source of information about Tibetan Buddhist shrines, one would come away with the impression that shrines are elaborate, pristine environments layered with thangka paintings and silken finery amidst rows of statuary and ritual objects organized atop beautifully crafted wooden furniture.</p>\n<p>Enveloped by recordings of soft Buddhist chanting and illuminated by flickering LED butter lamps, the shrine rooms of the former Rubin Museum of Himalayan Art in New York and the Smithsonian’s National Museum of Asian Art in Washington, DC suspend visitors in a sumptuous, carefully curated environment.</p>\n<p>To this end, curators have intentionally omitted labels or didactics, ostensibly to preserve the viewer’s contemplative experience.</p>\n<p>Touted as “ magnificent ” and seen as a “ refuge in uncertain times ,” these immersive spaces have long captivated the public and media alike.</p>\n<p>But what if these beloved spaces, attracting thousands of visitors each year, are just sites of appropriation — of both tangible and intangible cultural heritage?</p>\n<p>In light of the Brooklyn Museum of Art’s recent opening of its six-year loan of the Rubin Museum’s Tibetan Buddhist Shrine Room, I think the question is worth reexamining.</p>\n<p>The sensory-immersive “Tibetan Buddhist Shrine Rooms” popular in American museums since 2010 differ markedly from their predecessors of the 1930s and ’40s, when institutions such as the Newark Museum of Art in New Jersey and the Jacques Marchais Museum of Tibetan Art in Staten Island displayed modest altars featuring Tibetan Buddhist devotional objects.</p>\n<p>Collector Alice Kandell first promoted the immersive shrine experience when she gifted a collection of over 220 Tibetan Buddhist objects to the Arthur M.</p>\n<p>Sackler Gallery of the Smithsonian.</p>\n<p>In a 2013 essay in Art of Merit , Kandell writes about this gift and her collecting practices, claiming that she “wanted the shrine to be as authentic as it would have been in Tibet.” A quotation from Smithsonian curator Debra Diamond notes the restrictions that came with Kandell’s gift, such as the “long-term display of the objects within a liturgically appropriate and distinctly separate shrine room gallery” (emphasis added), which the Smithsonian obliged.</p>\n<p>In 2010, the Rubin Museum of Art (RMA) accepted a loan of Kandell’s “shrine”; in 2013, it created its own version and kept it on view until 2024.</p>\n<p>Kandell shrines have also been displayed at the Michael C.</p>\n<p>Carlos Museum at Emory University (2016) and gifted to the Minneapolis Institute of Art .</p>\n<p>The Rubin Museum of Art’s “Tibetan Buddhist Shrine Room” in February 2025 The Rubin Museum of Art’s “Tibetan Buddhist Shrine Room” in February 2025 Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up In these aforementioned displays, the “shrines”…</p>",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/7_1.jpg?fit=2400%2C1800&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038180/the-fetishistic-fiction-of-museum-tibetan-shrines/",
    "sourceName": "hyperallergic.com",
    "author": "Melissa R. Kerin"
  },
  {
    "slug": "the-artist-whose-fauci-portraits-enraged-the-white-house",
    "title": "The Artist Whose Fauci Portraits Enraged the White House",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Artist Whose Fauci Portraits Enraged the White House Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip…",
    "bodyHtml": "<p>The Artist Whose Fauci Portraits Enraged the White House Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Features Trump Administration The Artist Whose Fauci Portraits Enraged the White House Hugo Crosthwaite, whose stop-motion animation about the scientist was targeted by the Trump administration, talks to Hyperallergic about the work’s backstory. by Isa Farfan 23 hours ago August 29, 2025 A still from Hugo Crosthwaite's commissioned portrait of Dr.</p>\n<p>Anthony Fauci (all images courtesy Hugo Crosthwaite) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member .</p>\n<p>In 2019, Hugo Crosthwaite became the first Latino artist to win the Smithsonian National Portrait Gallery’s (NPG) prestigious triennial Outwin Boochever Portrait Competition.</p>\n<p>The Tijuana-born and San Diego-based illustrator received the contest’s grand prize: $25,000 and a portrait commission for the museum’s permanent collection.</p>\n<p>He chose to depict Anthony Fauci, then the director of the National Institute of Allergy and Infectious Diseases (NIAID), in a stop-motion format that captures the nuances of his complicated legacy, including his criticized and then celebrated oversight of the HIV/AIDs epidemic.</p>\n<p>Last week, Crosthwaite found his hard-won commission on a list of Smithsonian items that the White House found objectionable.</p>\n<p>He was one of at least three Mexican-born artists whose work was included on Trump’s art hit list , along with illustrator Rigoberto González and painter Felipe Galindo Gómez . “My first reaction was surprise,” Crosthwaite shared in an interview with Hyperallergic. “But then later on, [I] felt a bit of pride to be included in this list of other wonderful artists and wonderful projects that talk about the diversity of the United States’ history.” Hugo Crosthwaite was born in Tijuana and now lives in San Diego.</p>\n<p>In 2022, after winning the Outwin competition, Crosthwaite and the NPG considered a list of individuals for a portrait.</p>\n<p>They agreed on Fauci as the commission’s subject.</p>\n<p>At the time, the infectious disease specialist was a polarized figure: a revered pandemic hero and a detested political opponent of the right.</p>\n<p>Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up “I jumped at the chance of doing this because it was 2022, we were in the middle of the COVID-19 pandemic,” Crosthwaite told Hyperallergic . “He became a symbol of this fight between science and truth, against conspiracy theories; Dr.</p>\n<p>Fauci kind of epitomizes the nation’s current political divide.” The five-minute stop motion animation, “A Portrait of Dr.</p>\n<p>Anthony Fauci” (2022), begins by portraying him as a young scientist in a lab.</p>\n<p>Later, a man infected by an unnamed virus becomes emaciated until he disappears into a black hole that morphs into a scene from ACT UP protests.</p>\n<p>Men carry signs that read “Silence = Death” and “Killed by the System.” Behind them, skeletons look to the sky.</p>\n<p>Still from “A Portrait of Dr.</p>\n<p>Anthony Fauci” (2022) The artwork references the AIDs memorial quilt before transitioning into a segment about the COVID-19 pandemic, in which a woman’s lungs explode into tiny bits of paper.</p>\n<p>Fauci is portrayed next to the White House press briefing room podium, where he often gave virus updates alongside Trump.</p>\n<p>Crosthwaite included a thumbs-up icon moving erratically up and down behind the podium, and Fauci off to…</p>",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/whitehousefauci.jpeg?fit=2140%2C1610&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038060/hugo-crosthwaite-artist-whose-fauci-portraits-enraged-the-white-house/",
    "sourceName": "hyperallergic.com",
    "author": "Isa Farfan"
  },
  {
    "slug": "the-shocking-allure-of-erotic-abstraction",
    "title": "The Shocking Allure of Erotic Abstraction",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Shocking Allure of Erotic Abstraction Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic…",
    "bodyHtml": "<p>The Shocking Allure of Erotic Abstraction Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review The Shocking Allure of Erotic Abstraction A show on Louise Bourgeois, Eva Hesse, and Alice Adams gives a sense of how different, even alarming, these pieces would have been to viewers in the 1960s. by Olivia McEwan 23 hours ago August 29, 2025 Alice Adams, \"Sheath\" (1964) (© Howcroft Photography, Boston; photo courtesy the Courtauld, all other photos Olivia McEwan/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member .</p>\n<p>LONDON — Some of the Courtauld’s previous exhibitions have suffered from insufficient curation .</p>\n<p>Abstract Erotic: Louise Bourgeois, Alice Adams, Eva Hesse , on the other hand, strikes the exact right balance.</p>\n<p>Drawing on scholar Jo Applin’s research, curator Alexandra Gerstein has taken as a starting point the work of feminist curator and critic Lucy Lippard, who coined the titular term to describe this sensuous s trand of art emerging in 1960s New York.</p>\n<p>Making perhaps the best use yet of the Courtauld’s teeny exhibition spaces next to the permanent collection, this small but unstuffed show gives proper breathing space for artistic dialogue and, crucially, for the viewer to engage in exploring differences and similarities between works and practices for themselves.</p>\n<p>In 1966, Lippard curated the exhibition Eccentric Abstraction to capture a new wave of sculptures created from unusual, pliable materials like wire, plastic mesh, netting, and latex, which evoked tactile organic forms and, by extension, the human body.</p>\n<p>This is the Courtauld’s first show devoted to standalone sculpture, and the contrast between these blob-like forms and its Impressionist-heavy permanent collection may go some way to recreate just how different — even alarming — these pieces will have appeared to 1960s audiences just getting over the shock of Abstract Expressionism’s rehauling of formalist painting.</p>\n<p>Installation view of Abstract Erotic: Louise Bourgeois, Eva Hesse, Alice Adams , featuring works by Eva Hesse and Alice Adams (all photos Olivia McEwan/ Hyperallergic ) The three artists are each afforded an introductory caption presenting historical context.</p>\n<p>No direct written comparisons are made between them, nor any attempt to force commonality, for historically, there is none other than their working in generally the same space and time.</p>\n<p>This is good curating: The show allows viewers to ask and think for themselves.</p>\n<p>Its skill lies in making suggestions via the pieces selected for display, allowing for robust visual comparison.</p>\n<p>Viewers won’t be able to ignore the strain of eroticism that stems from their irresistible tactility, which is both alluring and fear-inducing, nor their uncanny resemblance to certain human appendages ( ahem ).</p>\n<p>Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up Applin and Gerstein do point out that all three artists’ experimentation with latex marked a turning point in their explorations of eroticism and the unconscious.</p>\n<p>The exhibition’s most well-known artist, Bourgeois, was born in Paris in 1911 and moved to New York in 1938.</p>\n<p>Duly included here is her “Filette (Sweeter Version)” (1968–99/ 2006), unmistakably an erect penis (or, more accurately, one yanked upwards by string) in urethane rubber, given the ambiguous French title “Little Girl.” Adams graduated from Columbia University with a degree…</p>",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/eed0c-scaled.jpeg?fit=2560%2C2113&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1035805/the-shocking-allure-of-erotic-abstraction-courtauld-gallery/",
    "sourceName": "hyperallergic.com",
    "author": "Olivia McEwan"
  }
]