[
  {
    "slug": "mel-s-bathroom",
    "title": "Mel’s Bathroom",
    "category": "Stories-Flash",
    "date": "2025-09-03",
    "excerpt": "By David Sydney",
    "cover": "https://flashfictionmagazine.com/wp-content/uploads/2019/12/5-minutes.png",
    "source": "https://flashfictionmagazine.com/blog/2025/09/03/mels-bathroom/",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <p>\n      <strong>By David Sydney</strong>\n    </p>\n    <p>It had to happen some time and some place. Who knew the bizarre quantum entanglement would occur in Mel’s small, disordered bathroom with its cracked mirror and wet towels? Mel reused his towels until they were thoroughly soaked. Only then would he put them in his dryer, which sounded like a threshing machine.</p>\n    <p>All the fundamental particles composing Mel suddenly, almost miraculously, and for reasons unknown, arranged themselves into the form of a Minotaur in the mirror. Entanglement between someone like Mel and a mythological creature will occur ultimately in this universe, given enough throws of the quantum dice. It just so happened to be on that Thursday.</p>\n    <p>So, Mel looked into his mirror and saw, blinking back, a gruesome, enraged bull’s head, salivating onto its massive, human chest.</p>\n    <p>And the Minotaur, from the other side of the mirror, attached to Mel’s inexpensive wallboard, saw something, well, he saw Mel. The creature’s eyes dilated. One moment, it had been in a dark, dank Labyrinth, waiting for its next sacrificial victim. And the next, as it stared into the mirror, it saw an off-kilter face, barely covered with ineffective shaving cream, grimacing from the cuts of a dull disposable razor. Why hadn’t he disposed of it at least a week before? And what kind of torn underwear was Mel wearing?</p>\n    <p>Few things in this universe are as fearsome as a Minotaur. Few, as monstrous or as vicious. Everyone fears the Minotaur. If you were up against a T-Rex or a MInotaur, which would you choose? The T-Rex would be my choice—there’s a much better chance of survival.</p>\n    <p>By nature, the Minotaur is violent. Extremely so. It subsists on victims sacrificed to it. Staring into the mirror—that is, into the labyrinth—Mel saw partially decomposing carcasses and whitening bones. He worked in his Uncle Leo’s coin-operated laundromat. The Labyrinth and the supply room of the laundromat were remarkably similar. Sacrificial bodies are one thing. But how about his Uncle’s mops, leaky buckets, solidified bleach packets, and broken laundry carts?</p>\n    <p>Mel’s shaving cream was as cheap as his razors. His Uncle didn’t pay much. The best way to learn, to get anywhere in this world, Uncle Leo claimed, was to start by working at the bottom for dirt wages. The whole point of a coin-operated laundromat, according to his Uncle, was to get rid of dirt.</p>\n    <p>Even though Mel had rubbed some shaving cream into his eyes— he was that kind of shaver — he could see that the Labyrinth was a dirty place. It’s one thing to nick yourself with a dull blade, to bleed into an inexpensive lather. It’s another thing to come eye to eye with a Minotaur.</p>\n    <p>Yet the Minotaur and the labyrinth seemed a kind of relief from the customers and unwashed laundry at his Uncle’s place. Mel had another day of mopping floors ahead of him. The Labyrinth? He’d dealt with dirt like that plenty of times.</p>\n    <p>And the Minotaur?</p>\n    <p>Well, a lot of coin-operated laundry customers might as well have bull heads. They are pathology attached to their dirty clothes. They are the epitome of tough customers.</p>\n    <p>Had the Minotaur been up against anything like this, however? That is, Mel? And the bathroom? It was shocking to see Mel’s face blinking back at it, squinting to get a better look. And there on the floor, the wet towels.</p>\n    <p>They were quantumly entangled, yet it was the Minotaur that felt like peeing itself.</p>\n    <p>Mel, who often felt like peeing himself at the laundromat, was comfortable gazing about the labyrinth.</p>\n    <p>The Minotaur had never witnessed anything like Mel, lathered up, blinking, shaving so erratically, yet smiling oddly.</p>\n    <p>It was the Minotaur who looked disturbed. The Minotaur who drew back from Mel. The Minotaur who didn’t want to pee itself yet didn’t like the looks of Mel’s toilet either.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://flashfictionmagazine.com/blog/2025/09/03/mels-bathroom/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "pelican",
    "title": "Pelican",
    "category": "Stories-Flash",
    "date": "2025-09-03",
    "excerpt": "Sadie peered out over the sea, cradling an icy flask between stiff fingers. The dock was fluffy with frost. She sat, settling herself into the frozen crystals. Chipped black nail polish flaked off as she fiddled with the flask’s top. Her dad used to unscrew the lid with one ha…",
    "cover": "https://flashfictionmagazine.com/wp-content/uploads/2019/12/5-minutes.png",
    "source": "https://flashfictionmagazine.com/blog/2025/09/02/pelican/",
    "author": "AventurOO Editorial",
    "body": "<p>Sadie peered out over the sea, cradling an icy flask between stiff fingers. The dock was fluffy with frost. She sat, settling herself into the frozen crystals. Chipped black nail polish flaked off as she fiddled with the flask’s top. Her dad used to unscrew the lid with one hand, celebrating another successful crab haul as he burst through the front door. Sadie would get an oxygen-depleting bear hug, and her mom, a bristly mustache kiss. He’d tip back a swig of whiskey and do a little dance. Sadie would roll her eyes, but eventually join in, feet jigging and arms swinging.</p>\n<p>She let her snow boots swing, their heavy soles knocking old pavement salt into the shallows below. The sharp smell of brine drifted in as the tides pulled out, the whole wind-bitten inlet stained the dingy gray of late winter.</p>\n<p>When she’d left the house that morning, backpack on, AP English homework unfinished, and mussy clothes thrown together, her mom—disheveled damp hair and trembling hands pawing at one another, jittery from too much coffee—had chased her halfway down the walk with a heavy coat and waterproof pants.</p>\n<p>“Mom, I’m fifteen, not five.”</p>\n<p>“It’s supposed to snow this afternoon,” her mom said, shoving Sadie’s arms into the sleeves.</p>\n<p>Sadie had acquiesced, mostly to avoid her mother’s clingy anxiety, but also to keep hidden the flask she’d stolen from her dad’s office.</p>\n<p>She’d walked right past her high school and toward the marina, where her dad’s ship was notably absent. Today would have been the annual “Sadie picks which crab they eat for dinner” day.</p>\n<p>She adjusted her position on the chilly dock, trying to work a little blood back into her thighs as she unscrewed the flask. Staring at the empty berth that used to house the S. S. Sadie, she took a sip. The liquid was so cold it gnawed at her insides, little permafrost punctures against the esophagus.</p>\n<p>That first winter storm, the one that had swallowed his ship in open water, had brought the bitter scream of winds and a colossal ice storm. Sadie remembered how beautiful it had all been, the whole town encased in a brilliant slick of shimmer. She hadn’t even thought to be scared, to worry Dad would be navigating his crabbing ship in the icy dark. She’d stayed up to watch the stars reflect in the thick glaze.</p>\n<p>The call came in the early hours. Jerked awake by her mom’s anguish—a cry that cracked the ice along the window panes—Sadie shot downstairs to find her crumpled on the ground, phone in her lap, horror etched in every wrinkle that bunched around her eyes.</p>\n<p>“He went down with the ship,” was all Mom could say. Sadie collapsed, folding herself inside her mother’s broken form, trying to burrow her way back to the beginning. Back to a childhood full of morning laughter over buttered toast, and board games that stretched past bedtime.</p>\n<p>Sadie took another sip from the flask. She slid down, lying on her back and staring at the heavy clouds poised to unleash their innumerable flurries. Seagulls spun lazily overhead. Her memories sailed in and out, some from last summer when splinters threatened her bare feet as she and Dad raced to the end of the marina and threw themselves into the bay. She remembered splashing back out with a yelp when he yelled, “Shark!”</p>\n<p>He’d told Mom over dinner how gullible their daughter was, to which Sadie aimed a few peas in his direction.</p>\n<p>Now there were just quiet meals for two, avoiding each other’s eyes, in a house much emptier. Who knew Dad had taken up that much space?</p>\n<p>A pelican joined the seagulls with their endless cow-cow-cow calls. The bigger bird rose and fell in the thermals that edged the ocean. Dad had always loved pelicans.</p>\n<p>Footsteps sounded from the earth-bound portion of the dock, but Sadie didn’t care if one of the crabbers saw her. They’d understand.</p>\n<p>“Your dad tried to get me to call you Pelly, you know.” Her mom’s voice drifted in.</p>\n<p>Sadie launched upright.</p>\n<p>“Can you imagine? Pelly Lacrelly?” She snorted.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://flashfictionmagazine.com/blog/2025/09/02/pelican/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "lowercase",
    "title": "lowercase",
    "category": "Stories-Flash",
    "date": "2025-09-03",
    "excerpt": "By Amanda Song",
    "cover": "https://flashfictionmagazine.com/wp-content/uploads/2019/12/5-minutes.png",
    "source": "https://flashfictionmagazine.com/blog/2025/09/01/lowercase/",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <p>\n      <strong>By Amanda Song</strong>\n    </p>\n    <p>what if there was a girl in your remote class who only typed in lowercase in all her homework forum responses and in chat messages and you judged her for it and thought she was so pretentious in wanting to seem breezy and casual, presumably that was why she never capitalized. then later on, you learned her laptop’s shift key and caps lock were both broken. but even later on, you learned the caps lock being broken was a lie and it was indeed an artistic choice to only use lowercase, so you went back to judging her for it. years later, you developed the same preference for lowercase because it made the letters look more uniform and this made you feel bad for judging that girl all those years ago for doing the same thing, so you google her and find her newsletter. you read a few posts, by now she was no longer writing in lowercase, you find her witty and interesting and want to reconnect with her, but then you read another one of her posts that roasted people who only typed in lowercase, and you want to reach out for a different reason, to remind her that she once also wrote like that. you go through old files to dig up screenshots as proof and in doing so, you find that you had taken screenshots of dms you and her had sent each other over the course of weeks and months of taking that remote class together. you remember that you two had gotten pretty close during that time and she was arguably your closest or only friend from that class. in one message you had asked her why she only wrote in lowercase and that was when she told you about the shift key and caps lock being broken, then a few days later you called her out on that and she followed up with saying sorry and that she did not know why she said that, her shift key was broken but not her caps lock, and she just liked writing in lowercase that’s all. you said okay and you moved on to other topics like how her dad was sick and in treatment and how you were also having trouble getting out of bed in the morning. after reading all these old screenshots, you want to reach out to connect with her even more and not about the whole lowercase thing, but just to see how she was doing as a person given how close the two of you were. so you try sending her a message, but the newsletter app doesn’t allow you to because you are not mutual friends on the platform. so you look for her facebook profile, but can’t find it because she probably deactivated it years ago when everyone was deactivating their profiles as protest of the whole cambridge analytica thing but you didn’t because you wanted to keep your profile in case you wanted to contact people from your past like you wanted to reach out to this girl right now. at the time, however, you didn’t factor in the possibility that even if you kept your profile, as long as the other person deactivated their account, you were shit out of luck. so you go to the dreaded website linkedin to look for her there and after a few searches you find what appears to be her, only she has a different hairstyle and she has moved to another city and she was working as an actuarial analyst, whatever that meant. so you start a new message on linkedin and as you’re drafting it, trying to strike the right balance of thoughtful and breezy so as to not seem too weird or stalkerish, you come to this debate of whether to capitalize or write in all lowercase and for a long time you can’t decide so you just sit there looking at the message you wrote.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://flashfictionmagazine.com/blog/2025/09/01/lowercase/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-last-hunt",
    "title": "The Last Hunt",
    "category": "Stories-Flash",
    "date": "2025-09-03",
    "excerpt": "By Michelle Rogers",
    "cover": "https://flashfictionmagazine.com/wp-content/uploads/2019/12/5-minutes.png",
    "source": "https://flashfictionmagazine.com/blog/2025/08/31/the-last-hunt/",
    "author": "AventurOO Editorial",
    "body": "<p>\n      <strong>By Michelle Rogers</strong>\n    </p>\n<p>The dragon slayer stood over his kill, breath heaving, the sword’s edge still glowing with heat. The beast lay still, wings half-folded, smoke curling from its nostrils. <i>One more, and it’s done.</i> That’s what the High Mages had told him. One more and the curse would be broken.</p>\n<p>The acrid stench filled Ronan’s lungs, but the fire beneath his skin burned hotter, molten metal coursing through his veins. Once an extension of himself, the sword’s hilt felt strange—too smooth, too light. A shiver ran down his spine despite the warm air. The wind carried distant voices, though no one was there. He flexed his fingers, the skin at his knuckles rougher, darker. His nails—no, claws—caught the firelight. The changes were coming faster now. He had to finish this before—</p>\n<p>“Ronan.”</p>\n<p>Lyra’s voice was quiet, but it anchored him. He turned to her, his guide, the woman who had led him unerringly to every dragon, yet always hesitated at the final strike. She stood motionless, her amber eyes shadowed.</p>\n<p>“We’re close,” he said, sheathing his sword. His armor, crafted to fit perfectly, now pinched against his spine. “One more, and it’s over. The curse will end. I will be human again.”</p>\n<p>“And what then?” Her voice was careful. “What does that mean?”</p>\n<p>“It means I win,” he said firmly. “It means dragons are finally gone.”</p>\n<p>She hesitated, gaze flicking to his hands. “Have you seen what’s happening to you?”</p>\n<p>He scoffed. “Battle scars. Everyone changes in war. It will go away when the curse is lifted.” He forced a grin, reaching for her hand. “You won’t have to worry about this in your future husband. I’ll be just as I was before.”</p>\n<p>She didn’t move. The firelight traced the tension in her shoulders. “The Mages didn’t lie to you.” Her voice softened. “Kill the last dragon, and you will be free of this.”</p>\n<p>Relief flickered in his chest, but something in her tone held him still. “Then why do you look at me like that?”</p>\n<p>She exhaled slowly, her expression shifting from sorrow to resolve. “Because I am the last one.”</p>\n<p>The world lurched beneath him. He took a step back, the ground unsteady. “No. That’s not possible.”</p>\n<p>Lyra closed her eyes, exhaling softly. When she opened them, the illusion fell away. Golden scales shimmered under the moonlight, her pupils narrowing into slits—familiar eyes, ones he’d seen fade into death a dozen times before.</p>\n<p>His sword was in his hands before he could think. “You led me to them? Your own kind?”</p>\n<p>“Some deserved it.” Her voice carried sorrow. “The ones who razed your village—I helped you find justice. But each death changed you. I tried to slow our hunt, to give you time to see it.”</p>\n<p>The sword trembled in his grip. The final dragon, the last one to be slain, stood before him. He clenched his fists, his breath sharp, uneven. His whole life, dragons had been monsters. He had vowed to rid the world of their kind, and now—</p>\n<p>Now she stood before him. Not a beast, not an enemy. The woman he loved. The one who had saved him, guided him, stayed at his side when no one else had.</p>\n<p>He remembered their nights by the fire, her laughter filling the spaces between his grief. The warmth of her voice when she spoke of the stars. The way she was always there to help him chase away the nightmares.</p>\n<p>“If you kill me,” she said, voice steady, “you go back to who you were. A man. A slayer. A hero. If you don’t—”</p>\n<p>“I stay like this,” he finished, throat tight. “I remain trapped between the worlds of man and beast.”</p>\n<p>Silence stretched between them, thick as smoke. His hands trembled. The sword had never felt heavier.</p>\n<p>She exhaled. “No. It will continue. You’re already more dragon than human. You feel it, don’t you? The way fire didn’t burn you. The way your senses sharpened after each hunt. The way you know what I’m thinking before I say it.”</p>\n<p>Ronan swallowed hard. He had ignored it, pushed the thoughts aside like battle fatigue. But the truth settled into his bones now.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://flashfictionmagazine.com/blog/2025/08/31/the-last-hunt/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "driving-test",
    "title": "Driving Test",
    "category": "Stories-Flash",
    "date": "2025-09-03",
    "excerpt": "The first is hardest. It’s unexpected. The fizzy cocktail of nerves and shame seizes your heart. You beat yourself up for a while, then it’s back again for a second try.",
    "cover": "https://flashfictionmagazine.com/wp-content/uploads/2019/12/5-minutes.png",
    "source": "https://flashfictionmagazine.com/blog/2025/08/30/driving-test/",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <p>The first is hardest. It’s unexpected. The fizzy cocktail of nerves and shame seizes your heart. You beat yourself up for a while, then it’s back again for a second try.</p>\n    <p>The next one is a bit easier, but it still hurts. You didn’t stop at the sign, again. Or you did, but you didn’t put on your handbrake, so it’s like you didn’t.</p>\n    <p>The third and fourth time, shame becomes anger. What is going on? Maybe they don’t want you to pass? You’ll show them. They won’t win.</p>\n    <p>Five—you thought you did well, but the examiner was a bastard.</p>\n    <p>Six, seven, eight…. The receptionist’s name is Sally. She’s been working there for ten years. She has a cup of tea waiting for you when you return.</p>\n    <p>“This time?”</p>\n    <p>“Nope, see you in a few weeks!” You both smile.</p>\n    <p>Ten, you bring her a present. It’s her birthday, after all. It’s the book she was telling you about on nine—the one she bought Lina before the accident. She read to her in the hospital, on the long nights when the painkillers weren’t enough. Sally thinks she left the book right there in the waiting room. Regrets it every day.</p>\n    <p>“It was our special book,” she tells you. You both cry. You hug. She wishes you good luck.</p>\n    <p>You don’t need luck, because you have her.</p>\n    <p>You fail, but there is sugar in the tea this time around.</p>\n    <p>Eleven, Sally isn’t there.</p>\n    <p>Twelve, a new guy. You ask for Sally’s number. He asks you to leave.</p>\n    <p>Thirteen and fourteen. The new receptionist has bad breath. He farts whenever you finish.</p>\n    <p>Fifteen.</p>\n    <p>You pull over halfway through. Sally is right there, waiting to cross the road. A tangle of coat and scarf and smile. If you get out of the car, the examiner says, you’ll fail.</p>\n    <p>You get out.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://flashfictionmagazine.com/blog/2025/08/30/driving-test/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "after-he-goes",
    "title": "After He Goes",
    "category": "Stories-Flash",
    "date": "2025-09-03",
    "excerpt": "By Donald A. Ranard",
    "cover": "https://flashfictionmagazine.com/wp-content/uploads/2019/12/5-minutes.png",
    "source": "https://flashfictionmagazine.com/blog/2025/08/29/after-he-goes-2/",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <p>\n      <strong>By Donald A. Ranard</strong>\n    </p>\n    <p>When I go, he would tell her, I want to go fast, and one sunny fall morning, as he’s jogging around the lake, his wish comes true. He’s gone before he hits the ground.</p>\n    <p>With her daughter’s help, she sells the house and moves into Sunrise. He would have hated everything about the place (beginning with the name: “Sunrise?” she could hear him say. “Give me a break. Call it what it is, for Christ’s sake—Sunset”). But she discovers, to her surprise, that she actually likes it: three meals a day, housekeeping, and, for the first time in years, a social life. It’s like being in a co-ed college dorm (well, a co-ed dorm where the girls outnumber boys three to one).</p>\n    <p>~</p>\n    <p>There are two wings—assisted living and memory care (referred to in hushed tones as “the other place” by assisted-living residents)—and, with her increasingly iffy memory, she is a probational resident of assisted living.<br/>Soon there are serious lapses in memory. One evening her daughter visits to find her more than a little tipsy. “I jush had my usual one glash,” she insists. It takes her daughter a while to figure out what had happened. She’d had her usual one glass of white wine before dinner—four times, going through the whole bottle.</p>\n    <p>After that her daughter makes sure there’s never more than one mini-bottle in the refrigerator.</p>\n    <p>~</p>\n    <p>She weeps when she’s told she has to move to “the other place.” But after a few days there, she seems fine. Or maybe she’s forgotten the previous place.</p>\n    <p>~</p>\n    <p>Most of the time her daughter is her daughter. But sometimes her daughter is her sister—the twin sister who died in a car accident at thirty. And every now and then her daughter is a stranger.</p>\n    <p>The day will come when she’ll wake from a dream and look up at her daughter, sitting in a chair next to the bed, and say, “Mom? Is that you?”</p>\n    <p>~</p>\n    <p>She points at the photo in the silver frame on her bureau and asks who he is. “That’s Daddy,” her daughter says. “Your husband.”</p>\n    <p>It takes her a moment to take in both of these things—Daddy, husband. Then she says, “He’s very handsome. Did l love him? Were we happy?”</p>\n    <p>“You were very happy,” her daughter says. That’s not entirely true, but it’s more true than untrue. She smiles, happy to learn that she was happy.</p>\n    <p>Then, because it’s a nice day, they go outside, where she enjoys, once again for the first time, the beautiful grounds.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://flashfictionmagazine.com/blog/2025/08/29/after-he-goes-2/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "a-nesting-above-the-mantel-by-zary-fekete",
    "title": "A Nesting Above the Mantel by Zary Fekete",
    "category": "Stories-Literary",
    "date": "2025-09-03",
    "excerpt": "<i>The narrator has mixed feelings about the birds who have made a home in his chimney.</i><br /><br /><table cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"float: right;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleuserconten…",
    "cover": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiLPoksK98-fG8ioKwhywCTCOLyhwmxkjWcb_uymv-C65_14hPZtfaDzxI5VUbg8BtT5QLKuyOMhxrPuTS2Zvx3iDim8q-DIiSrK-48Lp8HHl636sQDPnHn4gpS_kuaYsfEgxfrcUmG_JdcxxoLGKqPCv2sejcHEjeyQ5jc3gzFlGQKKWF5u-1smqH0j_w/s72-c/A%20Nesting%20Above%20the%20Mantel%20by%20Zary%20Fekete.jpg",
    "source": "https://www.fictionontheweb.co.uk/2025/09/a-nesting-above-mantel-by-zary-fekete.html",
    "author": "AventurOO Editorial",
    "body": "\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.fictionontheweb.co.uk/2025/09/a-nesting-above-mantel-by-zary-fekete.html\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "count-to-ten-by-kristi-schirtzinger",
    "title": "Count to Ten by Kristi Schirtzinger",
    "category": "Stories-Literary",
    "date": "2025-09-03",
    "excerpt": "<i>Three boys - Mitch, his foolhardy big brother Danny, and Danny's friend Kyle - go fishing along an Ohio river on an ordinary day that will change everything.</i>\n\n<br /><br /><table cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"float: right;\"><tbody><t…",
    "cover": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEixFDBAr31QO2yjn0IXDvF2Ladaf019UIVym6kjgL2CK0cj1ihgA77PvHZJ1R9K5IjA6c3asOQxWJ_M0TwKtrbvp6Mgh2BXWiPozafLLpTda30C3sc9jSItx8F1cXGSFHfMyyO1EH0GSJbkJjzZYTOg-vkrWtLRHzgZTCgGBAZTDZ8MFdgsv-E0FfnssPc/s72-c/Count%20to%20Ten%20by%20Kristi%20Schirtzinger.jpg",
    "source": "https://www.fictionontheweb.co.uk/2025/08/count-to-ten-by-kristi-schirtzinger.html",
    "author": "AventurOO Editorial",
    "body": "\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.fictionontheweb.co.uk/2025/08/count-to-ten-by-kristi-schirtzinger.html\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "alternate-timeline-fanfic-by-eric-del-carlo",
    "title": "Alternate Timeline Fanfic by Eric Del Carlo",
    "category": "Stories-Literary",
    "date": "2025-09-03",
    "excerpt": "<i>In an alternate history with stunted technology and strange sexual mores, Coby enlists the help of his schoolmate Jaecar to write a story inspired by a retired science fiction author.</i>\n\n<br /><br /><table cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style…",
    "cover": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh_MjLMdAvQrNSdmEg8OiOxOHqN0U_9NgPXcVy3BNudXEQ-hLCE7o9R0NKgR2UsnKBS8Jvg1yQ6-VDXCatrBaZlxwiM1E035C0S6BrvDSljhTMlhoNIcZOht5mOzEBZMFOAtLCH2GV6ToRsDsR8OY2uUcZC_BBzTE7c8ucEZwBJShlf-iKUz-3M4LIeOgE/s72-c/Alternate%20Timeline%20Fanfic%20by%20Eric%20Del%20Carlo.jpg",
    "source": "https://www.fictionontheweb.co.uk/2025/08/alternate-timeline-fanfic-by-eric-del.html",
    "author": "AventurOO Editorial",
    "body": "\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.fictionontheweb.co.uk/2025/08/alternate-timeline-fanfic-by-eric-del.html\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "hairline-fracture-by-bill-tope",
    "title": "Hairline Fracture by Bill Tope",
    "category": "Stories-Literary",
    "date": "2025-09-03",
    "excerpt": "Foggy-headed elder Michael Lessup, having not been intimate with a woman for years, dares to dip his toes into a new relationship.",
    "cover": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgpZ3U62n8ZCCDnt5B9TbTkQ36uWC5iOyAhO2LaG2HOWU_pdxMiG4Qe1o1PhoRI77m6WAJ6E41g2c9GqHm_GwM4TIarPCOBWuX4jNRYMiBho7coJyYGx8e9PyNuw4t3Y87MAvBFYlWn8vIuw8oajZfxyY6oBqqQqac2Wag0JZC_WThawL3PGAvuC4Nza5w/s72-c/Hairline%20Fracture%20by%20Bill%20Tope.jpg",
    "source": "https://www.fictionontheweb.co.uk/2025/08/hairline-fracture-by-bill-tope.html",
    "author": "AventurOO Editorial",
    "body": "<p>\n      <i>Foggy-headed elder Michael Lessup, having not been intimate with a woman for years, dares to dip his toes into a new relationship.</i>\n    </p>\n<p/>\n          <graphic/>\n        </cell>\n      </row>\n    </table>\n    <p>\n      <strong>Present Day</strong>\n    </p>\n<p>Michael sat on the green-painted bench at the edge of the small city park fronting the grade school. He was dressed warmly, despite the late spring warmth of the sunny May afternoon. He watched as youngsters played kickball and skipped rope and tossed a rubber ball against the wall of the elementary school. Their presence barely registered with him. His life had become an unchanging cycle of sameness that was stultifying.</p>\n<p>The playground monitor took notice of Michael and, after a moment's hesitation, made her way in his direction. As Michael watched her approach, he gave nothing away; this, he thought, should at least be interesting, perhaps even entertaining.</p>\n<p>\"Sir?\" she said, standing beside him.</p>\n<p>Michael closed and then opened lugubrious eyes. He could barely stay awake. Over the last half year, his inattentiveness had led to his meds going all awry.</p>\n<p>\"Sir?\" she said again, leaning over and into his personal space.</p>\n<p>Michael lifted his head, heavy on his shoulders, and focused on her middle-aged face. She was late-30s, the same age as his daughter.</p>\n<p>\"Um?\" he replied.</p>\n<p>\"Sir, can I help you?\" she asked. What she meant, Michael thought, was, would you please go away and stop menacing the children?</p>\n<p>\n      <a href=\"\">\"What,\" asked Michael, \"did you have in mind?\" He watched her blink in perplexity and try to make some sense of his remark.</a>\n    </p>\n<p>\"Sir, do you know where you are?\" she asked next.</p>\n<p>\"Um?\" he repeated.</p>\n<p>\"Sir,\" said the monitor, \"this is a grade school.\"</p>\n<p>Michael turned away, determined now to ignore her. After she'd gone, he slipped under and only regained awareness when a baritone voice addressed him.</p>\n<p>\"Hey, Pops,\" the voice said, \"what're you doin' here?\"</p>\n<p>Sensing the authority contained in the voice, Michael's attention level ratcheted up a notch.</p>\n<p>\"What do you want?\" Michael asked abruptly, frowning at the 40-something uniformed police officer who loomed over him. He watched as the short, blond man's pupils dilated.</p>\n<p>\"I asked why you're here,\" repeated the cop. Aggressive little shit, thought Michael.</p>\n<p>\"I heard you,\" said Michael in a peevish tone. \"What business is it of yours? Am I breaking a law, contravening an ordinance?\" he asked.</p>\n<p>This gave the policeman pause. He had expected to roust this likely homeless figure without any problem, but here was the old gent getting back in his face.</p>\n<p>\"Do you have ID?\" he asked next.</p>\n<p>\"Why do I need to show you my ID?\" demanded Michael, trying to shake the lethargy from his mind. \"I've committed no crime.\"</p>\n<p>\"Well,\" said the cop, \"maybe you have and maybe you ain't.\"</p>\n<p>\"You have no reasonable suspicion,\" said Michael, \"much less probable cause. I'm sitting on a public bench in a public park, not molesting anyone. My tax dollars purchased this bench, and go to pay your salary.\"</p>\n<p>\"But,\" said the cop, \"why are you here?\"</p>\n<p>\"I am an old man,\" explained Michael. \"I felt tired, so I took advantage of a public resource - this bench - and sat down. What more do you need to know?\"</p>\n<p>\"Well, we received some complaints,\" said the policeman.</p>\n<p>\"From whom?\" asked Michael.</p>\n<p>\"That's... confidential,\" explained the cop.</p>\n<p>\"Is that what you're going to say in court?\" asked Michael.</p>\n<p>\"In court?\" said the cop with a gulp.</p>\n<p>\"When I sue the city for wrongful prosecution and harassment and elder-abuse,\" said Michael.</p>\n<p>'Listen, Mr., go ahead and sit here. You're not hurting anyone. Take it easy. And have a nice day.\" The policeman beat a hasty retreat.</p>\n<p>The brief exchange had fully awakened Michael and he felt newly more alive and motivated to move along. Climbing to his feet with the aid of a ponderous wooden cane. he staggered off, cloaked in a surfeit of loneliness.</p>\n<p>\n      <strong>Four Years Ago</strong>\n    </p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.fictionontheweb.co.uk/2025/08/hairline-fracture-by-bill-tope.html\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-sour-smell-of-pain-joe-giordano",
    "title": "The Sour Smell of Pain Joe Giordano",
    "category": "Stories-Literary",
    "date": "2025-09-03",
    "excerpt": "<i>\n\n\n\nAn Italian immigrant in New York tries to carve out a living, but wonders if the best years of his life are behind him.</i><br /><br /><table cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"float: right;\"><tbody><tr><td style=\"text-align: center;\"><a…",
    "cover": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg3klf1qlZ31__SjnFVR-K1X5HJnp_WrvtC3VHIMc7PRBO7VPjI9pTHXKpqjtiYxDzYGMGYrdjz-umkQtxP33ifiAqjB1qfLgU_Uee5PNdvq1sa4leFXJsyFsy6mfJO5kQDjXFx0KU4vX-tZnRUMiPJSuzZFuEczcTs521f1dDJ9vduOHT4JGopk66wus0/s72-c/The%20Sour%20Smell%20of%20Pain%20by%20Joe%20Giordano.jpg",
    "source": "https://www.fictionontheweb.co.uk/2025/08/the-sour-smell-of-pain-joe-giordano.html",
    "author": "AventurOO Editorial",
    "body": "\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.fictionontheweb.co.uk/2025/08/the-sour-smell-of-pain-joe-giordano.html\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "mrs-tilbury-s-paramour-by-e-j-leroy",
    "title": "Mrs. Tilbury's Paramour by E.J. LeRoy",
    "category": "Stories-Literary",
    "date": "2025-09-03",
    "excerpt": "An unconventional romance set in an alternative past where clockwork technology reigns; first published in Phantasmical Contraptions & More Errors",
    "cover": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiCrDYTkLsj8Xwz5T-EjQ1igXEFRu3KURnhYClqDP5eozUwNejqzwoECCvFIcA06IqAnM0BpLZzDZhrwmIp8AmSln_KiJ4w2x42rCUho6zKhOlpLSvTrKP_frkW3B6UbhXNH09UbvujELRBK1KBbi0EYmGx1WJz7D2Taf0jU5Vih_zD7vdVxCy6ncvPDu8/s72-c/Mrs%20Tilbury%E2%80%99s%20Paramour%20by%20EJ%20LeRoy.jpg",
    "source": "https://www.fictionontheweb.co.uk/2025/08/mrs-tilburys-paramour-by-ej-leroy.html",
    "author": "AventurOO Editorial",
    "body": "<p><i>An unconventional romance set in an alternative past where clockwork technology reigns; first published in</i>Phantasmical Contraptions &amp; More Errors</p>\n<p>\n      <i>by JayHenge Publishing, 2022.</i>\n    </p>\n<p/>\n          <graphic/>\n        </cell>\n      </row>\n    </table>\n    <p>Of course, there were many men at the agency who met those criteria. But none as well as Frédérick, at least according to himself. As for the first requirement, he was nearly a decade younger than the age limit. His English was impeccable. And no one would believe for a moment that he didn't meet or exceed all the other qualifications in Mrs. Tilbury's application.</p>\n<p>Even the last peculiar note, \"a dashing foreigner,\" was in his favor. Although not particularly tall, he was trim and had a lovely countenance with fine features. Men and women alike were inclined to call him \"beautiful,\" for he had an almost feminine appearance and bearing. On account of his mixed heritage, his dark hair had a natural wave that many ladies found appealing. His hazel eyes were nearly golden. The fullness of his lips promised only the finest kisses. His skin tone was ambiguous, allowing him to easily pass for a Spaniard. That was assuming, of course, he did not sit in the sun long enough to reveal his partial African ancestry. He was, in a word, alluring.</p>\n<p>\n      <a href=\"\">When he rang the bell at Mrs. Tilbury's, he was absolutely certain he would succeed where all the other men had failed within two hours at the most. Eccentric widows, after all, were his specialty.</a>\n    </p>\n<p>The woman who answered the door was a good deal taller than he and easily three times his senior. She possessed a becoming, yet formidable, plumpness that bode well with her round, cream white face. Despite her age, her hair was mostly dark and she was relatively free from wrinkles except near the corners of her eyes. She had a stately bearing emphasized by the fineness of her clothes. If Frédérick chose a word to describe her, it would be \"statuesque.\"</p>\n<p>\"Madame Tilbury?\"</p>\n<p>\"Yes, I am Mrs. Tilbury,\" she said in English. Her voice warbled in a manner that startled him. It was not a terrible voice, but it was odd.</p>\n<p>\"I am Frédérick Caron, madame, from the agency.\"</p>\n<p>\"Oh, how wonderful!\" She clapped her hands in front of her in a dramatic fashion. It made Frédérick wonder if she was an actress in her younger days. \"Won't you come in, Monsieur Caron?\" She butchered the word \"monsieur\" and mispronounced his surname as \"care-on.\"</p>\n<p>\"Frédérick would be fine, madame,\" he said when he followed her into the house.</p>\n<p>\"Oh, of course. Frédérick.\" At least she pronounced his first name correctly, complete with three syllables. \"What a charming name. It simply rolls off of the tongue.\"</p>\n<p>The first thing he noticed was how the</p>\n<p><i>salon</i>was overwhelmed by the presence of multiple clocks and an array of scientific instruments better suited to a gentleman's study. There were also two gold parallel lines resembling railroad tracks running across the floor.</p>\n<p>\"Won't you sit down, Frédérick?\" She made a grand sweep of her arm toward the sofa. \"Allow me to offer you some tea. I had it imported from Britain.\"</p>\n<p>Mrs. Tilbury sat across from him and twisted a gold knob on the side of her chair. After a few rotations, the tea cart on the other end of the room rattled to life. It rolled along the golden parallel tracks that ran between them as if by magic. When Mrs. Tilbury turned the knob in the opposite direction, the cart stopped.</p>\n<p>\"It's rather clever, don't you think?\" she said while she served the tea. \"Mr. Tilbury had this delightful contraption installed shortly after we moved in. Would you care for some sugar or cream?\"</p>\n<p>\"No, thank you, madame.\"</p>\n<p>Mrs. Tilbury served herself a more than ladylike amount of cream and sugar before returning to her chair. \"Now, then. Tell me a little about yourself.\"</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.fictionontheweb.co.uk/2025/08/mrs-tilburys-paramour-by-ej-leroy.html\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "our-perfectly-pretend-plane-romance",
    "title": "Our Perfectly Pretend Plane Romance",
    "category": "Stories-Nonfiction",
    "date": "2025-09-03",
    "excerpt": "We’ve been publishing the winners of our True Romance Writing Prize collaboration with Belletrist and actress Emma Roberts these past few weeks. So far, we’ve shared the grand prize–winning essay in the shortread category, by Maggie Hart, and the longform winning story, by Oli…",
    "cover": "https://substackcdn.com/image/fetch/$s_!kFkr!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcb39b87d-fb58-425b-a078-d4922456b520_1280x1364.webp",
    "source": "https://www.narratively.com/p/well-always-have-the-plane-ride",
    "author": "AventurOO Editorial",
    "body": "<h3>I met someone mid-flight and we immediately hit it off. Rather than try to keep in touch, we imagined what our lives would have been like if we were together. It was almost as good.</h3>\n<p><i>We’ve been publishing  the winners of our True Romance Writing Prize collaboration with Belletrist and actress Emma Roberts these past few weeks. So far, we’ve shared the grand prize–winning essay in the shortread category, by Maggie Hart, and the longform winning story, by Olivia Shaffett. We’re elated to be bringing you the first shortread finalist this week, a banger of a piece from Katharine Coldiron. This is what Katharine had to say about how the piece came together: “This was the first piece I’d written on a prompt in years. I read the call for entries and thought immediately of this tale. I worked it through in the shower and put it down in a rush. I polished it a little, et voila.” A great reminder to follow a spark and go for it!</i> </p>\n<p>I was 19 or 20, a smoker, on a plane from New England to New Orleans. Next to me sat a man, around 19 or 20, a smoker. We looked at each other and liked what we saw; we talked to each other and liked what we heard; we, simply, hit it off.</p>\n<p>And not as friends. In that way that enlivens your whole body. Chemistry, pheromones, attraction. Whatever you call that, when the person is someone whose skin you badly want to touch from the first moments of meeting them.</p>\n<p>As we talked, we realized there was no way we’d ever meet again. I was visiting my mother for the summer in a place I would never live permanently. He was laying over in New Orleans on the way back to Wyoming or Oklahoma or North Texas, I don’t remember. I don’t even remember his name. I know he came from a place I’d never been and seemed unlikely to visit: a landlocked place. All my experiences had been coastal, due to my Navy father — I never lived anywhere you couldn’t park a 40,000-ton ship near.</p>\n<p>We told the truth. We made each other laugh.</p>\n<p>There was no social media then, and we both had precisely the quantity of life experience that advised us not to persist or pursue this connection. A little less and our romantic sides would have tried to build faith in a long-distance something; a little more and we would have recognized that such an instant, holistic connection is too rare to waste.</p>\n<p>Instead, we had the plane ride, and that was all.</p>\n<p>How will I remember you? I asked, or something less obvious that posed the same question.</p>\n<p>He dug in his pocket. I just bought this, he said. It was a rectangular Bic lighter with a picture of a cowboy on it, either at dusk or sunrise.</p>\n<p>I unzipped the front pocket of my backpack and pulled out an oval Bic lighter. It was a paisley design with a lot of purple in it. I’d chosen it because it was eye-catching and pretty without any pink.</p>\n<p>We traded.</p>\n<p>As we taxied, he said to me, I wish I could kiss you.</p>\n<p>Silence for a minute.</p>\n<p>Let’s pretend to be together, I said. As we’re getting off the plane, let’s pretend that we’re boyfriend and girlfriend. We’ll hold hands and talk about where to go for dinner. Then you’ll go to your gate and I’ll go to baggage claim.</p>\n<p>Yeah, he said.</p>\n<p>And you could kiss me then, I said. But not, like, really dramatically, like in the movies. Just like you do it all the time.</p>\n<p>He nodded.</p>\n<p>That was right. That was the right thing.</p>\n<p>I tried not to be sad.</p>\n<p>I still have that lighter. I find it in boxes of old stuff I go through from time to time, trying to discard what I no longer need. It’s been 15 years since I smoked, but I will not throw away that lighter.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.narratively.com/p/well-always-have-the-plane-ride\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "secret-life-of-the-professor-who-lives-with-nazis",
    "title": "Secret Life of the Professor Who Lives with Nazis",
    "category": "Stories-Nonfiction",
    "date": "2025-09-03",
    "excerpt": "This thrilling story by Erika Hayasaki is a fascinating look at a man who has dedicated his life to a very unorthodox and dangerous mission. Unfortunately, even as Peter Simi’s work becomes more and more relevant, the Trump administration recently shut down his funding and ban…",
    "cover": "https://substackcdn.com/image/fetch/$s_!VKz2!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F48694bdc-15fa-48d5-a589-72aa69ad27d9_1852x1042.jpeg",
    "source": "https://www.narratively.com/p/secret-life-of-the-professor-who",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>Secret Life of the Professor Who Lives with Nazis</h1>\n    <h3>Sociologist Peter Simi has spent 20 years embedding with skinheads. As hate crimes spike across America, his intimate insights are more crucial than ever.</h3>\n    <p>\n      <i>This thrilling story by Erika Hayasaki is a fascinating look at a man who has dedicated his life to a very unorthodox and dangerous mission. Unfortunately, even as Peter Simi’s work becomes more and more relevant, the Trump administration recently  shut down his funding and banned his books. If you haven’t had a chance to read this story yet, it’s one not to miss. And if you want to learn how to write hard-hitting profiles like this one, we’re extremely lucky to have the writer, Erika Hayasaki joining us for an Open Book live video over at Narratively Academy this week.</i>\n    </p>\n    <p>The partygoers with swastikas and Iron Cross tattoos began to arrive at the ranch-style home in Costa Mesa, California, one summer evening in 2000. Pete Simi looked around the crammed living room as it quickly filled with around 50 racists clapping and swaying to the guitar and drum music of a white-power band, Hate Train, which belted out lyrics about “Aryan pride.” The color of Simi’s skin allowed him to blend in. He’s a husky guy, with sand-colored hair, who can down beer after beer without losing his faculties, a practice that gives him cred with this crowd. He caught eyes with an intoxicated skinhead, who stared at him suspiciously and then said to a friend next to him: “That’s the guy who wants to study us.”</p>\n    <h2>Keep reading with a 7-day free trial</h2>\n    <p>Subscribe to Narratively to keep reading this post and get 7 days of free access to the full post archives.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.narratively.com/p/secret-life-of-the-professor-who\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-monk-who-ghosted-me",
    "title": "The Monk Who Ghosted Me",
    "category": "Stories-Nonfiction",
    "date": "2025-09-03",
    "excerpt": "Subscribe to Narratively to keep reading this post and get 7 days of free access to the full post archives.",
    "cover": "https://substackcdn.com/image/fetch/$s_!sNQ1!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff463e9aa-ad0a-426e-bc0c-107260b4688b_2580x1720.jpeg",
    "source": "https://www.narratively.com/p/the-monk-who-ghosted-me",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>The Monk Who Ghosted Me</h1>\n    <h3>In a region known for being one of the most romantic in the world, I met my soulmate and fell in love. The rest didn’t exactly go as I’d planned.</h3>\n    <h2>Keep reading with a 7-day free trial</h2>\n    <p>Subscribe to Narratively to keep reading this post and get 7 days of free access to the full post archives.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.narratively.com/p/the-monk-who-ghosted-me\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-unexpected-challenges-of-dating-after-cancer",
    "title": "The Unexpected Challenges of Dating After Cancer",
    "category": "Stories-Nonfiction",
    "date": "2025-09-03",
    "excerpt": "It was such a joy to collaborate with Emma Roberts, Karah Preiss and the whole Belletrist team on the True Romance Writing Prize this year. After announcing the winners a few weeks ago, we’re excited to finally share the first piece of the bunch, the grand prize–winning essay …",
    "cover": "https://substack-post-media.s3.amazonaws.com/public/images/30054f86-5a2c-4ff6-93c6-e80ad5e8f7f7_2405x1718.jpeg",
    "source": "https://www.narratively.com/p/unexpected-challenges-dating-cancer",
    "author": "AventurOO Editorial",
    "body": "<h3>The chemo had miraculously worked, but Maggie Hart wanted to make sure 'this whole cancer thing' had not rendered her 'sexless and unlovable.' There was just one thing she needed to figure out first.</h3>\n<p>\n      <i>It was such a joy to collaborate with Emma Roberts, Karah Preiss and the whole Belletrist team on the  True Romance Writing Prize this year. After announcing the winners a few weeks ago, we’re excited to finally share the first piece of the bunch, the grand prize–winning essay in the shortread category, which comes to us from Maggie Hart. Maggie opened up a bit about writing this piece and others like it: “After I completed my chemo treatments, I felt awkward and ugly in my baldness, convinced I’d never be able to exist normally again, much less date. But finding small moments of humor and lightness helped me get through. I think lots of people view serious illness as something that only happens later in life, which just isn’t true — so I like sharing my stories about navigating the weirdness of cancer survival and young adulthood all at once.” Congratulations again, Maggie! And readers — you’re in for a treat. </i>\n    </p>\n<p>“I’m sorry,” I said to Nick, who stood staring at me in the dim light, his bare chest rising and falling with quickened breaths, his lips swollen from my kissing them. “It’s just that…well, I’ve been really racking my brain here, and I just don’t think there’s a sexy way to do this.”</p>\n<p>My fingers lingered at my forehead, on my hairline. My wig gripped my scalp like a barnacle on a boat, the scratchy fibers relentlessly digging into my skin, one of many small, manageable pains I had in those days. It had to come off for what was about to happen, I knew that. There was really no way around it. Leaving it on was impossible — I had a profoundly humbling vision of the wig abandoning ship mid-action, slipping loose and tumbling onto the floor in a sad, sweaty heap. It had also been quite an investment — although I still do not understand why a bunch of fake hair costs multiple hundreds of dollars — so I didn’t want it to get hopelessly matted. And what if, in the throes of passion, he forgot that the hair was fake and tried to <i>pull it</i>…</p>\n<p>No. No! Obviously, it had to come off. But <i>how, </i>exactly? I wished he’d look away, spare me, if only partially, from the humiliation of my baldification, the world’s least seductive strip tease.</p>\n<p>Nick smiled at me encouragingly. He was kind and tattooed and had long dark hair that was beginning to streak with gray. I’d never been with a man who had hair longer than mine, although, that winter, any man with any hair at all had hair longer than mine.</p>\n<p>Four months after my last round of chemotherapy, I decided that it was time I put myself out there, that I date. Why not? The chemo had, miraculously, worked. My blood counts were relatively normal, I hadn’t needed a platelet transfusion in weeks and my oncologists gave me the all-clear, so it was time that I shifted my attention away from my no-longer-imminent death to something much more invigorating: the pursuit of reassurance. I needed to know that my body worked, that I still knew how to have a conversation that was not about being sick, that this whole cancer thing had not rendered me sexless and unlovable at just 25 years old. So, I went where every woman in her 20s goes when she needs reassurance: the apps.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.narratively.com/p/unexpected-challenges-dating-cancer\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-july-edit-family-secrets-lifelong-regrets-and-new-classes",
    "title": "The July Edit: Family Secrets, Lifelong Regrets and New Classes",
    "category": "Stories-Nonfiction",
    "date": "2025-09-03",
    "excerpt": "July has been a busy month over at Narratively. We launched The Personals, a new series of sharply focused first-person stories that capture a single surprising unforgettable moment or event — and even pubbed a second story in the series. We also ran a special flash essay cont…",
    "cover": "https://substackcdn.com/image/fetch/$s_!hqMO!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffcd75dc3-11e2-4858-95ad-8b4061a9118b_1926x776.png",
    "source": "https://www.narratively.com/p/the-july-edit-family-secrets-lifelong-regrets-more",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>The July Edit: Family Secrets, Lifelong Regrets and New Classes</h1>\n    <h3>This month we're sharing some of the best of what Narratively and Narratively Academy have to offer, from moving memoir essays about love and loss, to a live chat about how to land a book deal + more.</h3>\n    <p>\n      <i>July has been a busy month over at Narratively. We  launched The Personals, a new series of sharply focused first-person stories that capture a single surprising unforgettable moment or event — and even pubbed a second story in the series. We also ran a special flash essay contest inspired by the live video chat between Lee Gutkind and Dinty W. Moore over at sister site , and announced the winners of our True Romance Writing Prize (stay tuned for those stories coming soon!). We wanted to share some of those stories below in case you missed them the first time around — and also give you a little taste of what we’ve been up to over at , our space for writers to get inspiration, pick up tips, exchange ideas and more. So, keep scrolling to read astounding stories, watch a seriously inspiring live video chat and learn about our August classes. </i>\n    </p>\n    <h3>\n      <strong>1. <a href=\"https://www.narratively.com/p/letter-to-my-teenage-self-saved-power-words?utm_source=publication-search\">Letter to My Teenage Self: You Will Be Saved by the Power of Your Words</a></strong>\n    </h3>\n    <p>\n      <a href=\"https://www.narratively.com/p/letter-to-my-teenage-self-saved-power-words?utm_source=publication-search\">Letter to My Teenage Self: You Will Be Saved by the Power of Your Words</a>\n    </p>\n    <p>\n      <i>Sixteen years after going to prison, Kwaneta Harris tells her 13-year-old self everything she wished she knew sooner.</i>\n    </p>\n    <p>Story by Kwaneta Harris</p>\n    <h3>\n      <strong>2. <a href=\"https://www.narratively.com/p/last-breath-she-said-no\">I Wanted to Watch Him Take His Last Breath—But She Said No</a></strong>\n    </h3>\n    <p>\n      <a href=\"https://www.narratively.com/p/last-breath-she-said-no\">I Wanted to Watch Him Take His Last Breath—But She Said No</a>\n    </p>\n    <p>\n      <i>My stepmother and I never got along, but not allowing me to be by dad’s side while he was dying crossed a line. I've regretted not standing up to her ever since.</i>\n    </p>\n    <p>Story by Jen Shepherd</p>\n    <h3>\n      <strong>3. <a href=\"https://www.narrativelyacademy.com/p/watch-novelist-kern-carter-on-landing\">WATCH: Novelist Kern Carter on Landing the Book Deal…and What Comes Next</a></strong>\n    </h3>\n    <p>\n      <a href=\"https://www.narrativelyacademy.com/p/watch-novelist-kern-carter-on-landing\">WATCH: Novelist Kern Carter on Landing the Book Deal…and What Comes Next</a>\n    </p>\n    <p>\n      <i>The prolific author chats about how he went from self-publishing novels to inking six book deals—opening about how to query agents, perfect your pitch, and much more.</i>\n    </p>\n    <p>Live video from Kern Carter and Brendan Spiegel over at</p>\n    <h3>\n      <strong>4. <a href=\"https://www.narratively.com/p/the-man-who-betrayed-me-also-loved-me\">The Man Who Betrayed Me Was Also the Man Who Loved Me</a></strong>\n    </h3>\n    <p>\n      <a href=\"https://www.narratively.com/p/the-man-who-betrayed-me-also-loved-me\">The Man Who Betrayed Me Was Also the Man Who Loved Me</a>\n    </p>\n    <p>\n      <i>I came out of the closet in the throes of the AIDS epidemic and fell for someone I thought was a safe harbor. The blurred lines between his love and his lies have haunted me the rest of my life.</i>\n    </p>\n    <p>Story by J Martin</p>\n    <h3>\n      <strong>5. <a href=\"https://www.narratively.com/p/unburying-my-mothers-secret\">Unburying My Mother’s Secret</a> </strong>\n    </h3>\n    <p>\n      <a href=\"https://www.narratively.com/p/unburying-my-mothers-secret\">Unburying My Mother’s Secret</a>\n    </p>\n    <p>\n      <i>In the last years of her life, a sudden revelation upended my entire image of my mom. It took a decade after her death—and another major life change—for me to see that both versions of her were real.</i>\n    </p>\n    <p>Story by Cathy Alter</p>\n    <h3>\n      <strong>6. <a href=\"https://www.narrativelyacademy.com/p/narratively-academy-classes\">Summer 2025 Classes</a></strong>\n    </h3>\n    <p>\n      <a href=\"https://www.narrativelyacademy.com/p/narratively-academy-classes\">Summer 2025 Classes</a>\n    </p>\n    <p>\n      <i>Ready to tell your story? We’d love to help! Over at  we have two amazing classes coming up in August, a three-part workshop from memoirist and poet Rebecca Evans called  Untangling the Traumatic Narrative: Using Words to Access Our Wounds, and How to Write About Social Issues in Unprecedented Times from Pushcart Prize-nominated writer Kavita Das. Just a reminder that paid subscribers to Narratively Academy get 20% off all classes. Click here to become a paid subscriber today. (If you already are a paid subscriber, email academy@narratively.com for the paid subscriber promo code.)</i>\n    </p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.narratively.com/p/the-july-edit-family-secrets-lifelong-regrets-more\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "unburying-my-mother-s-secret",
    "title": "Unburying My Mother’s Secret",
    "category": "Stories-Nonfiction",
    "date": "2025-09-03",
    "excerpt": "Last week, we kicked off our new series, The Personals, with an excellent piece from J Martin about love and loss and everything between. This week, we’re bringing you another Personals story that we’re super excited about, this one from essayist Cathy Alter. And wouldn’t you …",
    "cover": "https://substack-post-media.s3.amazonaws.com/public/images/1e2ad9e9-39fc-405f-9f92-ee9afd1bf420_4200x3000.jpeg",
    "source": "https://www.narratively.com/p/unburying-my-mothers-secret",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <h1>Unburying My Mother’s Secret</h1>\n    <h3>In the last years of her life, a sudden revelation upended my entire image of my mom. It took a decade after her death—and another major life change—for me to see that both versions of her were real.</h3>\n    <p><i>Last week, we kicked off our new series,  The Personals, with an excellent piece from J Martin about love and loss and everything between. This week, we’re bringing you another Personals story that we’re super excited about, this one from essayist Cathy Alter. And wouldn’t you know it, love and loss are also key themes.</i> 🙂 </p>\n    <p>\n      <i>Without further ado…enjoy!</i>\n    </p>\n    <h2>Keep reading with a 7-day free trial</h2>\n    <p>Subscribe to Narratively to keep reading this post and get 7 days of free access to the full post archives.</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://www.narratively.com/p/unburying-my-mothers-secret\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "the-environmental-justice-movement-isn-t-going-anywhere-even-as-it-fac",
    "title": "The Environmental Justice Movement Isn’t Going Anywhere — Even As It Faces Attacks by Trump",
    "category": "Stories-Personal",
    "date": "2025-09-03",
    "excerpt": "University of Michigan )",
    "cover": "https://thestoryexchange.org/wp-content/uploads/2025/09/Jalonne-White-Newsome-Donald-Trump.jpg",
    "source": "https://thestoryexchange.org/the-environmental-justice-movement-isnt-going-anywhere-even-as-it-faces-attacks-by-trump/",
    "author": "AventurOO Editorial",
    "body": "<p><a href=\"https://sph.umich.edu/pursuit/2020posts/MLK_JalonneWhiteNewsome.html\">University of Michigan</a>)</p>\n<p><a href=\"https://19thnews.org/2025/02/environmental-justice-movement-trump-executive-orders?utm_source=partner&amp;utm_medium=referral&amp;utm_campaign=19th-republishing&amp;utm_content=/2025/02/environmental-justice-movement-trump-executive-orders\">This story</a> was originally reported by Jessica Kutz of <a href=\"https://19thnews.org/?utm_source=partner&amp;utm_medium=referral&amp;utm_campaign=19th-republishing&amp;utm_content=/2025/02/environmental-justice-movement-trump-executive-orders\">The 19th</a>. <a href=\"https://19thnews.org/author/jessica-kutz?utm_source=partner&amp;utm_medium=referral&amp;utm_campaign=19th-republishing&amp;utm_content=/2025/02/environmental-justice-movement-trump-executive-orders\"> Meet Jessica and read more of her reporting on gender, politics and policy</a>.</p>\n<p>Under the Biden administration, the environmental justice movement had a historic platform to bring clean water and air to communities that have suffered from pollution. It was a boon to the grassroots movement, which started in the 1980s in response to a pattern of permitting landfills and polluting industries in neighborhoods that were disproportionately Black, Brown and low-income.</p>\n<p>In the past four years, advisory councils were created — with many of the positions filled by women of color, who have long been leaders in environmental justice spaces — and offices opened to spearhead the work on the federal level. During that time, the administration also <a href=\"https://content.govdelivery.com/accounts/USEPAIAQ/bulletins/37c321b\">earmarked billions of dollars</a> to address longstanding environmental issues, and to help these communities adapt to the climate crisis.</p>\n<p>But as President Donald Trump took office for a second time, all that momentum at the federal level disappeared, seemingly overnight. An executive order issued on inauguration day took aim at dismantling diversity, equity and inclusion initiatives, and environmental justice. As a result, any mention of the work is being scrubbed from government websites and funding has been paused.</p>\n<p>For Jalonne White-Newsome, who led the first ever office on environmental justice in the White House, the shift has been jarring if not unexpected. Still, she’s not undaunted. Through her over three decades of working in environmental justice — starting from her youth in Detroit, Michigan — there is one thing she knows: The movement, at its core, is driven by everyday people who will continue to advocate for their communities.</p>\n<p>“Environmental justice did not start with the federal government,” she said. “Nor will it end with the federal government.”</p>\n<p>The 19th spoke with White-Newsome, formerly the federal environmental justice officer for the White House Council on Environmental Quality, about the Trump administration’s recent attacks on her work and how the movement responds now.</p>\n<p><i>This interview has been edited for length and clarity. </i></p>\n<h3><strong>Jessica Kutz: What is it like to see the new administration issue executive orders aimed at dismantling environmental justice, work that you played a part in implementing?</strong></h3>\n<p>Jalonne White-Newsome: I mean, it’s crushing, right? It is offensive. It’s really hard because we have really tried to work hard over these past four years to create a foundation that our federal family could build on.To see a lot of that dismantled, to see our information wiped off websites, to really try and eliminate the trace of any environmental justice work, it’s very frustrating.</p>\n<h3><strong>How do you think this pull back in funding will affect the momentum of the movement? Is there work that was done under Biden that might be protected from this shift? </strong></h3>\n<p>I’ve had so many community leaders over the past couple years come up to me, folks that have been in the movement for decades and decades, to say there has never been this amount of funding and resources to support environmental justice.</p>\n<p>And so our agency partners worked really, really hard to try and get as much money out as possible [before the Trump administration]. I mean, they were grinding very hard.</p>\n<p>I know there are groups that are positioning to make sure that communities can keep the funds that were obligated to them. So that is happening right now. Where it gets sticky is some of the funds were kind of in that period of not being obligated. [Especially with] the current administration’s review of anything that remotely thinks, talks or looks like equity or environmental justice.</p>\n<p>I’m not a lawyer. Is that legal? Can they actually do that? I don’t know. But it’s a fear tactic, right? And they’re trying to cause fear and confusion, and they have been successful. But we have great partners that have a lot of knowledge and passion that are going to protect our folks that have received these funds to continue to do the great work that they’re doing on the ground.</p>\n<h3><strong>What are your concerns about this political shift away from DEI and environmental justice work? </strong></h3>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://thestoryexchange.org/the-environmental-justice-movement-isnt-going-anywhere-even-as-it-faces-attacks-by-trump/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "know-a-trailblazing-woman-scientist-nominate-her-for-our-cutting-edge-",
    "title": "Know a Trailblazing Woman Scientist? Nominate Her for Our ‘Cutting-Edge Women in Science’ List",
    "category": "Stories-Personal",
    "date": "2025-09-03",
    "excerpt": "The Story Exchange , an award-winning nonprofit media platform dedicated to elevating women’s voices, is seeking nominations for its Cutting-Edge Women in Science list.",
    "cover": "https://thestoryexchange.org/wp-content/uploads/2025/06/julia-koblitz-f4jc67ICvzQ-unsplash-1.jpg",
    "source": "https://thestoryexchange.org/know-a-trailblazing-woman-scientist-nominate-her-for-our-cutting-edge-women-in-science-list/",
    "author": "AventurOO Editorial",
    "body": "<html>\n  <body>\n    <graphic src=\"https://thestoryexchange.org/wp-content/uploads/2025/06/julia-koblitz-f4jc67ICvzQ-unsplash-1-1024x779.jpg\" alt=\"We want to hear about the women scientists who are racing against the clock to adapt our world to the dangers of climate change. (Credit: Julia Koblitz on Unsplash)\"/>\n    <p><a href=\"https://thestoryexchange.org/about-us/\">The Story Exchange</a>, an award-winning nonprofit media platform dedicated to elevating women’s voices, is seeking nominations for its Cutting-Edge Women in Science list. </p>\n    <p>The list will spotlight U.S.-based women with a deep background in science whose work is driven by the dangerous realities of the climate crisis. We are specifically looking for women who are motivated to find urgent, innovative, science-based solutions as global warming impacts the safety of our <a href=\"https://thestoryexchange.org/announcing-winners-women-in-science-incentive-prize/\">water</a>, <a href=\"https://thestoryexchange.org/meet-the-winners-of-our-2022-women-in-science-incentive-prize/\">air</a> and <a href=\"https://thestoryexchange.org/2023-women-in-science-incentive-prize-winners/\">soil</a>; disrupts <a href=\"https://thestoryexchange.org/once-nasas-dream-a-food-startup-is-making-air-protein-a-reality/\">food systems</a> and <a href=\"https://thestoryexchange.org/terrifying-weather-events-podcast/\">communities</a>; and poses significant threats to <a href=\"https://thestoryexchange.org/the-woman-who-wants-to-change-the-way-we-see-forests/\">biodiversity</a> and <a href=\"https://thestoryexchange.org/how-an-organic-farm-hopes-to-heal-the-land/\">ecosystems</a>. </p>\n    <p>“We particularly encourage nominations of early- and mid-career female scientists, whose work might benefit the most from this recognition,” said Sue Williams, executive director of The Story Exchange. “Our mission is to support and highlight these remarkable professionals, at a time when women – and especially women in STEM fields – still face barriers to advancement.”</p>\n    <p>The focus on women also comes as more research indicates that women are disproportionately impacted by climate change. An Association of American Medical Colleges <a href=\"https://thestoryexchange.org/how-extreme-weather-events-put-women-at-risk/\">analysis</a> in 2024 found that women around the world are more likely to experience injury and death as a result of catastrophic weather events, often in the form of pregnancy complications and sexual violence. UN Climate Change earlier this year <a href=\"https://thestoryexchange.org/why-climate-action-needs-to-focus-on-women/\">called</a> for more integration of gender into climate policy and action. </p>\n    <p>The 2025 Cutting-Edge Women in Science list will be chosen based on nominations from members of the scientific community and an assessment by The Story Exchange editors. Final picks will be recognized this fall on our site, shared with media partners, and potentially featured in video and podcasts. As an example, please see our <a href=\"https://thestoryexchange.org/as-great-salt-lake-dries-dust-is-new-danger/\">video</a> (below) and <a href=\"https://thestoryexchange.org/how-do-we-deal-with-bad-air-quality/\">podcast</a> on Kerry Kelly, a University of Utah professor of chemical engineering who is an expert on air quality and the founder of Tellus, a maker of air quality sensors.</p>\n    <p>To nominate a candidate, please head to <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSclj2iY0OMhGugTA4mIrXx9Dyb_0uIOwGULY-MZPkBUsEa0HA/viewform\">our form</a>. Please note: You cannot nominate yourself. </p>\n    <p>Candidates must be U.S.-based scientists with advanced degrees in the fields of physics, chemistry, engineering, biology, agronomy, environmental science, meteorology or closely related fields; or entrepreneurs with advanced degrees who are creating science-based products and technologies to help mitigate/reduce the impact of climate change through innovative practices.</p>\n    <p>“For many years, we have highlighted the incredible accomplishments of women in science, who are often racing against the clock to adapt our world to the dangers of climate change,” said Victoria Wang, co-founder of The Story Exchange. “At a time when there is little reason to be optimistic about the environment, these women stand out as beacons of hope.” ◼️</p>\n  </body>\n</html>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://thestoryexchange.org/know-a-trailblazing-woman-scientist-nominate-her-for-our-cutting-edge-women-in-science-list/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "conservatives-want-more-kids-yet-offer-only-prayers-when-kids-are-gunn",
    "title": "Conservatives Want More Kids – Yet Offer Only Prayers When Kids Are Gunned Down",
    "category": "Stories-Personal",
    "date": "2025-09-03",
    "excerpt": "Earlier this year , the Trump administration launched a crusade to address falling birth rates in the United States, which they and other conservatives view as a matter of grave concern.",
    "cover": "https://thestoryexchange.org/wp-content/uploads/2025/08/Donald-Trump-Conservatives-Shool-Shooting-Gun-Violence.jpg",
    "source": "https://thestoryexchange.org/conservatives-want-more-kids-yet-offer-only-prayers-when-kids-are-gunned-down/",
    "author": "AventurOO Editorial",
    "body": "<p><a href=\"https://thestoryexchange.org/worried-over-womens-disinterest-in-motherhood-make-it-something-wed-want/\">Earlier this year</a>, the Trump administration launched a crusade to address falling birth rates in the United States, which they and other conservatives view as a matter of grave concern.</p>\n<p>In order to galvanize families, and women in particular, into having more kids, they proposed everything from $5,000 birthing bonuses to menstruation classes, so people could better track their ovulation cycles – instead of universal childcare, or other forms of study-backed, government-subsidized assistance.</p>\n<p>And none of their proposals involved <a href=\"https://thestoryexchange.org/sandy-hook-scarlett-lewis-choose-love/\">protecting our children</a> from the gun violence that continues to plague the U.S., to a degree <a href=\"https://www.commonwealthfund.org/publications/2024/oct/comparing-deaths-gun-violence-us-other-countries\">unheard of</a> anywhere else in the world. </p>\n<p>We’ve been reminded, this week, of how dangerous our <a href=\"https://thestoryexchange.org/u-s-education-is-under-attack-a-new-battle-in-a-long-war-but-women-are-resisting/\">schools</a> are because of this problem, by a gutting <a href=\"https://thestoryexchange.org/shocked-by-school-shootings-an-artist-brings-back-playground-from-hell/\">mass shooting</a> in Minneapolis. As of publication, two children died – ages 8 and 10 – and 17 people were injured when suspect Robin Westman (who also died, of a self-inflicted gunshot wound) opened fire during a morning mass at the city’s Annunciation Catholic School.</p>\n<p>Of the 17 who were hurt, <a href=\"https://www.bbc.com/news/articles/cy40znde9eko\">14 were kids</a>. Some of them were as young as 6 years old.</p>\n<p>“These were American families,” Minneapolis Mayor Jacob Frey said during a press briefing. “Don’t just say this is about ‘thoughts and prayers’ right now. These kids were literally praying.”</p>\n<p>Yet that’s largely what conservatives, including President Donald Trump, had to offer in the wake of the attack. “Please join me in praying for everyone involved,” <a href=\"https://www.cbsnews.com/minnesota/news/shooting-annunciation-church-minneapolis/\">Trump wrote</a> on Truth Social, with Vice President JD Vance offering a similar call. “My prayers are with everyone involved in this tragedy,” Attorney General Pam Bondi also <a href=\"https://x.com/AGPamBondi/status/1960716027131519061\">posted</a>.</p>\n<p>The solution to our <a href=\"https://www.apha.org/topics-and-issues/gun-violence\">gun-violence epidemic</a> should be to pass more stringent gun laws. Experts have found that the <a href=\"https://rockinst.org/blog/more-guns-more-death-the-fundamental-fact-that-supports-a-comprehensive-approach-to-reducing-gun-violence-in-america/\">sheer tonnage</a> of guns available in the U.S., and <a href=\"https://www.americanprogress.org/article/debunking-the-guns-make-us-safer-myth/\">the ease</a> with which they can be purchased, makes ours a deadlier, more dangerous nation to live in. And <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC11381453/\">study</a> after <a href=\"https://everytownresearch.org/rankings/\">study</a> has shown that gun violence could be curbed significantly through policy prescriptions.</p>\n<p>But for this particular shooting, after praying for peace, conservatives found an alternative scapegoat: Transgender people. Despite the fact that the <i>vast</i> majority of mass shootings are <a href=\"https://www.reuters.com/article/fact-check/majority-of-us-mass-shooters-are-cis-men-not-transgender-or-non-binary-people-idUSL1N363273/\">committed by cisgender men</a>, Westman was a trans woman, so some are using this shooting to <a href=\"https://www.nytimes.com/2025/08/27/us/minneapolis-school-shooting-suspect-gunman.html\">further anti-trans agendas</a>.</p>\n<p>Attacking a community that is <a href=\"https://glaad.org/trump-accountability-tracker/\">already subject</a> to extreme discrimination, while refusing to enact legislation that would see gun violence lessened, and then offering boiler-plate calls for prayer in the aftermath… None of this does anything to actually help the children they claim to want, the children they claim to care about. </p>\n<p>None of this helped 10-year-old Weston Halsne, who survived the Minneapolis shooting because his equally-young friend <a href=\"https://www.cbsnews.com/minnesota/news/minneapolis-mass-shooting-catholic-school-survivor-friend/\">shielded him from gunfire</a>, and was injured in the process. “It was like, shots fired, and then we kind of, like, got under pews,” he recalled to members of the press. “They shot through the stained glass windows I think, and it was really scary.”</p>\n<p>Weston added that was praying for his friend’s recovery – because it’s the only recourse he, a traumatized child, has in the U.S., where people with the power to enact laws that would protect children from shootings like this <a href=\"https://www.thetrace.org/2025/06/big-beautiful-bill-atf-silencer-gun-laws/\">fail to do so</a> over and over again. </p>\n<p>Conservative politicians and pundits continue to pressure women to bring more lives like Weston’s into this world, into this country – while at the same time demonstrating a refusal to even<i> try</i> to keep them safe. <a href=\"https://www.security.org/blog/a-timeline-of-school-shootings-since-columbine/\">Over 400 school shootings</a> have taken place in the U.S. since the 1999 <a href=\"https://en.wikipedia.org/wiki/Columbine_High_School_massacre\">Columbine High School massacre</a>, with dozens killed, hundreds injured and thousands traumatized by these attacks.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://thestoryexchange.org/conservatives-want-more-kids-yet-offer-only-prayers-when-kids-are-gunned-down/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "suspending-monthly-economic-reports-would-be-really-bad-for-women-of-c",
    "title": "Suspending Monthly Economic Reports Would Be Really Bad for Women of Color",
    "category": "Stories-Personal",
    "date": "2025-09-03",
    "excerpt": "Pexels )",
    "cover": "https://thestoryexchange.org/wp-content/uploads/2025/08/Women-of-Color-Jobs-Reports-Trump.jpg",
    "source": "https://thestoryexchange.org/suspending-monthly-economic-reports-would-be-really-bad-for-women-of-color/",
    "author": "AventurOO Editorial",
    "body": "<p><a href=\"https://www.pexels.com/photo/stressed-woman-working-at-office-12911768/\">Pexels</a>)</p>\n<p><a href=\"https://19thnews.org/2025/08/suspending-monthly-jobs-reports-impacts-women-of-color?utm_source=partner&amp;utm_medium=referral&amp;utm_campaign=19th-republishing&amp;utm_content=/2025/08/suspending-monthly-jobs-reports-impacts-women-of-color\">This story</a> was originally reported by Chabeli Carrazana of <a href=\"https://19thnews.org/?utm_source=partner&amp;utm_medium=referral&amp;utm_campaign=19th-republishing&amp;utm_content=/2025/08/suspending-monthly-jobs-reports-impacts-women-of-color\">The 19th</a>. <a href=\"https://19thnews.org/author/chabeli-carrazana?utm_source=partner&amp;utm_medium=referral&amp;utm_campaign=19th-republishing&amp;utm_content=/2025/08/suspending-monthly-jobs-reports-impacts-women-of-color\"> Meet Chabeli and read more of her reporting on gender, politics and policy</a>.</p>\n<p>Reliably on the first Friday of every month for the past 50 years, the U.S. Bureau of Labor Statistics (BLS) has released data on how women of color are faring in the economy. It’s the only timely source of this demographic-level data.</p>\n<p>Without it, economists and policymakers would have no way of knowing how economic policy is affecting marginalized groups of workers in real time. They’d be flying blind on how to help them.</p>\n<p>But that’s just what President Donald Trump’s nominee to run the bureau is suggesting doing.</p>\n<p>On August 1, Trump fired the head of the bureau, Erika McEntarfer, after BLS published one of the largest revisions to its data in decades. The revision showed that the economy was in fact weaker than previously reported, leading Trump to accuse McEntarfer of tampering with the data to make his administration look bad.</p>\n<p>Revisions of economic data have also always been part of how BLS, an independent and nonpartisan agency, functions. The data is collected from surveys of employers and households, and then published in three waves. The surveys are voluntary, so not all responses come in on time. BLS publishes an initial release and then revises in the subsequent two months as more responses come in. It’s done this way to ensure that markets and economists get real-time data on the economy. Since the pandemic, BLS has been struggling with lagging response rates and a rapidly changing economy that has led to larger revisions.</p>\n<p>The reports are still considered one of the most reliable sources of U.S. economic data in the world.</p>\n<p>McEntarfer, who was appointed by former President Joe Biden and was confirmed in a nearly unanimous Senate vote, is a widely respected economist who had worked in the federal government under multiple administrations. Trump’s nominee to replace her, E.J. Antoni, is an economist at the conservative think tank the Heritage Foundation who <a href=\"https://static.heritage.org/project2025/2025_MandateForLeadership_FULL.pdf\">contributed</a> <a href=\"https://bsky.app/profile/thebulwark.com/post/3lwen55jkbk25\">to Project 2025</a>. Discussing the employment data <a href=\"https://www.foxbusiness.com/politics/trumps-bls-pick-could-pause-monthly-jobs-report-over-accuracy-concerns\">earlier this month</a>, Antoni suggested that until the data is “corrected,” “the BLS should suspend issuing the monthly job reports but keep publishing the more accurate, though less timely, quarterly data.” </p>\n<p>White House Press Secretary Karoline Leavitt said earlier this week that the Trump administration had noted Antoni’s suggestions but intended to continue issuing the monthly reports.</p>\n<p>“I believe that is the plan, and that’s the hope, and that these monthly reports will be data that the American people can trust,” Leavitt said.</p>\n<p>Losing timely economic data, particularly at a time when the economy is showing signs of softening, is bad for every group, economists told The 19th. But it could disproportionately impact women and women of color, who are often the first to feel the impact of weakness in the economy and serve as a bellwether of what is to come.</p>\n<p>“The household survey is really the only source for intersectional employment data on a monthly basis. That means that for groups of women we and others have been watching especially closely during this period — for example, disabled women, Black women, women veterans — timely information about these groups would disappear,” said Katherine Gallagher Robbins, a senior fellow at the National Partnership for Women &amp; Families who routinely analyzes the data.</p>\n<p>The National Women’s Law Center, which also publishes its monthly analysis of women in the workforce using BLS’ data, said in a statement that “losing this impartial data will undermine efforts to improve women’s economic wellbeing, damage the credibility and reliability of data coming from the Bureau of Labor Statistics, and hurt overall efforts to objectively assess the health of our economy.”</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://thestoryexchange.org/suspending-monthly-economic-reports-would-be-really-bad-for-women-of-color/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "it-s-hot-as-heck-here-are-7-summery-beverages-to-beat-the-heat",
    "title": "It’s Hot As Heck. Here Are 7 Summery Beverages to Beat the Heat",
    "category": "Stories-Personal",
    "date": "2025-09-03",
    "excerpt": "Drink Besa’s fruit punch flavored hard seltzer. (Credit: Courtesy of Drink Besa)",
    "cover": "https://thestoryexchange.org/wp-content/uploads/2024/07/web_Besa-mi-vino_r1_POUR.jpg",
    "source": "https://thestoryexchange.org/the-best-summer-beverages-to-beat-the-heat/",
    "author": "AventurOO Editorial",
    "body": "<p>\n      <i>Drink Besa’s fruit punch flavored hard seltzer. (Credit: Courtesy of Drink Besa)</i>\n    </p>\n<p>Summer has arrived. And with it, higher than ever temperatures, thanks to heat waves and rather ominous-sounding weather phenomenons like the <a href=\"https://abcnews.go.com/US/heat-dome-100-million-people-27-states-extreme-heat-tornado-warnings-forecasts/story?id=111347390\">heat dome</a>. As temperatures soar from the East Coast to the West Coast, and folks gather for summer BBQs, backyard gatherings, beach trips and pool days – ice cold beverages will be a necessity. <br/>So we’ve compiled a list of summertime drinks from female entrepreneurs whose startup stories we’ve enjoyed – and who we think you should get to know. From rosé, to flavored seltzers, to functional beverages packed with minerals and adaptogens,  there’s something here for everyone at the party to enjoy.</p>\n<p>\n      <i>(All images courtesy of the companies.)</i>\n    </p>\n<h2>Drink Besa</h2>\n<p>Tori Brodsky has been leading the helm of <a href=\"https://drinkbesa.com/\">Drink Besa</a> since 2022. With a background in nutrition science, she became interested in making convenient drinks with quality ingredients, such as canned wine that’s, in fact, pretty darn good (we tried the “sexy and bright” <a href=\"https://drinkbesa.com/product/just-right-white/\">white wine</a>). Drink Besa also offers a line of hard seltzers, which it says are among the first on the market to use organic wine instead of malt liquor or spirits. The 5% ABV drink comes in three flavors – peach, fruit punch, and citrus – and is, according to Brodksy, “the ideal summer beverage: Delicious, premium, and truly unique.”</p>\n<h2>Bow &amp; Arrow Brewing Co.</h2>\n<p>“We didn’t set out to be the first <a href=\"https://thestoryexchange.org/a-native-owned-brewery-inspired-by-the-southwest/\">Native-woman-owned brewery</a> in the United States, but I’m told we are,” says Shyla Sheppard, founder of <a href=\"https://www.bowandarrowbrewing.com/\">Bow &amp; Arrow Brewing Co</a>. She and her partner, Missy Begay, take inspiration from the American Southwest, incorporating traditional Indigenous ingredients into their craft beers. Their beers, like “Dance In and Out of The Beams of a Neon Moon” (a fruity IPA), and “Cactuscolada” (a Pina Colada-inspired sour ale) are available in their Albuquerque, New Mexico, tap room  – where they are served cold straight from the tap – as well as <a href=\"https://www.bowandarrowbrewing.com/find-our-beer\">other locations</a>. </p>\n<h2>Heti</h2>\n<p>Dana Thompson, who built the celebrated <a href=\"https://thestoryexchange.org/owamni-indigenous-cuisine-healing/\">Owamni</a> restaurant, is now turning her attention to the functional beverage space. Her new business, <a href=\"https://thestoryexchange.org/dana-thompson-heti-drinks/\">Heti</a>, is a health-conscious brand selling low-dose THC beverages. The name itself means “home” in Dakota; Thompson is a direct descendant of the tribe through her mother. Evoking a sense of place — and the flavors of home — is intentional. “I wanted something that resonated with what the people I know were asking for,” Thompson told The Story Exchange in a recent interview, especially women who wanted to relax with something other than wine. There is a home-related social-impact component to her business model in the works, as Thompson also plans to create hempcrete housing on tribal lands with some of the profits.</p>\n<h2>Trois Noix</h2>\n<p><a href=\"https://thestoryexchange.org/jaime-araujo-trois-noix/\">Jaime Araujo</a> says her Napa Valley winery, <a href=\"https://troisnoixwine.com/\">Trois Noix</a>, was born from a lifelong love of wine. She’s not only passionate about what ends up in the bottle, “but also how it got there, what happens when it fills your glass, and how it can bring a table of people together.” And how’s this for a summertime drink: The winery’s Sonoma Valley Rosé, made from pinot noir, contains aromas of papaya, just-ripe strawberry, and crushed rose petals. Reviewers on wine app <a href=\"https://www.vivino.com/US/en/trois-noix-rose-of-pinot-noir/w/9858056?year=2021\">Vivino</a> called it “light-bodied with a tart plum finish” and “very refreshing.” Trois Noix recommends pairing with grilled seafood and summer vegetables … or just sipping on its own, if you don’t have grand cooking plans on the hazy horizon. </p>\n<h2>All Phenoms</h2>\n<p><a href=\"https://thestoryexchange.org/cristina-kown-all-phenoms/\">Cristina Kown’s</a> sparkling waters, <a href=\"https://allphenoms.com/\">All Phenoms</a>, are packed with organic fruits and filled with vitamins, adaptogens, minerals, prebiotics and probiotics. Her aim? To offer a super healthy alternative to sugary sodas. The Redondo Beach, California-based entrepreneur is a self-proclaimed healthy beverage fan – but was dismayed that most of the drinks on the market contained tons of sugar, or low-quality ingredients. We imagine All Phenoms drinks in flavors like berry hibiscus, citrus ginger and mango lemongrass would do a good job of keeping you sufficiently hydrated at any sweltering gathering. </p>\n<h2>Boyd Cru</h2>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://thestoryexchange.org/the-best-summer-beverages-to-beat-the-heat/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "each-piece-of-her-furniture-is-tailored-to-clients-tastes",
    "title": "Each Piece of Her Furniture is Tailored to Clients’ Tastes",
    "category": "Stories-Personal",
    "date": "2025-09-03",
    "excerpt": "Charlotte Wissel, founder of Artemis Virtu. (Credit: Courtesy of Artemis Virtu)",
    "cover": "https://thestoryexchange.org/wp-content/uploads/2025/08/Charlotte-Wissel-e1756202128990.jpeg",
    "source": "https://thestoryexchange.org/charlotte-wissel-artemis-virtu/",
    "author": "AventurOO Editorial",
    "body": "<p>Charlotte Wissel, founder of Artemis Virtu. (Credit: Courtesy of Artemis Virtu)</p>\n<p>Charlotte Wissel’s design company, Artemis Virtu, collaborates with customers on crafting furniture that’s made to suit their individual tastes.</p>\n<p><strong>For Charlotte Wissel, </strong><strong>furniture</strong><strong> has always been about more than function or necessity – it’s also an alternative form of expression. Wissel told us, “I see each piece as a blank canvas with the potential to become a work of art.” In 2020, the Fort Lauderdale, Florida, designer launched her company, </strong><strong>Artemis Virtu</strong><strong>, through which she aims to combine craftsmanship, storytelling and bold design into something tangible and lasting. Wissel also takes upholstery to another level by integrating custom materials and original artwork into every project. </strong></p>\n<p><i>Here’s our lightly edited Q&amp;A, from</i><i> </i><i>The Story Exchange 1,000+ Stories Project</i><i>.</i></p>\n<h3><strong>How is your business different from others in your industry?</strong></h3>\n<p>We treat upholstery as an art form, not just a service. While many upholstery businesses focus solely on repair or restoration, our work goes far beyond function — we design statement pieces that transform a space. We’re not just reupholstering furniture; we’re creating one-of-a-kind pieces that reflect the client’s vision, style and story.</p>\n<h3><strong>Tell us about your biggest success so far. </strong></h3>\n<p>Seeing my work featured in homes I never imagined I’d have the opportunity to be part of. Over the past year, I’ve had the honor of creating custom pieces for private clients whose taste and stature I deeply admire — individuals I never expected to connect with, let alone have my artwork in their personal spaces.</p>\n<h3><strong>What is your top challenge and how have you addressed it?</strong></h3>\n<p>Like many creatives-turned-entrepreneurs, I quickly learned that talent alone isn’t enough to build a business. One of my first challenges was navigating the startup phase — figuring out pricing, sourcing materials and positioning myself in a niche market. I had to learn how to run a business while still being the creative force behind every piece, which meant wearing many hats and making decisions that didn’t always come naturally at first.</p>\n<p>As the business began to grow, scaling up became the next big hurdle. I found myself reaching capacity quickly, with more requests than I could handle solo. It forced me to evaluate how I could grow without compromising the quality or uniqueness of my work. I’ve since streamlined my process, established stronger boundaries around production timelines, and begun forming partnerships that allow me to take on more without losing the personal touch.</p>\n<h3><strong>Have you experienced any significant personal situations that affected your business decisions? </strong></h3>\n<p>As we began to gain traction, I was thrilled to see demand increase. I hired staff, took on large-scale projects, and worked with designers on high-volume orders. On the surface, it looked like success — but in reality, I found myself drifting further and further from the soul of what I had created.</p>\n<p>Many of the pieces I was producing no longer felt like mine. I was executing someone else’s vision, with little input or creative freedom, simply because they had seen my past work and wanted me to replicate it. It became clear that I was on the verge of turning my studio into a production line, and that was never what I wanted this business to be. So, I made the conscious decision to recalibrate — to scale with intention, not volume.</p>\n<h3><strong>What is your biggest tip for other startup entrepreneurs? </strong></h3>\n<p>Trust your instinct and protect your craft. In the early stages, it’s easy to feel pulled in every direction by trends, advice or what you think people want from you. But your vision is the core of your business – it’s what will set you apart.</p>\n<h3><strong>How do you find inspiration on your darkest days?</strong></h3>\n<p>I’ve learned to take a step back and reconnect with my “why.” I reflect on the pieces I’m most proud of, the clients who trusted me with their vision, and the moments that reminded me that I’m doing what I love.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://thestoryexchange.org/charlotte-wissel-artemis-virtu/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "escape-pod-1008-observer-effects-flashback-friday",
    "title": "Escape Pod 1008: Observer Effects (Flashback Friday)",
    "category": "Stories-Fantasy",
    "date": "2025-09-03",
    "excerpt": "Escape Pod is proud to say that we have partnered with Sleepphones headphones to provide a special Escape Pod branded set of headphones.",
    "cover": "https://escapepod.org/wp-content/uploads/2021/01/cropped-EscapePod_banner_1280.jpg",
    "source": "https://escapepod.org/2025/08/28/escape-pod-1008-observer-effects-flashback-friday/",
    "author": "AventurOO Editorial",
    "body": "<h2>Escape Pod 1008: Observer Effects (Flashback Friday)</h2>\n<h3>Show Notes</h3>\n<p>Escape Pod is proud to say that we have partnered with <a href=\"https://www.sleepphones.com/?aff=1018\">Sleepphones headphones</a> to provide a special Escape Pod branded set of headphones.</p>\n<p>SleepPhones® headphones are soft headphones that you can wear while you sleep. In fact, Marguerite has a pair she wears on international flights. They’re comfortable, slim and essentially ‘headphones in a headband’. So you put it on, unplug and surround yourself in an ultimate sound experience – without disturbing, or being disturbed by, the person next to you. SleepPhones® headphones were designed by a family doctor and provide wearable comfort that’s literally music to your ears and they’re available with both standard 3.5mm audio jacks and Bluetooth.</p>\n<p>They’re easy to clean, comfortable and now you can get them with our logo on the headband! And you can get a 10% discount off your order of the <a href=\"https://www.sleepphones.com/?aff=1018\">Escape Pod branded sleep phones</a> if you use the coupon code EscapePOD (all one word.)</p>\n<h3>Observer Effects</h3>\n<p>“Ubiquitous surveillance isn’t the problem. Asymmetrical ubiquitous surveillance is the problem.” The Liberator was playing Chinese checkers against himself and talking, talking, talking, like always. “Who watches the watchmen, after all?”</p>\n<p>We were superheroes then. Celebrities, back when there were such things. It was a slow night at orbital headquarters, and Eye-Oh was sitting at the big screen, watching a couple of people fuck — consensually, or we would have done something about it — in an alleyway. The screen was green with night-vision enhancements, and Eye-Oh’s strange complicated face was perfectly placid and empty as he observed.</p>\n<p>“The problem is that we can watch ordinary people, and they can’t watch us,” the Liberator went on. He looked at me longingly, searchingly, and I thought it might be nice to tweak the inside of his brain and get rid of his earnestness, give him a little taste of what infamous brain-damage victim Phineas Gage got when that iron bar slammed through his frontal lobe, a total personality turnaround, from nice guy to sociopath. Let the Liberator be selfish and impulsive and violent and mercurial for a while, so he could appreciate the way normal avaricious sneaky hungry desperate needy people felt.</p>\n<p>But that was supervillain thinking, and I’d gone straight and narrow. In those days I cured neurological damage instead of inflicting it. I <i>fixed</i> people. (Except bad people. Those, I was sometimes still allowed to play with with.) I’d refused to give up my supervillain name though. The Liberator had wanted to call me “Dr. Neuro” when I joined his little boys’ club, but I’d insisted on keeping my maiden name, as it were. Doctor. Please. I was a high-school dropout.</p>\n<p>“Do you see?” the Liberator said. “If ordinary people could see <i>us</i>, if everyone could see everyone else, it wouldn’t matter if there were no privacy.”</p>\n<p/><p>“Mmm,” I said, and tried to keep reading my book, a physics textbook. I was deep into a chapter on Heisenberg. His big achievement was the uncertainty principle, which says you can’t know both the position and the momentum of a given particle at the same time. (I know, you know that. But like I said, I didn’t do much school. I had a lot of catching up to do if I was going to hang with the super-science types.) I always thought the uncertainty principle had something to do with observing, how just the act of looking at something changed its nature, but apparently that’s a whole different thing, called the observer effect. That’s the kind of confusion you get when your grasp of physics comes from made-for-TV science fiction movies named after the monster that eats the boyfriend in the second act. I wasn’t too clear on the implications of the uncertainty principle, but I understood the observer effect. Me and the boys observed things all the time — Eye-Oh observed _everything_ all the time — and we sure as hell changed what we saw if we thought it needed changing.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://escapepod.org/2025/08/28/escape-pod-1008-observer-effects-flashback-friday/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "escape-pod-1007-35-f-lane-s-creek-oklahoma",
    "title": "Escape Pod 1007: 35 / F / Lane’s Creek, Oklahoma",
    "category": "Stories-Fantasy",
    "date": "2025-09-03",
    "excerpt": "Sandra loaded. Boxes and pallets, mostly. Full of avocados, computer chips, plastic toys, etc. All carefully placed by her rubber-faced grippers into the trucks that darted in and out of the warehouse bays.",
    "cover": "https://escapepod.org/wp-content/uploads/2021/01/cropped-EscapePod_banner_1280.jpg",
    "source": "https://escapepod.org/2025/08/21/escape-pod-1007-35-f-lanes-creek-oklahoma/",
    "author": "AventurOO Editorial",
    "body": "<h2>Escape Pod 1007: 35 / F / Lane’s Creek, Oklahoma</h2>\n<h3>35 / F / Lane’s Creek, Oklahoma</h3>\n<p>Sandra loaded. Boxes and pallets, mostly. Full of avocados, computer chips, plastic toys, etc. All carefully placed by her rubber-faced grippers into the trucks that darted in and out of the warehouse bays.</p>\n<p>On a good day, Sandra loaded something interesting. A heavy, oddly shaped package, requiring her to adjust her first person view goggles and sit forward in her chair, lips pursed in concentration. Or a tantalizing, vacuum-packed parcel bound for near Earth orbit. Once, an opaque tank, filled with flickering red-black fish. It brought a little variety to a day viewed through the cameras of a four-foot-tall, yellow robot.</p>\n<p>Everyone thought loader drivers were shut-ins who ate frozen pizza three meals a day, but Sandra knew she was plenty hot. In fact, despite spending six days a week working alone, Sandra showered regularly, had nicely combed black hair, and ate fresh greens from her garden. Her FPV goggles left ghost-white rings around her eyes, but no one had ever complained during her periodic forays into picking up people at the bar after work. The bar in Lane’s Creek, that is, not wherever she’d been dispatched today. Sandra couldn’t ask, but from the pine trees and rain that slicked the tops of the trucks, she guessed Washington or Oregon.</p>\n<p>Today, her bot’s grippers were broken, so Sandra was posting cute cats on the drivers’ forum. The bots weren’t wired for sound or video, supposedly as a cost-saving measure. They did, however, have little whiteboards. Sandra had been surprised when a neighboring bot surreptitiously held up its ‘emergency’ whiteboard with a link scrawled on it. But she’d quickly grown to like the forum’s stream of gossip, complaints, and off-topic posts. Sandra wasn’t good at small talk, online or in real life, but she still wanted her people to know she cared about them. So, cat .gifs.</p>\n<p>Finally, a woman wearing a maintenance technician’s overalls walked into her camera’s view. She waved to Sandra. That was rare. The in-person employees were often stuck-up when they weren’t inattentive. Sandra lifted her busted gripper and gingerly waved back.</p>\n<p>“No humans allowed near a robot in motion,” the bot driver pre-employment training had said about a hundred times.</p>\n<p>Lucy, that was what the woman’s name tag said, didn’t seem nervous about the bot. She also sang to herself as she worked, which Sandra liked. Not that Sandra could hear, but she’d gotten good at reading lips in her first year as a bot driver. Right now, Lucy was singing a pop song from last year. It reminded Sandra of her mom working in the kitchen, which was weird, because Lucy was hot. Not like, older lady, mom-core hot, but hot hot, swipe-right hot. Lucy had a nice curve in her nose, and worked quickly and surely, sweat beading her short red hair. She leaned toward the camera to check a gripper and Sandra straightened in her chair, feeling flushed at the sudden intimacy.</p>\n<p>Sandra’s bot was soon working again and Lucy began to pack her tools. Sandra considered giving her a thumbs up, but that didn’t really seem appropriate as a thank you. Or a flirtation. She knew from the forum that a few bot drivers took creepy screenshots of the in-person staff, but she’d never heard of anyone trying to hit on one. Lucy turned to go and Sandra panicked. They were still too close together for her to risk a sudden movement toward her whiteboard. So, instead, Sandra bowed, her bot’s servos humming as it folded gently forward. She wondered if Lucy would assume the bot had suffered another malfunction.</p>\n<p>Instead, Lucy bowed back, winked, and walked off, her bag swinging behind her. And Sandra was in love.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://escapepod.org/2025/08/21/escape-pod-1007-35-f-lanes-creek-oklahoma/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "escape-pod-1006-when-the-oracle-speaks-part-2-of-2",
    "title": "Escape Pod 1006: When the Oracle Speaks (Part 2 of 2)",
    "category": "Stories-Fantasy",
    "date": "2025-09-03",
    "excerpt": "Outside the warehouse, the rain fell in sheets. It whipped the Azure River into a frenzy, and the waters responded with a hungry roar as they swirled past the dock. It pounded the warehouse’s loading bay, transforming it into a marshy field of shallow ponds and rocky islands. …",
    "cover": "https://escapepod.org/wp-content/uploads/2021/01/cropped-EscapePod_banner_1280.jpg",
    "source": "https://escapepod.org/2025/08/14/escape-pod-1006-when-the-oracle-speaks-part-2-of-2/",
    "author": "AventurOO Editorial",
    "body": "<h2>Escape Pod 1006: When the Oracle Speaks (Part 2 of 2)</h2>\n<h3>When the Oracle Speaks (Part 2)</h3>\n<p>Outside the warehouse, the rain fell in sheets. It whipped the Azure River into a frenzy, and the waters responded with a hungry roar as they swirled past the dock. It pounded the warehouse’s loading bay, transforming it into a marshy field of shallow ponds and rocky islands. Nobody, not even a dock worker, was about; the only things that moved were the automata. They paced back and forth, their armor caked with rust, and as they splashed through the watery field, droplets running down their limbs, they showed no signs of minding.</p>\n<p>The shadow of a narrow alleyway enveloped me, hiding me from the automata. For a moment, anticipation and fear flickered in my chest, before I exhaled and snuffed them both out. I stepped out of the alleyway, protected by my umbrella. Espionage mission or not, I wasn’t letting my hair get wet.</p>\n<p>Both automata stopped and turned to face me; the rain filled the void of silence left by their stilled feet. I continued walking forwards with purpose.</p>\n<p/><p>One automata raised a hand, its rusted joints creaking as it did. It spoke, in a gravelly, muffled voice: “Halt.”<br/>\nThat was the first layer of defense, meant to deter commoners who’d ignored the posted signs against trespassing and somehow wandered this far into the docks. I didn’t slow. At first, the automata showed no reaction—those machine minds, hidden to me, recalculated and reconsidered. Then, as one, they both shivered. The illusion of rusted armor fell from them like an unclasped cloak, and now their carapaces, comprised of thousands of scales, gleamed in the rainwater.</p>\n<p>“Provide validation.” Its voice was as smooth and bright as a stream of molten metal.</p>\n<p>I spoke the passphrase from memory: “Clouds aflame. Flower verdigris. In a summer field, a single stone.”</p>\n<p>The automata pivoted on their feet away from me, like a door swinging open, and I exhaled. “Validation accepted. Enter.”</p>\n<p>With the rain still pounding my opened umbrella, I walked past the automata’s unblinking stares and entered the warehouse.</p>\n<p>First it was quiet; then, the overhead lighting turned on with a droning buzz. I held one hand to my brow to shield my eyes from the unexpected brightness, while my other hovered by my lightgun. If there was a trap, they’d spring it now. But nothing moved, and slowly, I relaxed.</p>\n<p>I saw what the warehouse concealed, and at first, I didn’t understand.</p>\n<p>It stood in the middle of the stark white floor, its matte black chassis drawing the eye like a dark stone in a field of sand. Six conical thrust nozzles dangled from the underside; now, they all pointed straight down, but I knew from the holovids how, in combat, they could turn and dance to make the craft fly in impossible ways. On either side of the nose, weapons bays brimmed with missiles, hexagonal ports arrayed like the speckles of a cobra, its hood spread, staring back at me.</p>\n<p>A hover-bomber. And as I circled around it, I saw, emblazoned on its side, the emblem of Samandir.</p>\n<p>Pallets of sealed crates lined the warehouse next to the hover-bomber; I pried them open at random and examined their contents. Short-barreled rifles, the same ones brandished by the enemy in both propaganda holovids and classified combat footage. Clean-pressed mustard yellow uniforms, the signature mark of Samandiran shock troopers. All the props needed to stage an attack in the city and have everyone in Artan think Samandir responsible.<br/>\nSuch an attack, ending in the loss of Artani life, would surely cause all-out war to resume. But who could have planned something like this? If I discovered the general or prince responsible for this plot, I could ensure they were executed tomorrow morning.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://escapepod.org/2025/08/14/escape-pod-1006-when-the-oracle-speaks-part-2-of-2/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "escape-pod-1005-when-the-oracle-speaks-part-1-of-2",
    "title": "Escape Pod 1005: When the Oracle Speaks (Part 1 of 2)",
    "category": "Stories-Fantasy",
    "date": "2025-09-03",
    "excerpt": "One year after the war’s end, the royal court welcomed a hundred orphan boys into our ranks. They flew into the city’s spaceport by shuttle and proceeded up the hill on the backs of the court’s own palanquin-bearers; upon entering the palace grounds, they received the speeches…",
    "cover": "https://escapepod.org/wp-content/uploads/2021/01/cropped-EscapePod_banner_1280.jpg",
    "source": "https://escapepod.org/2025/08/07/escape-pod-1005-when-the-oracle-speaks-part-1-of-2/",
    "author": "AventurOO Editorial",
    "body": "<h2>Escape Pod 1005: When the Oracle Speaks (Part 1 of 2)</h2>\n<h3>When the Oracle Speaks (Part 1)</h3>\n<p>One year after the war’s end, the royal court welcomed a hundred orphan boys into our ranks. They flew into the city’s spaceport by shuttle and proceeded up the hill on the backs of the court’s own palanquin-bearers; upon entering the palace grounds, they received the speeches and banquets we held in honor of their noble suffering. The boys, hailing from the kingdom’s most war-torn moon, had lost everything, but now their days of hardship were over. They had become esteemed wards of the House of Hassam.</p>\n<p>After a few days, though, people in the court whispered of something else. The cooks and dressing girls repeated the same rumor: <i>Did you hear? One of the new boys can see the future.</i> The ministers and generals, who should have held themselves above idle gossip, indulged in speculation: <i>If this is true, could the boy be of use?</i> And everyone wondered how the king might act. We all knew his strength was the House’s strength. If the boy possessed some special power, my father would take him.</p>\n<p>So I never had any intentions of turning the boy to my side. I was just curious.</p>\n<p/><p>I found him sitting on a bench in the middle of a courtyard, surrounded by onlookers. It was another rainy day, and all the aristocrats had a servant beside them, shielding their heads with an umbrella. Some pretended to write calligraphy or paint—the perfect image of artful nobility, honing their talents as the rain fell around them—while others just stared.</p>\n<p>I took in this scene from the colonnade which circumscribed the courtyard. “Come,” I said, and my servant chaperone opened my umbrella. “I’m going to talk to him.”</p>\n<p>We left the colonnade’s shelter and entered the courtyard. The boy didn’t appear special—he was skinny and looked around the same age as me, and the only thing unusual about him was his uncovered head. Rain plastered his thick, reddish curls to his forehead. They’d be a frizzy mess later; I wrinkled my nose at the thought of it.</p>\n<p>Instead of looking up as we approached, he only stared at the rain hammering the surface of the courtyard pond. He’d been doing that, it seemed, all afternoon long. My servant and I stood there, waiting, until the silent lack of recognition grew irritating. Finally, my servant spoke: “Prince Meira Pashel em-Hassam wishes to speak to you.”</p>\n<p>The boy turned around. His eyes swept over me—my jeweled coat jacket, inlaid with silver; the ceremonial lightgun at my belt; my coiled black locks, cascading to my chest and lustrously shiny. The regalia of a prince was designed for impact. But his face betrayed no emotion—not fear, nor awe, nor muffled resentment—none of the familiar reactions.</p>\n<p>As if he expected it all. My irritation grew.</p>\n<p>The boy didn’t bow, but I refrained from comment; I’d already conceded enough conversational power to this commoner. Instead, I said, “You look wet. Would you like an umbrella? My servant can fetch one.”</p>\n<p>He shook his head. “I like the rain. It’s nice on my head.”</p>\n<p>The word the boy used for ‘rain’ caught my attention—a formal construction, not the colloquialism that everyone in the city used. I remembered why he was here. We were both Artani, but I had been born on this moon, Artan itself, while he, like the rest of the orphans, was from Eshtan. Once the crown jewel and proudest province of the House of Hassam, now a dead moon, bombed to a ruin by the Samandirans.</p>\n<p>The boy lacked etiquette, but not only was he my House’s ward, he’d also lost his parents to the Artani people’s mortal enemy. I could hardly reprimand him. So instead, I said, “Welcome, in the name of the House of Hassam, to your new home. Our hospitality is yours to command.”</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://escapepod.org/2025/08/07/escape-pod-1005-when-the-oracle-speaks-part-1-of-2/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "escape-pod-1004-the-girl-who-came-before",
    "title": "Escape Pod 1004: The Girl Who Came Before",
    "category": "Stories-Fantasy",
    "date": "2025-09-03",
    "excerpt": "When me and my family pulled into our driveway, my five best friends were waiting in our front yard, waving glittery poster-board signs that read “Welcome Home Sam!!!” and jumping around with full-on 13 year-old girl dorkiness.",
    "cover": "https://escapepod.org/wp-content/uploads/2021/01/cropped-EscapePod_banner_1280.jpg",
    "source": "https://escapepod.org/2025/07/31/escape-pod-1004-the-girl-who-came-before/",
    "author": "AventurOO Editorial",
    "body": "<h2>Escape Pod 1004: The Girl Who Came Before</h2>\n<h3>The Girl Who Came Before</h3>\n<p>When me and my family pulled into our driveway, my five best friends were waiting in our front yard, waving glittery poster-board signs that read “Welcome Home Sam!!!” and jumping around with full-on 13 year-old girl dorkiness.</p>\n<p>It should have made me happy.</p>\n<p>And it did. For the most part. It was all I’d wanted for the last year: to hang out with my friends somewhere other than a hospital room and go to school and talk without an oxygen tube in my nose.</p>\n<p>But they weren’t <i>my</i> friends. Not really. They were her friends. The old Sam, the girl my body had been cloned from, the girl whose memories had been printed onto my brain. The girl whose life I was now supposed to live.</p>\n<p>When they revived me, I’d woken up in my hospital bed. <i>Her</i> hospital bed. That was important, because if I had woken up in the technical center where they’d grown my body and imprinted my mind, we’d be too aware I was just a copy of the real Sam. No, they positioned my body in the exact same hospital bed where she’d spent the past fourteen months. That way my parents could come in and pretend their daughter had recovered.</p>\n<p>Nobody ever literally claimed that Sam hadn’t died. If they did that, they’d know they were in denial, and that would ruin the fantasy they could only hold onto so long as they didn’t think about it too much. Yes, technically, that body had died, sent off to be cremated like any other amputated limb, but their daughter wasn’t dead. Not <i>really</i> dead. She’d been revived. Wasn’t it fantastic? We should all be so thankful that Sam had (for all intents and purposes) pulled through after all.</p>\n<p>Sam’s friends ran circles around me, talking over each other, making plans for us together. We were going to do so many things now that I was healthy again. First thing, after band practice, we were going to sneak off to Starbucks even though Tina’s mom didn’t let her have caffeine and we were going to drink Frappuccinos until we got sick.</p>\n<p>This was what I remembered normal feeling like a lifetime ago, the life I’d wished so hard to get back. I’d spent months too weak to move, knowing I’d never step foot outside the hospital again. To be walking around in this body now… I was just playing a virtual reality game called Sam’s Life Before She Got Sick.</p>\n<p>I <i>did</i> want to go to Starbucks with my band nerd friends and get sick on caffeine and talk away the afternoon. But also I didn’t. I wanted to not want these things. If I only liked what Sam had liked, if I only wanted what Sam had wanted, I was nothing but a copy of Sam. Not a real person. Not even a human. Just a very realistic mannequin, my arms and legs animated by what some other girl used to want.</p>\n<p>My mom watched us with tears in her eyes, makeup carefully done up for this special occasion. My nine year-old sister, Vic, had been staring at me with wide eyes all day. She seemed like she wanted to get caught up in my friends’ happiness, but still couldn’t quite believe it was all real. My dad stood behind them, a few steps back. I couldn’t read the expression on his face. Maybe he was thinking the same thing I was: this person, whoever she is, <i>whatever</i> she is, she’s not Sam.</p>\n<p>“Have you played your clarinet, yet?” Janie asked. “You have to make symphonic band next year so we all have practice together, Sam. You <i>have</i> to.”</p>\n<p>“I, uh…” I began. “Could you call me Samantha from now on? Instead of Sam?”</p>\n<p>Janie’s smile grew. “Uh, okay. Why?”</p>\n<p>“Cause Sam is a boy’s name,” I said.</p>\n<p>I didn’t want to tell her the real reason. I didn’t think I could explain it well enough to make anyone understand.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://escapepod.org/2025/07/31/escape-pod-1004-the-girl-who-came-before/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  },
  {
    "slug": "escape-pod-1003-billionaire-s-tears",
    "title": "Escape Pod 1003: Billionaire’s Tears",
    "category": "Stories-Fantasy",
    "date": "2025-09-03",
    "excerpt": "I wake up to the sound of screaming, and know I’m going to die.",
    "cover": "https://escapepod.org/wp-content/uploads/2021/01/cropped-EscapePod_banner_1280.jpg",
    "source": "https://escapepod.org/2025/07/24/escape-pod-1003-billionaires-tears/",
    "author": "AventurOO Editorial",
    "body": "<h2>Escape Pod 1003: Billionaire’s Tears</h2>\n<h3>Billionaire’s Tears</h3>\n<p>I wake up to the sound of screaming, and know I’m going to die.</p>\n<p>I shoot out of bed, calling for my mother. First thing I’ve spoken clearly in two days.</p>\n<p>“Maria!” My mother bursts into my room. “Baby, what’s wrong?”</p>\n<p>“S-sorry, Mamma,” I whisper, frantically searching for the right syllables so I don’t trip over them and give it all away. I can’t let Mamma suspect I’m dying—or how soon it’ll happen. “Nightmares.”</p>\n<p>Mamma’s smile is sad. The world’s finally getting better, but not for everyone. For us, still struggling, it’s like it’s only getting worse. Everyone in the family has been having nightmares. But when Mamma accepts my explanation and doesn’t seem bothered by the screaming that surrounds us and has not stopped, to me, anyway, that’s when I know. I have a week <i>tops</i> if I’m lucky.</p>\n<p>First symptom is brain fog, but I brushed off the disorientation as being overworked—ha, who isn’t, amirite? When the stuttering started, I was in complete denial. But the screaming. That’s the last symptom before your brain melts out through your eyes. This is it; I’m fucked.</p>\n<p>“Get dressed, baby, you’ll be late for work.”</p>\n<p>I smile, forced and tight and desperate to appear reassuring. Mamma clears out of the room I share with my sister—who’s at school by now—and I collapse back into bed. What am I going to do? How is this possible? There’s no point in going to work. Fuck that. But I need to get out of the house and <i>think</i>. I need Mamma to believe everything’s okay till I figure this out.</p>\n<p>So I throw on some clothes and grab some toast and my bag and head out the door like it’s just another work day. I’m halfway to the bus stop when I realize I forgot my phone and run back for it.</p>\n<p>It’s so hard to concentrate through the screaming. I almost walk into traffic twice, even with my headphones on. The music helps a little.</p>\n<p>I’m no billionaire—ha!—but somehow I’ve caught Billionaire’s Tears. Oh sure, it’s got some proper scientific name but no one calls it that. I’m not the first person with not a penny to her name and more debt than God to get this, but it has been getting rarer.</p>\n<p>There was a UN resolution about it or something. I don’t know. I work three jobs to help Mamma keep the lights on and the younger kids fed. I don’t have time for the news.</p>\n<p>It was kinda hard to ignore when the plague first started. It was all anyone talked about. A plague killing off all the billionaires? Right on! Gates was the first to go, Musk and Bezos not far behind. At first everyone thought it was poisonings or something.</p>\n<p>But then Taylor Swift got to the screaming, gave all her money to her fan club as one last thank you before she died, and then immediately recovered. Next thing you know, tycoons liquidating assets, giving shitloads of money to charity and transferring ownership of factories and whatever to the workers. Real estate robber barons participating in landback. Techbros buying up the student debt Biden didn’t get to, erasing medical debt, funding schools and building roads and museums and holy shit, right? The lotteries started up—Mamma’s been hoping to win one to get us out of poverty.</p>\n<p>Not all of them got rid of their money to save their own ass though. JKR decided it was a liberal conspiracy to make her give her money “to the trans myth” and yeah no one was sad when the plague made her finally eat shit. But it was the Saudis who first weaponized it: transferring their assets to rivals to kill them off. It worked, until everyone caught on. Then it was just rich assholes playing whack-a-mole with each other’s money hoards.</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://escapepod.org/2025/07/24/escape-pod-1003-billionaires-tears/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article</a>\n</p>"
  }
]