[
  {
    "slug": "10-best-affordable-hotels-in-vancouver-canada-2025",
    "title": "10 Best Affordable Hotels in Vancouver, Canada (2025)",
    "category": "Lifestyle",
    "date": "2025-09-01",
    "excerpt": "10 Best Affordable Hotels in Vancouver, Canada All products and listings featured on Condé Nast Traveler are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Vancouver is a place of balance, where city meets sea, mountains meet metropolis, and quiet open spaces and colorful communities collide. No matter the season or your reason for visiting, Vancouver has something for everyone. Adventure lovers can cycle the scenic Stanley Park seawall, hike through forested trails, paddle along the coastline, or hit the slopes in the winter. Those looking for a more relaxed pace can browse stylish boutiques, unwind at a spa, or sip cocktails at trendy local hotspots. With a mix of urban delights, natural sites, diverse culture, and world-class cuisine, Vancouver is a choose-your-own-adventure destination, and it all starts with where you stay. If you plan your trip just right, you can enjoy the best of both nature and city—day or night, rain or shine—and Vancouver has plenty of places to stay within walking distance from it all. And while the city is known for having a high cost of living, you don’t need to spend your entire paycheck to find somewhere lovely to rest your head. From Canada’s first Aboriginal arts hotel to a buzzy beachfront property dating back to 1912, read on for the best affordable hotels in Vancouver that are luxurious and low-key, but won’t break the bank. FAQ: What's the average price of a hotel in Vancouver? Rivaling the hotel rates of major metropolitan cities like London and New York, Vancouver’s average nightly prices peak substantially during the summer months (July is busiest). Because Vancouver is facing a hotel shortage, demand exceeds supply, causing the prices to spike. Overall, average nightly rates range from $300-$600 per night for standard rooms, with luxury accommodations reaching closer to $1,000 a night. That being said, when you visit Vancouver during off-peak times (typically November to March), you’ll see much lower rates—closer to $200 a night for standard rooms. What part of Vancouver is best to stay in? Vancouver’s Burrard Inlet is packed with prestigious places to stay, all within walking distance of Stanley Park, downtown shopping, and mini pedestrian ferries that take you to top attractions like Science World and Granville Island from downtown. You’ll find lots of beautiful waterfront parks and beaches here, and some of the city’s best restaurants are close by. Plus, this area is the departure point for boat tours and whale-watching excursions, great for those looking to hit the water. That being said, this is also the most expensive part of the city to stay in. If hiking, biking, or skiing are your…",
    "cover": "https://media.cntraveler.com/photos/5c23c904a546ef283d2174dd/master/pass/the-DOUGLAS_The-Den_1.jpg",
    "source": "https://www.cntraveler.com/gallery/best-affordable-hotels-in-vancouver-canada"
  },
  {
    "slug": "10-best-airbnbs-in-the-dolomites-for-your-next-alpine-adventure",
    "title": "10 Best Airbnbs in the Dolomites for Your Next Alpine Adventure",
    "category": "Lifestyle",
    "date": "2025-09-01",
    "excerpt": "The Best Airbnbs in the Dolomites for Your Next Alpine Adventure All products and listings featured on Condé Nast Traveler are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Few places on Earth match the natural beauty of the Dolomites, and Airbnbs across the region bring you up close and personal with its unparalleled scenery. Comprising 18 imposing peaks and a number of deep valleys in between, the northern Italian mountain range has earned recognition as a UNESCO World Heritage Site for its unique rock formations, and now is home to a charming medley of sprawling ski resorts, crystal-clear lakes, and Alpine villages. Whether you’re looking to recharge after adrenaline-fueled snow sports or soak up the scenery in all its summer glory, Airbnb is your best bet for a comfortable base in the midst of nature. These stays range from traditional chalets to stylish design apartments, but all have one simple, irresistible thing in common: incredible mountain views. Below are 10 of the best Airbnbs in the Dolomites for your next Alpine adventure, handpicked by our editors. We've vetted these listings based on Superhost or Guest Favorite status, ratings, amenities, location, previous guest reviews, and decor. This article was originally published on Condé Nast Traveller UK. For more recommendations on where to stay in Italy, visit:",
    "cover": "https://media.cntraveler.com/photos/68b074771d17a5236d595ad8/master/pass/DOLOMITES%20AIRBNBS%20AUGUST%2025%20Thalerhof%20Naturae%20Oasis%20Ritten%20%20%20AIRBNB.jpeg",
    "source": "https://www.cntraveler.com/gallery/the-best-airbnbs-in-the-dolomites-for-your-next-alpine-adventure"
  },
  {
    "slug": "how-i-travel-kristin-davis-learned-to-sleep-on-planes-while-filming-se",
    "title": "How I Travel: Kristin Davis Learned to Sleep on Planes While Filming Sex and the City",
    "category": "Lifestyle",
    "date": "2025-09-01",
    "excerpt": "While pondering her travel pet peeves, actress Kristin Davis can’t help but sound precisely like Charlotte York, her character in the Sex and the City universe (for those who have been living under a rock for three decades). “I hope I’m not going to upset a bunch of people, but it’s really loud complaining. I understand it’s hard to travel, but I feel that politeness is something we’re losing track of in our world. I feel really sad about that,” says Davis, who recently wrapped the final season of And Just Like That… When it’s pointed out that she just expressed a fear of complaining about complaining, she lets out a giant cackling laugh. “That is so me. That is so me!” The actress, who shares behind-the-scenes tidbits and recaps Sex and the City on her podcast Are You a Charlotte?, spoke with Condé Nast Traveler about her long professional and personal relationship with Kenya, the New York City tourist attractions she loves, and why the rumble of an airport runway sends her straight to sleep. Her go-to flying outfit: Oh, it's always such a dilemma. I really have a uniform. I can't say that it's the most attractive, but it's my super comfortable clothes. It’s my AG boyfriend jeans that are a little baggy, then my James Perse long-sleeved t-shirt, then my Jenni Kayne v-neck Flynn sweater, and a thin Patagonia [fleece] just in case, because you can ball it up in a bag and get it out if you’re cold on the plane. Those planes are just too cold! Her priorities when planning a vacation: It depends on whether my children are going or not. If they are, it's all about the kid activities, because I have a super active seven-year-old boy; I need athletics or fancy slides into the pool. Before children, I would go to Bali. If I had just finished work and I wanted to go to an island, I loved the Amanyara in Turks and Caicos. My more adventure-type travels are generally on the African continent, and then it's more animals. I almost never use food as a [motivator]. I'm not a foodie in that way. I like food! I like to taste local food, for sure, but I'm not going to be seeking that out, you know? I’m thinking about the hotel and safari. Her amazing packing tip: First of all, I love to pack, and I hate to unpack. Right now, I have two unpacked suitcases in my room. It's really bad. But I do love to pack, and I have two methods. If the kids are coming, I use the cubes. If the kids are not coming, I roll. If I…",
    "cover": "https://media.cntraveler.com/photos/68b1e216599ffc26e8d51df4/master/pass/082925-Kristen-Davis-00-Lede-HIT.jpg",
    "source": "https://www.cntraveler.com/story/how-i-travel-kristin-davis"
  },
  {
    "slug": "how-to-visit-scotland-s-inner-hebrides-no-sailing-experience-required",
    "title": "How to Visit Scotland's Inner Hebrides—No Sailing Experience Required",
    "category": "Lifestyle",
    "date": "2025-09-01",
    "excerpt": "We’d just left port, mainland Scotland fading behind us, and were sailing into soft yellow sunlight. The sea was the dark silvery blue of raw denim, and the wind, for now, seemed settled, unshifting. “Here they come,” said Mungo Watson, our boat’s skipper, with deadpan calm, hands on the helm. On deck, the crew and I turned to survey the horizon, then gingerly moved toward the bow of the boat and looked down. “No, not porpoises—dolphins,” Watson continued. “For some reason, and still nobody really knows why, they absolutely love boats.” It was the storybook start to our voyage that began only an hour or so earlier at the marina of Mallaig. Eight strangers had climbed aboard Eda Frandsen for a more-or-less unscripted salty-dog sailing adventure around Scotland’s Inner Hebrides. Our crew were the boat’s recently wed co-owners, Watson and Stella Marina, experienced sailors who bought the 1938 Danish gaff cutter in 2020 and now run trips out of Cornwall and the west coast of Scotland from April to September. Some, such as the nine-night passage from Falmouth to Oban, probably require more sea grit than, say, a slow long-weekend sail along the Cornish coast. But none of them call for any sailing experience, they reckon. Which is lucky because I had zero. Nothing. We all had different reasons for being there: some to see Scotland in summer without joining the conga line of Glencoe-bound camper vans; others for the heck of it. “I just like old boats,” said David, my affable bunk buddy. Fair enough. I was there to get into the hard-to-breach orbit of offshore sailing, a world that has stubbornly few points of entry, except for those who know someone with a boat or have pots of cash. Its reputation for exclusivity doesn’t help either. “The elitism in sailing is undeniable,” says Marina. “We’re absolutely trying to escape that. That’s one of the reasons we set up Eda Frandsen: to introduce people to the beauty of being at sea. To open sailing to everyone.” By late afternoon we’d arrived at Eigg (population: 83), a small, flat, tennis-court-green island with a single peak. The sun was slipping downwards and on the horizon distant mountains turned pale shades of lavender and rose. Small sounds assumed an intense clarity as a deep calm emanated from the nearby land: the lapping of waves and the soft clatter of cutlery. This was the spiritual start of my trip. I was at sea. Life was good. It would get better. Below deck we dined by candlelight in the cozy wood-finished galley on fresh langoustines, mussels, and chilled rosé. Marina, who spent much of her career as a chef on superyachts, is an immensely…",
    "cover": "https://media.cntraveler.com/photos/6893ce634446980f0ca99063/master/pass/edafrandsen_high-12-staycation-cntuk-julyaug25-alex-barlow-global.jpg",
    "source": "https://www.cntraveler.com/story/scotlands-inner-hebrides-sailing-adventure"
  },
  {
    "slug": "a-ghostly-guide-to-upstate-new-york-from-haunted-hotels-to-halloween-a",
    "title": "A Ghostly Guide to Upstate New York, From Haunted Hotels to Halloween Activities",
    "category": "Lifestyle",
    "date": "2025-09-01",
    "excerpt": "All products and listings featured on Condé Nast Traveler are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. As the temperatures begin to cool, the leaves start to change colors, and the smell of crisp apples and pumpkin spice lattes hits the air, New Yorkers begin gearing up for another cozy fall. Every year at the end of summer, I lock in my plans to visit upstate New York to take advantage of all the activities going on there during my favorite season, whether that be day-tripping to Sleepy Hollow, booking tickets to The Great Jack O’Lantern Blaze, paranormal investigating at the Shanley Hotel in the Catskills, or sipping hot apple cider at the pumpkin patch. As a lover of scary movies, haunted houses, and Halloween activities, this is the season I wait for all year long, and New York State has plenty of incredible activities worth traveling for (many that are even reachable without a car, for my fellow New York City dwellers). Every year, the season seems to get shorter and shorter, so it’s best to plan your activities far in advance to ensure you can fit everything in. For those determined to hit all the stops before October 31, I’ve compiled a guide to doing Halloween season in upstate New York right. Read on for where to eat, stay, and play in the area for a ghostly good time. FAQ: What areas are classified as upstate New York? As a Manhattanite, and for the purpose of this guide, I’ve classified upstate New York as everything north of the Bronx (although I know this can be a bit contentious among New Yorkers). This includes the Hudson Valley, Capital District, Adirondacks, Catskills, and Finger Lakes. What town in New York is best for Halloween? While there is no one town that takes the crown, Sleepy Hollow is a great option if you’re willing to brave the crowds. The village is easily accessible to city dwellers via the Metro-North railroad and takes about an hour to arrive at the Tarrytown stop. From there, it’s a short Uber ride (or under a 30-minute walk) to all the on-theme attractions, like the Headless Horseman Statue and Philipsburg Manor. However, be prepared for throngs of crowds, few places to park, and long lines for restaurants and other attractions during the Halloween season. When is the best time to visit? To really make the most of fall in upstate New York, I suggest visiting in September, before the Halloween crowds start taking over—there's normally still a chill in the air and the leaves are beginning to change colors. If you’re interested in…",
    "cover": "https://media.cntraveler.com/photos/68b1f318fdc3637dc186f455/master/pass/082925-Haunted-Upstate-ESP-PR-Global-Fainting%20Goat%20Island%20Amityphotos%20(29)%20(1).jpg",
    "source": "https://www.cntraveler.com/story/halloween-guide-to-upstate-new-york"
  },
  {
    "slug": "ask-a-local-exploring-johannesburg-s-creative-scene-with-architect-sum",
    "title": "Ask a Local: Exploring Johannesburg's Creative Scene With Architect Sumayya Vally",
    "category": "Lifestyle",
    "date": "2025-09-01",
    "excerpt": "All products and listings featured on Condé Nast Traveler are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. \"Against all odds, Johannesburg has a very special energy,” says Sumayya Vally, the founder of the architecture firm Counterspace. “The city's legacies of segregation and exclusion mean that at every turn there's work to do, but it's also a vibrant world of inspiration.” Vally has shown her work at the Venice Biennale and directed the first Islamic Arts Biennale in Jeddah, Saudi Arabia. Her company's projects include a community and wellness center at Kenya's Kakuma Refugee Camp; a national memorial in Oslo; and the 2021 Serpentine Pavilion in London. Here, Vally shares her favorite places in Joburg, like hot spots for South African fashion and where to get what she believes are the planet's finest dosas. Bring your appetite Good meals are guaranteed at Yeoville Dinner Club, in the inner suburb of Yeoville. Chef and host Sanza Sandile serves seasonal dishes at a communal table. “The food is sensational and tells a story of our history, of Yeoville's cosmopolitan past—and extremely cosmopolitan present,” Vally says. For grab-and-go fare, she loves the sidewalk markets downtown, where vendors sell fresh vetkoek, or fried dough bread. Dosa Hut in Fordsburg, she says, “makes some of the best dosas I've had in the world.” Fashion forward In residential Randburg, Vally loves Magugu House, the store run by the fashion designer Thebe Magugu: “Every new collection reflects the South Africa he grew up in and South Africa now.” She also recommends the conceptual work of Lezanne Viviers, whose Viviers Studio in tony Parktown welcomes guests by appointment. “If you have something made to measure, you'll get to meet the collective of women she works with,” Vally says. “It's a really special experience.” Art Adventures To take the city's pulse, Vally visits the Joburg Contemporary Art Foundation in Forest Town. “It's a research institute, art space, and innovation tech laboratory. I like the themed exhibitions with food and music.” She also enjoys the Centre for the Less Good Idea in Maboneng, a performance space cofounded by the South African artist William Kentridge, where “some exhibitions are so experimental, you feel like you're part of the testing process.” At the Cradle of Humankind paleoanthropological site, Vally recommends the Nirox Sculpture Park, which offers more than 50 installations across 75 acres of lawns, wetlands, and the banks of the Blaauwbankspruit River. This article appeared in the September/October 2025 issue of Condé Nast Traveler. Subscribe to the magazine here.",
    "cover": "https://media.cntraveler.com/photos/68828b931ca32ecb069c7d1a/master/pass/ASK%20A%20LOCAL%20COVER.jpg",
    "source": "https://www.cntraveler.com/story/ask-a-local-architect-sumayya-vally"
  }
]