[
  {
    "slug": "smithsonian-latino-gallery-quietly-closes-for-nine-months",
    "title": "Smithsonian Latino Gallery Quietly Closes for Nine Months",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Smithsonian Latino Gallery Quietly Closes for Nine Months Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to…",
    "bodyHtml": "<p>Smithsonian Latino Gallery Quietly Closes for Nine Months Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Trump Administration Smithsonian Latino Gallery Quietly Closes for Nine Months As Trump goes after the institution, a temporary space for the National Museum of the American Latino closed ahead of schedule in preparation for America’s 250th programming. by Isa Farfan August 28, 2025 August 29, 2025 Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member .</p>\n<p>The Molina Family Latino Gallery at the Smithsonian National Museum of American History, which has served as the home of the nascent Latino museum, will stay closed until April 2026. (all images courtesy Felipe Galindo) On Friday morning, August 22, illustrator Felipe Galindo Gómez opened his email to find a note from his friend. “Have you seen this?” the message read, and linked to the White House’s bullet-pointed list targeting Smithsonian artworks and exhibitions .</p>\n<p>There it was: an image of his 1999 illustration “4th of July from the south border.” Since 2022, Galindo’s work had been reproduced on a label about anti-immigrant prejudice as part of ¡Presente!</p>\n<p>A Latino History of the United States in the National Museum of American History’s (NMAH) Molina Family Latino Gallery.</p>\n<p>Over the last three years, the gallery space has served as the temporary location of the nascent National Museum of the American Latino, which is currently facing an uncertain future under the Trump administration.</p>\n<p>Now, the Molina gallery has quietly closed for the next nine months, Hyperallergic confirmed.</p>\n<p>After the White House featured his work in its hit list, Galindo, who also goes by the name “Feggo,” said he traveled from New York City to Washington, DC, to see whether it was still up.</p>\n<p>When he arrived at the museum on Tuesday, he found the exhibition closed.</p>\n<p>A sign said it would reopen in spring 2026.</p>\n<p>According to the Smithsonian’s website, ¡Presente! was scheduled to close at the end of November, in preparation for programming marking the United States’s 250th birthday.</p>\n<p>But the exhibition was shuttered on July 20, four months sooner than expected.</p>\n<p>The decision notably follows Trump’s March executive order targeting the Smithsonian Institution and the release of his Fiscal Year 2026 budget, which excluded funding for the NMAL.</p>\n<p>Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up Felipe Galindo’s illustration “4th of July from the south border” was referenced in the White House’s list of Smithsonian exhibitions it found to be objectionable.</p>\n<p>The Molina Family Latino Gallery’s early closure means it will remain shuttered throughout Hispanic Heritage Month this fall, and marks a lengthy period of inactivity for the fledgling National Museum of the American Latino’s only current physical gallery, which the museum’s director, Jorge Zamanillo, has referred to as the institution’s “first iteration.” Reached by Hyperallergic , a spokesperson for the institution cited preparations for the Smithsonian’s Our Shared Future: 250 programming as the reason for the exhibition’s premature closure. “The National Museum of the American Latino is participating in the Smithsonian’s celebration of the nation’s 250th anniversary and wanted to meet the spring 2026 deadline for opening the Puro Ritmo exhibition in support of the Smithsonian’s institution-wide plans,” the spokesperson said, referring…</p>",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/felipe.jpg",
    "source": "https://hyperallergic.com/1037811/smithsonian-latino-gallery-quietly-closes-for-nine-months/",
    "sourceName": "hyperallergic.com",
    "author": "Isa Farfan"
  },
  {
    "slug": "adrift-in-betye-saar-s-crepuscular-dreamscape",
    "title": "Adrift in Betye Saar’s Crepuscular Dreamscape",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Adrift in Betye Saar’s Crepuscular Dreamscape Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic…",
    "bodyHtml": "<p>Adrift in Betye Saar’s Crepuscular Dreamscape Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review Adrift in Betye Saar’s Crepuscular Dreamscape The artist’s site-specific commission at the Huntington makes you feel like you’re floating in space, or suspended underwater. by Jasmine Weber August 28, 2025 August 28, 2025 Installation view of Betye Saar, \"Drifting Toward Twilight\" (2023) (all photos Jasmine Weber/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member .</p>\n<p>SAN MARINO, Calif. — Standing in the gallery of Betye Saar: Drifting Toward Twilight , you are bathed in oceanic, cobalt blue light.</p>\n<p>The buzz of neon lights drones in the background.</p>\n<p>It’s hard to say if the temperature has truly dropped, or if it’s psychosomatic, that the atmosphere has cooled your skin just by the power of suggestion.</p>\n<p>You’re floating in space, or suspended underwater — gravity works differently here.</p>\n<p>The phases of the moon are painted on the wall in a matte metallic silver, and a small poem by Saar is draped across the wall: “The moon keeps vigil as a lone canoe drifts into a sea of tranquility seeking serenity in the twilight.” In the middle of the room, a long canoe, 17 feet across, sits atop a bed of branches, bramble, and sheets of jagged wood.</p>\n<p>At either tip of the ship is a watchful eye guiding the raft in both directions.</p>\n<p>Two sentinels — antiques affixed with antlers — keep watch at each end.</p>\n<p>Saar has crafted a fantastical scene; you can envision the boat careening upriver, striding forth.</p>\n<p>The vessel is occupied by bird cages confining animal antlers and seated upon miniature chairs fit only for a toddler — or, perhaps, spirits who scarcely need a physical seat, just an invitation to rest.</p>\n<p>These scavenged items are characteristic of Saar’s found object assemblage; she hunts for her materials, whether in nature or at flea markets.</p>\n<p>Installation view of Betye Saar, “Drifting Toward Twilight” (2023) Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up “I like combining manufactured objects with natural objects,” says the 98-year-old artist in a video at the back of the gallery.</p>\n<p>She started collecting at four or five, she explains, but the assassination of Martin Luther King Jr. was a catalyzing moment.</p>\n<p>She was so overwhelmed with emotion that she could do nothing but create art, leading her to assemble one of her most famed sculptures, “The Liberation of Aunt Jemima” (1972), which empowers and equips a “mammy” figurine with defensive weaponry.</p>\n<p>Saar is a famed Angeleno, a fixture in the city’s art scene, but she was raised in Pasadena, which neighbors the Huntington Gardens, where this site-specific commission went up in 2023.</p>\n<p>In the short directed by Kyle Provencio Reingold, the camera follows her through the massive campus, where she first wandered at 12 or 13 alongside her mother and neighbor.</p>\n<p>We forage the gardens with her as she instructs the Huntington employees of her artistic intentions; you can hear the giddiness in her voice as she remembers her childhood traversing its grounds, selecting fallen branches and trimmings. “Even in death, those things can be really beautiful,” she muses.</p>\n<p>The gallery lighting shifts…</p>",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/IMG_3141-3.jpeg",
    "source": "https://hyperallergic.com/1037873/betye-saar-drifting-towards-twilight-huntington-library/",
    "sourceName": "hyperallergic.com",
    "author": "Jasmine Weber"
  },
  {
    "slug": "world-s-largest-van-gogh-collection-faces-uncertain-future",
    "title": "World’s Largest Van Gogh Collection Faces Uncertain Future",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "World’s Largest Van Gogh Collection Faces Uncertain Future Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to…",
    "bodyHtml": "<p>World’s Largest Van Gogh Collection Faces Uncertain Future Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News World’s Largest Van Gogh Collection Faces Uncertain Future The artist’s namesake museum in Amsterdam says it will be forced to shutter if the government doesn’t raise its subsidies for sustainability and repairs. by Maya Pontone August 28, 2025 August 28, 2025 Exterior of the Van Gogh Museum in Amsterdam (photo courtesy the Van Gogh Museum) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member .</p>\n<p>Since 1973, Vincent van Gogh masterpieces including his beloved sunflowers, wistful wheatfields, and self-portraits have been housed in Amsterdam’s Van Gogh Museum.</p>\n<p>The institution was established via a historic 1962 agreement between the painter’s nephew and the Dutch government to ensure the long-term preservation of hundreds of paintings, drawings, and letters comprising van Gogh’s oeuvre.</p>\n<p>Now, the museum says that the collection’s future is uncertain, citing a dispute with the Dutch Ministry of Education, Culture and Science (OCW) over the funding for costly maintenance repairs and sustainability efforts mandated by the state.</p>\n<p>In a legal complaint, the institution claims that the Dutch government is violating its decades-old agreement by refusing to provide sufficient subsidies to cover the cost of the three-year, €104 million (~$121 million) project.</p>\n<p>Under the Dutch Heritage Act, national museums, including the Van Gogh Museum, the Rijksmuseum, and the Kröller-Müller Museum, receive annual housing subsidies to help them maintain and preserve their collections.</p>\n<p>But the Van Gogh Museum says that this yearly government funding — currently €8,428,300 (~$9.8 million) — falls short of the more than €11 million (~$12.8 million) needed to help it finance much-needed renovations to its fire and security alarms, climate control system, and internal elevators leading to storage facilities, plus the sustainability upgrades required for all Dutch public buildings as of 2024. “So far, the state of the museum has not directly affected the programming and operations,” a Van Gogh Museum spokesperson told Hyperallergic . “But it’s just a matter of time before it will become a major issue.” A spokesperson for OCW said that the ministry “maintains that the allocated housing subsidy is sufficient to cover the necessary maintenance cost.” Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up “This position is based on comprehensive research conducted by independent experts commissioned by the Ministry,” the spokesperson told Hyperallergic , noting that the subsidy is a “fixed amount” that is annually adjusted for inflation.</p>\n<p>The museum did not disclose how the subsidy is calculated, but the OCW representative said that the same methodology is used for other national museums, citing the Rijksmuseum, which receives €37 million (~$43 million) , and the Kröller-Müller Museum, which receives €9.8 (~$11.4 million) .</p>\n<p>For the past two years, the Van Gogh Museum has been negotiating with the government to increase this annual subsidy by €2.5 million (~$2.9 million) to no avail.</p>\n<p>If the institution does not come to a resolution soon, the museum says it may need to close its doors.</p>\n<p>The Van Gogh Foundation, established by the painter’s nephew, has also echoed concerns about the institution’s future and urged the Dutch government to abide by its obligations to protect the artist’s…</p>",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/van-gogh-museum.jpg",
    "source": "https://hyperallergic.com/1037500/amsterdam-van-gogh-museum-collection-faces-uncertain-future/",
    "sourceName": "hyperallergic.com",
    "author": "Maya Pontone"
  },
  {
    "slug": "required-reading",
    "title": "Required Reading",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Required Reading Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art &…",
    "bodyHtml": "<p>Required Reading Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Community Required Reading Required Reading This week: The ethics of design, Noguchi Museum workers speak out, Native communities on the closure of “Alligator Alcatraz,” Letterboxd woes, music classes in Gaza, and more. by Lakshmi Rivera Amin August 28, 2025 August 28, 2025 The annual Black and White Photo Awards consistently serves as a reminder of the beauty of the form, which Ansel Adams famously preferred (\"With black-and-white I feel free, and confident of results,\" he said, per Ansel Adams in Color ).</p>\n<p>This year's creativity prize went to Adebayo Rotilu's \"Electric Silhouette,\" a humming composition of laser beams and shadow that feels like a chimera of photography, drawing, and optical illusion. (photo by Adebayo Rotilu, courtesy Black and White Photo Awards ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member . ‣ Design is a minefield of ethical dilemmas, incentivizing companies to work with exploitative clients and making it difficult for employees to say no.</p>\n<p>Elizabeth Goodspeed spoke with a few designers, writing in It’s Nice That : Questions about client ethics are tricky enough when you know exactly who you’re working for.</p>\n<p>Things get even murkier when work is licensed, resold, or embedded with no direct link between creator and end user.</p>\n<p>For type designers, this is the norm.</p>\n<p>Once a font is released, it can surface almost anywhere, often without warning.</p>\n<p>Jesse Ragan, cofounder of XYZ Type, says custom projects feel relatively straightforward to assess ideologically: if he doesn’t believe in a client, he can simply turn down the work.</p>\n<p>Retail fonts are a different story.</p>\n<p>A typeface is made in isolation long before it’s used, and can be licensed anonymously or simply pulled from Adobe Fonts without the designer’s knowledge.</p>\n<p>Jesse has seen his work turn up in porn, conservative Christian campaigns, and even materials for a far-right Texas militia. “It’s always a shock to see,” he says, especially given his left-leaning politics.</p>\n<p>He describes designing a typeface as a slow, intimate process – “every little letterform, it’s like, ‘hello, friend’, when I see them” – which makes it all the more jarring when it gets into the wrong hands.</p>\n<p>Rutherford Craze, founder of foundry Mass Driver, shares this feeling. “Some type designers feel that once they release a typeface, where it ends up is no longer their concern.</p>\n<p>I strongly disagree,” he says. “It’s not feasible to make a living and keep a spotless conscience, but it’s our responsibility to find the most equitable balance we can, whether that’s through [dis]incentivising certain usage, or turning down work for clients we disagree with.” ‣ Noguchi Museum Rights, an anonymous group of workers at the New York institution, penned an essay flagging longstanding allegations of racism and artwashing at the museum.</p>\n<p>They write in Everything is Political : Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up Given that the keffiyeh is a cultural garment, meaning it is protected under city and state laws, and is the only thing ever explicitly targeted by this policy, how does the selective enforcement of this policy not discriminate against individuals who would wear a keffiyeh as a…</p>",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/b-and-w-adebayo-rotilu.jpeg",
    "source": "https://hyperallergic.com/1037819/required-reading-748/",
    "sourceName": "hyperallergic.com",
    "author": "Lakshmi Rivera Amin"
  },
  {
    "slug": "seeing-new-mexico-through-the-looking-glass",
    "title": "Seeing New Mexico Through the Looking Glass",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Seeing New Mexico Through the Looking Glass Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content…",
    "bodyHtml": "<p>Seeing New Mexico Through the Looking Glass Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review Seeing New Mexico Through the Looking Glass The 12th SITE Santa Fe International takes reflection as its cue, offering mirror images, doubles, reversals, and echoes in which multiple perspectives and timelines unfold. by Nancy Zastudil August 28, 2025 August 29, 2025 Installation view of Godfrey Reggio, Once Upon a Time (2022) (photo Nancy Zastudil/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member .</p>\n<p>SANTA FE — In 1998, science fiction writer Ted Chiang published “Story of Your Life,” in which aliens come to Earth in “looking glasses,” mirrored spaceships that act as communication devices.</p>\n<p>The central character, linguist Dr.</p>\n<p>Louise Banks, is tasked with deciphering the aliens’ language.</p>\n<p>In turn, she begins to see time like they do — as simultaneous events — and ultimately glimpses her own future.</p>\n<p>A reference to “Story of Your Life” is tucked into the exhibition guidebook for Once Within a Time , SITE Santa Fe’s 12th International.</p>\n<p>Curator Cecilia Alemani identified Chiang as one of the exhibition’s 27 “figures of interest” — catalysts for the 71 participating artists and more than two dozen writers.</p>\n<p>What struck me about Alemani’s inclusion of Chiang’s writing was not the reference to extraterrestrial life (many readers will be familiar with the accounts of UFO sightings in New Mexico), but the surreal, endlessly fascinating phenomenon of the looking glass.</p>\n<p>Once Within a Time takes reflection as a major cue.</p>\n<p>Within each curated theme, such as “The Wheel of Telling” and “The Secret Life of Puppets,” are mirror images, doubles, reversals, and echoes, along with symmetries of place, histories, peoples, and legends — offering exhibition visitors concurrent rather than sequential events, in which multiple perspectives and timelines unfold.</p>\n<p>Even the treatment of the exhibition title, in which “Time” is printed upside down , gestures to alternative ways of experiencing the temporal, reflective nature of both art and language.</p>\n<p>Installation view of works by Rebecca Salsbury James (courtesy SITE SANTA FE, photo by Brad Trone, 2025) Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up Among the many echoing narratives are works by Nora Turato and Will Rawls.</p>\n<p>Turato’s mural “I WANT OUT!” (2025), a red vinyl triptych with one panel per word, is installed on the exterior of SITE Santa Fe, the main venue; inside the museum, Rawls’s Amphigory (2022), a series of inky, glitchy screen prints, seems to respond to Turato’s plea with the barely legible phrase “U Can’t Escape Alive.” In the gallery with Rawls is a suite of 72 computer drawings from 1969 by hard-edge abstract painter Frederick Hammersley, who died in 2009 at age 90.</p>\n<p>He hit an artistic dry spell in the late ’60s, saying, “I painted myself out,” a condition of exhaustion, liberation, or perhaps both.</p>\n<p>To shake things up, he enrolled in a computer class for artists at the University of New Mexico.</p>\n<p>He used the program ART 1 to create multiple printouts of the individual “drawings” that comprise the suite on view, visually undulating abstract compositions of gray monochrome letters, numbers, and punctuation marks.</p>\n<p>With additional presentations of Chester…</p>",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/SITE3.jpg",
    "source": "https://hyperallergic.com/1037395/seeing-new-mexico-through-the-looking-glass-site-santa-fe-12th-international/",
    "sourceName": "hyperallergic.com",
    "author": "Nancy Zastudil"
  },
  {
    "slug": "edward-burra-s-satirical-surrealism",
    "title": "Edward Burra’s Satirical Surrealism",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Edward Burra’s Satirical Surrealism Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to…",
    "bodyHtml": "<p>Edward Burra’s Satirical Surrealism Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review Edward Burra’s Satirical Surrealism The painter wanted to experience the shock of strangeness, to embrace the allure of the louche, the forbidden, the disapproved of. by Michael Glover August 28, 2025 August 28, 2025 Edward Burra, \"Cornish Clay Mines\" (1970); Private Collection (all images © The estate of Edward Burra, courtesy Lefevre Fine Art, London, unless otherwise noted) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success!</p>\n<p>Your account was created and you’re signed in.</p>\n<p>Please visit My Account to verify and manage your account.</p>\n<p>An account was already registered with this email.</p>\n<p>Please check your inbox for an authentication link.</p>\n<p>We rely on readers like you to fund our journalism.</p>\n<p>If you value our coverage and want to support more of it, please join us as a member .</p>\n<p>LONDON — Edwards Burra was a chronically ill English painter, suffering from debilitating arthritis and asthma throughout much of his life.</p>\n<p>Hailing from the upper classes of southern England, with regularized, side-parted, tamped-down hair, he spent much of his life in headlong flight from his upbringing.</p>\n<p>Burra wanted to experience the shock of strangeness, to embrace the allure of the louche, the forbidden, the disapproved of.</p>\n<p>He sometimes left home for months at a time without even saying goodbye.</p>\n<p>Where has Edward gone?</p>\n<p>Nobody knew.</p>\n<p>Will he ever come back?</p>\n<p>Perhaps.</p>\n<p>First it was to Paris, and then to Spain, the United States, and Mexico.</p>\n<p>As you walk around his carefully curated, chronologically organized exhibition at Tate Britain of the best of a lifetime’s work, you can hear the drift of music in the air, the music Edward loved, the visceral excitement of jazz and how that excitement fed into the work of the Harlem years.</p>\n<p>You can even see a row of black vinyl discs along the wall.</p>\n<p>These were Edward’s records.</p>\n<p>Installation view of records and ephemera in Edward Burra at Tate Britain, London (photo Michael Glover/ Hyperallergic ) Get the latest art news, reviews and opinions from Hyperallergic.</p>\n<p>Daily Weekly Opportunities Sign up It is riddling, foot-stomping, 1920s stuff, with all its wildness.</p>\n<p>You may feel an urge to put your arm around someone nearby and swerve them out onto the dance floor.</p>\n<p>There’s plenty of space in these galleries to make your mark.</p>\n<p>Burra’s paintings, like him, are motoring away, at speed, from convention or respectability.</p>\n<p>Most are crowded with figures — you can almost smell the sweet sweat.</p>\n<p>You can almost feel the heady excitement of all those twists and turns and crazy swerves, the pushes and the pulls.</p>\n<p>The figures’ limbs are often inclined to bend pneumatically, as if they might be nothing but inflatables.</p>\n<p>Fingers get stretched and rubberized.</p>\n<p>Features get squeezed into inhuman, mask-like shapes.</p>\n<p>Their faces are so clarted with makeup that it’s hard to tell where the fantasy of all this posing and posturing begins or ends.</p>\n<p>Edward Burra, “Harlem,” detail (1934) (photo Michael Glover/ Hyperallergic ) These beings, afloat on the fantasies of the Englishman wielding the brush, thrive in sexy, late-night environments where booze often topples from the trays on which it is transported.</p>\n<p>Who lives inside all these dangerously pouty cravings?</p>\n<p>This is erotic provocation on speed, surrealism lightly peppered with satire, and Burra records it all, relishing the particularity of his people and scenes. (It is he, of course, who has twisted things so out of shape.) Take a good, hard look at the weird grimaces of “The Two Sisters” (1929) or the parodic mistrust on display…</p>",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/7.-Edward-Burra-Cornish-Clay-Mines-1970-Private-Collection.jpg",
    "source": "https://hyperallergic.com/1037786/edward-burra-satirical-surrealism-tate-britain/",
    "sourceName": "hyperallergic.com",
    "author": "Michael Glover"
  }
]