[
  {
    "slug": "these-5-u-s-scenic-train-rides-offer-the-best-fall-views-this-year",
    "title": "These 5 U.S. Scenic Train Rides Offer The Best Fall Views This Year",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "Posted on Last updated: September 1, 2025 0 Comments Posted By: Travel Off Path Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date. With the close of summer, it means that fall is starting to make its way into the minds of most of us. To many people across the U.S., fall means cozy nights, apple cider, warm sweaters, and, of course, the fall foliage craze that begins to take over the country. Foliage fever is real, and while road trips and national park hikes are great, why not experience America’s beautiful autumn views by rail this year? Here at Travel Off Path , we’ve seen that train travel is having a major moment. It’s a chance to sit back, relax, and soak in the stunning views without the stress of driving. Based on the scenic railways travelers were raving about last year, here are 5 U.S. train rides that offer some of the best fall views for 2025. The Angle: Classic New England Beauty If you want the quintessential New England fall experience, this is it. While there are many foliage trains in the region, travelers in 2024 consistently gushed that the Mountaineer route on the Conway Scenic Railroad is one of the most spectacular rail journeys in the country. Winding through the heart of the White Mountains and the dramatic Crawford Notch, this trip offers cliffside views, historic trestles, and a sea of vibrant red and orange maple trees. The Angle: A National Park by Rail There’s a reason this Ohio favorite remains on the list: it’s one of the only scenic railways that runs directly through a U.S. National Park. The Cuyahoga Valley Scenic Railroad gives you a front-row seat to the deep forests and rolling hills of the park as they explode into fiery shades of red, orange, and purple. It’s an incredibly accessible way to experience a national park’s fall beauty. The Angle: Authentic Appalachian Adventure For a truly unique and historic experience, head to the mountains of West Virginia. The Cass Scenic Railroad is not a typical tourist train; it's an authentic, historic logging railroad that uses powerful steam locomotives to chug its way up a mountain. The journey through the rugged Appalachian wilderness is spectacular, culminating in a panoramic view from Bald Knob, the third-highest point in the state. The Angle: Surprising Desert Beauty A fall foliage trip in the Arizona desert? Absolutely! This is our “underrated gem” pick that travelers raved about last year…",
    "content": "Posted on Last updated: September 1, 2025\n\n0 Comments Posted By: Travel Off Path Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date.\n\nWith the close of summer, it means that fall is starting to make its way into the minds of most of us. To many people across the U.S., fall means cozy nights, apple cider, warm sweaters, and, of course, the fall foliage craze that begins to take over the country.\n\nFoliage fever is real, and while road trips and national park hikes are great, why not experience America’s beautiful autumn views by rail this year? Here at Travel Off Path , we’ve seen that train travel is having a major moment. It’s a chance to sit back, relax, and soak in the stunning views without the stress of driving.\n\nBased on the scenic railways travelers were raving about last year, here are 5 U.S. train rides that offer some of the best fall views for 2025.\n\nThe Angle: Classic New England Beauty\n\nIf you want the quintessential New England fall experience, this is it. While there are many foliage trains in the region, travelers in 2024 consistently gushed that the Mountaineer route on the Conway Scenic Railroad is one of the most spectacular rail journeys in the country. Winding through the heart of the White Mountains and the dramatic Crawford Notch, this trip offers cliffside views, historic trestles, and a sea of vibrant red and orange maple trees.\n\nThe Angle: A National Park by Rail\n\nThere’s a reason this Ohio favorite remains on the list: it’s one of the only scenic railways that runs directly through a U.S. National Park. The Cuyahoga Valley Scenic Railroad gives you a front-row seat to the deep forests and rolling hills of the park as they explode into fiery shades of red, orange, and purple. It’s an incredibly accessible way to experience a national park’s fall beauty.\n\nThe Angle: Authentic Appalachian Adventure\n\nFor a truly unique and historic experience, head to the mountains of West Virginia. The Cass Scenic Railroad is not a typical tourist train; it's an authentic, historic logging railroad that uses powerful steam locomotives to chug its way up a mountain. The journey through the rugged Appalachian wilderness is spectacular, culminating in a panoramic view from Bald Knob, the third-highest point in the state.\n\nThe Angle: Surprising Desert Beauty\n\nA fall foliage trip in the Arizona desert? Absolutely! This is our “underrated gem” pick that travelers raved about last year for being so unexpected. The Verde Canyon Railroad follows the Verde River through a stunning red rock canyon. In the fall, the cottonwood and sycamore trees that line the river turn a brilliant, shocking yellow, creating an incredible contrast against the red cliffs and blue sky.\n\nThe Angle: The Rocky Mountain Epic\n\nThis is a true bucket-list journey. The historic Durango & Silverton steam train winds its way through the remote wilderness of the San Juan National Forest, carving through canyons alongside the rushing Animas River. In the fall, the route is lined with millions of golden aspen trees, creating a world-class spectacle of color. It's an unforgettable, epic journey that consistently ranks as one of the best train rides in the world.\n\nSo this fall, trade the highway traffic for a window seat and let someone else do the driving for a change. It’s a perfect way to experience the magic of the season without the stress. Happy Fall Travels! 🚂\n\nThe Travel Off Path Advantage: Your Travel Toolkit\n\nThe 1-Minute Trip Check Our flagship tool. Solves your entire pre-flight travel planning in a few easy steps. From entry rules to hidden fees and safety.\n\nU.S. Travel Advisory Checker An easy tool to check all the latest travel advisories from the U.S. State Department.\n\nEntry Requirements Checker An easy tool to check all the entry requirements for your destination.\n\nThe Upgrade Newsletter Unlock travel tips, hot destination insights, and exclusive flight deals.\n\nJoin Our Community With over 25,000 members on Facebook!\n\nEnter your email address to subscribe to Travel Off Path's latest breaking travel news, straight to your inbox.\n\nPosted on Last updated: September 1, 2025\n\nCategories Travel , Travel News",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/hese-5-U.S.-Scenic-Train-Rides-Offer-The-Best-Fall-Views-This-Year.jpg",
    "source": "https://www.traveloffpath.com/these-5-u-s-scenic-train-rides-offer-the-best-fall-views-this-year/",
    "author": "Travel Off Path"
  },
  {
    "slug": "new-ultra-cheap-flights-launching-from-u-s-to-this-trendy-caribbean-pa",
    "title": "New Ultra-Cheap Flights Launching From U.S. To This Trendy Caribbean Paradise",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "Posted on Last updated: September 1, 2025 0 Comments Posted By: Vinicius Costa Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date. Already thinking of your next sun-drenched Caribbean getaway this winter? Before you go ahead and spend hundreds of dollars on those ‘irresistible' round-trip flights that are, in fact, not as cheap as they could be, you'll want to hear this one out: From November 15, Arajet, the Dominican Republic's new budget carrier, will start ultra-affordable direct flights from Chicago to Punta Cana. Home to postcard white-sand beaches hugged by teal seas, world-class resorts, and a lively entertainment district peppered with restaurants and nightclubs, it is one of the trendiest destinations in the Tropics, and it's never been cheaper to get to : You might not have come across Arajet in your flight searches before, but that's because they're a new airline launched in 2022, and until recently, they operated to and from select hubs across the Americas. It has grown significantly since its launch, and by 2025, it will already serve destinations such as Miami (MIA), Newark (EWR), and even San Juan (SJU) in Puerto Rico. Arajet isn't exactly known for its top-notch service, comfy flying experience, and wide range of onboard amenities, but what they do excel at is their unbeatable prices. That is, if you're flying at the lowest possible fare , with carry-on only. From Miami, round-trip tickets average only $196 flying to Punta Cana (PUJ), and from Newark (EWR) to Santo Domingo, the culture-loaded capital of the Dominican Republic , you can expect to pay roughly $208 both ways. Given their low-cost appeal, it was about time they finally debuted in the Midwest market: From November 15, Arajet service will begin between Chicago O'Hare (ORD) and Punta Cana, with base round-trip fares currently estimated at $234 (without extras). We're sure this might increase as time goes on, but for now, the predicted frequency is three-times-weekly flights, with the operation days as follows: Outbound flights departing from Chicago have a listed departure of 10:27 A.M. from ORD, arriving to PUJ at 5:12 P.M. for a total flight time of 4h45. Meanwhile, return flights from PUJ are expected to depart at 5:47 A.M. (who here's an early bird?), touching down back in ORD at 8:57 A.M. just in time for breakfast at Berghoff Cafe in Terminal 1. When it comes to Arajet's bag allowance, you should know it uses the common low-cost carrier structure: As of now, the…",
    "content": "Posted on Last updated: September 1, 2025\n\n0 Comments Posted By: Vinicius Costa Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date.\n\nAlready thinking of your next sun-drenched Caribbean getaway this winter? Before you go ahead and spend hundreds of dollars on those ‘irresistible' round-trip flights that are, in fact, not as cheap as they could be, you'll want to hear this one out:\n\nFrom November 15, Arajet, the Dominican Republic's new budget carrier, will start ultra-affordable direct flights from Chicago to Punta Cana.\n\nHome to postcard white-sand beaches hugged by teal seas, world-class resorts, and a lively entertainment district peppered with restaurants and nightclubs, it is one of the trendiest destinations in the Tropics, and it's never been cheaper to get to :\n\nYou might not have come across Arajet in your flight searches before, but that's because they're a new airline launched in 2022, and until recently, they operated to and from select hubs across the Americas.\n\nIt has grown significantly since its launch, and by 2025, it will already serve destinations such as Miami (MIA), Newark (EWR), and even San Juan (SJU) in Puerto Rico.\n\nArajet isn't exactly known for its top-notch service, comfy flying experience, and wide range of onboard amenities, but what they do excel at is their unbeatable prices. That is, if you're flying at the lowest possible fare , with carry-on only.\n\nFrom Miami, round-trip tickets average only $196 flying to Punta Cana (PUJ), and from Newark (EWR) to Santo Domingo, the culture-loaded capital of the Dominican Republic , you can expect to pay roughly $208 both ways.\n\nGiven their low-cost appeal, it was about time they finally debuted in the Midwest market:\n\nFrom November 15, Arajet service will begin between Chicago O'Hare (ORD) and Punta Cana, with base round-trip fares currently estimated at $234 (without extras).\n\nWe're sure this might increase as time goes on, but for now, the predicted frequency is three-times-weekly flights, with the operation days as follows:\n\nOutbound flights departing from Chicago have a listed departure of 10:27 A.M. from ORD, arriving to PUJ at 5:12 P.M. for a total flight time of 4h45.\n\nMeanwhile, return flights from PUJ are expected to depart at 5:47 A.M. (who here's an early bird?), touching down back in ORD at 8:57 A.M. just in time for breakfast at Berghoff Cafe in Terminal 1.\n\nWhen it comes to Arajet's bag allowance, you should know it uses the common low-cost carrier structure:\n\nAs of now, the average fares for the Comfort and Extra fares from Chicago to Punta Cana haven't been formally disclosed, but based on Arajet's historical pricing, we can expect Comfort to start at approximately $253 and Extra at $269.\n\nOnce again, these are estimates, and final prices depend on seat availability, seasonal demand, and other factors.\n\nEither way, there's no denying Arajet will be a stone in American and United's shoes , and perhaps even Frontier's, once they enter the Chicago market.\n\nWith American Airlines, the cheapest round-trip tickets going to Punta Cana from O'Hare are $328. With United, that's an even pricier $348 , and with Frontier, they average $328.\n\nIf you're flying to Punta Cana this winter, make sure you prepare in advance with our newly-launched, free-to-use Traveler Tools.\n\nUse our TOP Entry Requirement Checker to verify whether there are any visa or digital entry permit restrictions imposed on Americans, and the (already popular) Travel Advisory Check , to stay on the loop about security updates at your destination.\n\nVini, our senior lead writer at Travel Off Path, has over 60+ countries under his belt (and currently weaving tales from Paris!), and a knack for turning off-the-beaten-path experiences into informative stories that will have you packing your bags.\n\nThe Travel Off Path Advantage: Your Travel Toolkit\n\nThe 1-Minute Trip Check Our flagship tool. Solves your entire pre-flight travel planning in a few easy steps. From entry rules to hidden fees and safety.\n\nU.S. Travel Advisory Checker An easy tool to check all the latest travel advisories from the U.S. State Department.\n\nEntry Requirements Checker An easy tool to check all the entry requirements for your destination.\n\nThe Upgrade Newsletter Unlock travel tips, hot destination insights, and exclusive flight deals.\n\nJoin Our Community With over 25,000 members on Facebook!\n\nEnter your email address to subscribe to Travel Off Path's latest breaking travel news, straight to your inbox.\n\nPosted on Last updated: September 1, 2025\n\nCategories Travel , Travel News",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/New-Ultra-Cheap-Flights-Launching-From-U.S.-To-This-Trendy-Caribbean-Paradise.jpg",
    "source": "https://www.traveloffpath.com/new-ultra-cheap-flights-launching-from-u-s-to-this-trendy-caribbean-paradise/",
    "author": "Vinicius Costa"
  },
  {
    "slug": "these-3-paradise-islands-named-must-visit-destinations-this-fall",
    "title": "These 3 Paradise Islands Named Must-Visit Destinations This Fall",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "Posted on Last updated: September 1, 2025 0 Comments Posted By: Sam Sears Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date. PSLs are sure to be tasty, but you don't have to give in to the idea that the only way to enjoy the fall season is by reaching into the back of your closet for your finest checkered flannel to hit up apple orchards and tree-lined mountain roadways. There are still stunning beaches awaiting all across the globe. While some popular U.S. beach towns don't quite have the same appeal as sunny summers, that's what passports are here for. The travel experts at FlightHub have mixed personal insight and data to craft a list of must-visit fall destinations. While icons like New York, LA, and Orlando make the cut time and time again, there were some real surprises for more adventurous travelers seeking to escape axe-throwing at pumpkin patches in favor of paradisal sun-drenched shores. These 3 international paradise islands were named must-visit destinations this fall : Panama may not have been on your Bingo card for a Caribbean escape this fall, but as a recent visitor to this highly underrated and diverse utopia of wildlife, pristine beaches, and cultural delights, it earned my stamp of approval right away. While I didn't have the chance to visit the cluster of islands making up San Blas, I did visit another practically untouched seaside oasis (Portobelo) on the other side of the country, and it was definitely worth the adventure. Though San Blas is where locals send tourists for an ideal picture-perfect beach vacation, as it's more suited for flawless getaways, while Portobelo is a small town still making its way onto travelers' itineraries. In San Blas, you'll find immense beauty and a rich indigenous culture. As beautiful as this region may be, don't quite expect Cancun-level resorts. Flying into Panama City is the easy part, then you'll need to tap into your sense of wanderlust as the trek ahead is a doozy, so many hire a professional guide. Upon arrival, expect a rustic, off-grid experience with gleaming white-sand beaches, crystal-clear waters, and a lack of large-scale tourism infrastructure, which is all part of the appeal. From there, island-hop, snorkel, swim, lounge beachside, and learn all about Guna culture at your leisure. We at Travel Off Path already recently revealed another awesome Croatian destination (Zagreb) taking this Mediterranean hotspot by storm, so if you thought Dubrovnik was the only way to experience…",
    "content": "Posted on Last updated: September 1, 2025\n\n0 Comments Posted By: Sam Sears Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date.\n\nPSLs are sure to be tasty, but you don't have to give in to the idea that the only way to enjoy the fall season is by reaching into the back of your closet for your finest checkered flannel to hit up apple orchards and tree-lined mountain roadways.\n\nThere are still stunning beaches awaiting all across the globe.\n\nWhile some popular U.S. beach towns don't quite have the same appeal as sunny summers, that's what passports are here for.\n\nThe travel experts at FlightHub have mixed personal insight and data to craft a list of must-visit fall destinations.\n\nWhile icons like New York, LA, and Orlando make the cut time and time again, there were some real surprises for more adventurous travelers seeking to escape axe-throwing at pumpkin patches in favor of paradisal sun-drenched shores.\n\nThese 3 international paradise islands were named must-visit destinations this fall :\n\nPanama may not have been on your Bingo card for a Caribbean escape this fall, but as a recent visitor to this highly underrated and diverse utopia of wildlife, pristine beaches, and cultural delights, it earned my stamp of approval right away.\n\nWhile I didn't have the chance to visit the cluster of islands making up San Blas, I did visit another practically untouched seaside oasis (Portobelo) on the other side of the country, and it was definitely worth the adventure.\n\nThough San Blas is where locals send tourists for an ideal picture-perfect beach vacation, as it's more suited for flawless getaways, while Portobelo is a small town still making its way onto travelers' itineraries.\n\nIn San Blas, you'll find immense beauty and a rich indigenous culture. As beautiful as this region may be, don't quite expect Cancun-level resorts.\n\nFlying into Panama City is the easy part, then you'll need to tap into your sense of wanderlust as the trek ahead is a doozy, so many hire a professional guide.\n\nUpon arrival, expect a rustic, off-grid experience with gleaming white-sand beaches, crystal-clear waters, and a lack of large-scale tourism infrastructure, which is all part of the appeal.\n\nFrom there, island-hop, snorkel, swim, lounge beachside, and learn all about Guna culture at your leisure.\n\nWe at Travel Off Path already recently revealed another awesome Croatian destination (Zagreb) taking this Mediterranean hotspot by storm, so if you thought Dubrovnik was the only way to experience this trendy country, we've got news for you!\n\nHonestly, now is a great time to start planning your trip anywhere in Croatia for more elbow room on the beach, but the little island of Vis is a year-round tight-lipped secret.\n\nBoasting a Mediterranean climate, you know the weather is just as nice (if not better) than summer, and given the lack of crowds here anyway, it makes it even more enjoyable for a relaxing escape, wining and dining with tranquil beaches and picturesque villages wrapping the island, but don't skip the hidden cove of Stiniva (see first photo).\n\nSample local Vugava and Plavac Mali wines, hike to Mount Hum , and always grab a patio seat when possible, especially in the town of the same name (Vis), along with Komiža.\n\nDon't expect flashy resorts cramping your space on a dreamy beach. Instead, it's much easier to find boutique hotels in town.\n\nTo get here, your best bet is flying into Split and hopping on a ferry , where you'll bypass Hvar, a more popular island overshadowing Vis, even for mainstream travelers like me.\n\nIf you had to guess the top destination Americans have their eyes on in the Philippines, what would you guess?\n\nSurprise, surprise. It's Boracay, according to our last feature on this surging island.\n\nThe irony is that Boracay limits the number of daily visitors to minimize environmental impact and provide more enjoyment for beachgoers.\n\nEven with its diminutive size, this island packs a punch with powdery white-sand beaches, transparent waters, and a plethora of aquatic thrills, ranging from sailing, snorkeling, and banana boat rides, and for the ultimate relaxation, expect to be offered massages by beach vendors.\n\nWhether they're properly vetted or not is a different story…\n\nWhite Beach (living up to its name) is where you'll find premier resorts nestled against white sand, and Puka Shell Beach is more known for its seclusion and colorful shells washing ashore.\n\nIf you're a seafood lover, there are a few places across Asia that will please your palate the same way as Boracay.\n\nWith beachfront barbecues blazing fresh catches, you'll never celebrate July 4th with a backyard burger again.\n\nTo reach Boracay, many opt to fly from Manila to Caticlan and then take a ferry . Best of all, if you do get lost, the Philippines is primarily an English-speaking nation.\n\nSam, our Lead Writer & Journalist based in San Diego has visited 36 countries and written over 1000 articles with a focus on sharing his own travel experiences and shining a light on lesser-known gems.\n\nThe Travel Off Path Advantage: Your Travel Toolkit\n\nThe 1-Minute Trip Check Our flagship tool. Solves your entire pre-flight travel planning in a few easy steps. From entry rules to hidden fees and safety.\n\nU.S. Travel Advisory Checker An easy tool to check all the latest travel advisories from the U.S. State Department.\n\nEntry Requirements Checker An easy tool to check all the entry requirements for your destination.\n\nThe Upgrade Newsletter Unlock travel tips, hot destination insights, and exclusive flight deals.\n\nJoin Our Community With over 25,000 members on Facebook!\n\nEnter your email address to subscribe to Travel Off Path's latest breaking travel news, straight to your inbox.\n\nPosted on Last updated: September 1, 2025\n\nCategories Travel , Travel News",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/These-3-Paradise-Islands-Named-Must-Visit-Destinations-This-Fall.jpg",
    "source": "https://www.traveloffpath.com/these-3-paradise-islands-named-must-visit-destinations-this-fall/",
    "author": "Sam Sears"
  },
  {
    "slug": "delta-will-launch-new-nonstop-flights-to-2-of-europe-s-trendiest-sunny",
    "title": "Delta Will Launch New Nonstop Flights To 2 Of Europe’s Trendiest Sunny Destinations",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "Posted on Last updated: September 1, 2025 0 Comments Posted By: Vinicius Costa Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date. Planning a European getaway for the coming year, but you've been waiting for new nonstop routes to open from your favorite hub at Boston Logan International? This time, you're in luck, as Delta is adding not one, but two new European destinations to the Massachusetts capital's network from May 16, 2026: Madrid, Spain's capital and its leading city break, and Nice, the trendiest beach spot in the South of France. Here's everything you need to know about the new flights, and what to expect from Delta's summer 2026 strategy: Over the last few years, Delta has ramped up Europe-bound service from its Boston (BOS) base like no other, from boosting frequency to cities like London and Barcelona, to starting new flights to in-demand destinations that previously lacked a connection with Massachusetts. When it comes to Madrid, there are in fact nonstop flights from Boston to the Spanish capital already, except they're operated by Spain's own Iberia, and in the high season, they're joined by low-cost JetBlue. Be that as it may, there has never been a full-service, U.S.-based airline operating in this market. As for Nice, this will be the first time Boston-based travelers enjoy a nonstop connection to the Pearl of the French Riviera, without requiring stopovers in Paris. Previously, Delta only offered nonstop service to Nice from Atlanta, New York (JFK), and Philadelphia. Now that Madrid and Nice are in the cards, Delta will serve at least a dozen European destinations from Boston next summer. Madrid flights will be available daily, while Nice ones will initially run on a three-times-weekly schedule, on Tuesdays, Thursdays, and Saturdays. By the way, in the meantime, Barcelona flights will increase to a daily frequency from May 7, and Milan will see four-times-weekly flights from May 16. It's no wonder Delta is investing this heavily in Boston, now that Logan International hosts their Delta One Lounge and a revamped, larger Sky Club Space. In short , they're aiming to become the first choice for travelers heading to Europe. Comfort plays a huge part in it, as well. Both Madrid and Nice routes will be run on a brand new Airbus A330-900neo, with a 281-seat configuration. Out of those, 29 are reserved for Delta One (their business class) seats, 28 are for Premium Select (the equivalent to Premium Economy, 56 are Comfort+ seats (these…",
    "content": "Posted on Last updated: September 1, 2025\n\n0 Comments Posted By: Vinicius Costa Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date.\n\nPlanning a European getaway for the coming year, but you've been waiting for new nonstop routes to open from your favorite hub at Boston Logan International?\n\nThis time, you're in luck, as Delta is adding not one, but two new European destinations to the Massachusetts capital's network from May 16, 2026: Madrid, Spain's capital and its leading city break, and Nice, the trendiest beach spot in the South of France.\n\nHere's everything you need to know about the new flights, and what to expect from Delta's summer 2026 strategy:\n\nOver the last few years, Delta has ramped up Europe-bound service from its Boston (BOS) base like no other, from boosting frequency to cities like London and Barcelona, to starting new flights to in-demand destinations that previously lacked a connection with Massachusetts.\n\nWhen it comes to Madrid, there are in fact nonstop flights from Boston to the Spanish capital already, except they're operated by Spain's own Iberia, and in the high season, they're joined by low-cost JetBlue. Be that as it may, there has never been a full-service, U.S.-based airline operating in this market.\n\nAs for Nice, this will be the first time Boston-based travelers enjoy a nonstop connection to the Pearl of the French Riviera, without requiring stopovers in Paris. Previously, Delta only offered nonstop service to Nice from Atlanta, New York (JFK), and Philadelphia.\n\nNow that Madrid and Nice are in the cards, Delta will serve at least a dozen European destinations from Boston next summer. Madrid flights will be available daily, while Nice ones will initially run on a three-times-weekly schedule, on Tuesdays, Thursdays, and Saturdays.\n\nBy the way, in the meantime, Barcelona flights will increase to a daily frequency from May 7, and Milan will see four-times-weekly flights from May 16.\n\nIt's no wonder Delta is investing this heavily in Boston, now that Logan International hosts their Delta One Lounge and a revamped, larger Sky Club Space. In short , they're aiming to become the first choice for travelers heading to Europe.\n\nComfort plays a huge part in it, as well. Both Madrid and Nice routes will be run on a brand new Airbus A330-900neo, with a 281-seat configuration.\n\nOut of those, 29 are reserved for Delta One (their business class) seats, 28 are for Premium Select (the equivalent to Premium Economy, 56 are Comfort+ seats (these typically offer extra legroom), and finally, 168 seats in the Main Cabin.\n\nAs far as competition goes, Madrid is a smart move . Seeing that only JetBlue offered Boston–Madrid flights in summer, with their restrictive luggage policies and subpar in-flight services, Delta's addition will lure travelers who aren't exactly keen on budget carriers.\n\nNice, on the other hand, is a long-overdue inclusion , given the rising demand for the South of France among Americans, and the fact it was missing altogether from Boston's flight map. Better late than never, as they say.\n\nJointly, the routes will boost Boston's connectivity with Southern Europe and ensure Massachusetts travelers get to these sunny spots without layovers.\n\nAs the capital of Spain, Madrid has no shortage of world-class museums , elegant boulevards, and lush parks to discover.\n\nIt plays host to the Prado Museum, one of the largest in the world, guarding masterpieces by artists such as Goya, El Greco, and Rubens. Nearby, the Royal Palace of Madrid is Europe's largest royal residence, beating London's Buckingham Palace, except that you can visit this one on a guided tour .\n\nOver at Retiro Park, Madrid's very own ‘Central Park', tourists will find a sprawling green oasis, right in the middle of the bustling city, and when exploring the city's charming Historic Center, it's impossible to miss Plaza Mayor, an iconic square surrounded by arcaded buildings.\n\nCraving beaches and culture instead? Nice is your best bet at finding both, as Madrid, unlike many other sun-drenched gems in Spain, isn't on the coast.\n\nNice is a vibrant city straddling France's Mediterranean shoreline , best known for its picture-perfect Vieux-Nice , an Old Town peppered with local-frequented trattorias and bars , and cut through with winding, cobbled lanes, and a lively marina.\n\nIts long Promenade des Anglais is a boardwalk running along a turquoise stretch of sea, and though the beach there isn't made of the same white sand that makes neighboring Cannes so appealing, the warm waters and townscape views are unbeatable.\n\nWhether you're flying with Delta to Madrid or Nice next year, you should be prepared for upcoming changes in entry requirements that will affect all Americans traveling to Europe—this includes a new mandatory digital permit you'll need to apply for before traveling.\n\nVini, our senior lead writer at Travel Off Path, has over 60+ countries under his belt (and currently weaving tales from Paris!), and a knack for turning off-the-beaten-path experiences into informative stories that will have you packing your bags.\n\nThe Travel Off Path Advantage: Your Travel Toolkit\n\nThe 1-Minute Trip Check Our flagship tool. Solves your entire pre-flight travel planning in a few easy steps. From entry rules to hidden fees and safety.\n\nU.S. Travel Advisory Checker An easy tool to check all the latest travel advisories from the U.S. State Department.\n\nEntry Requirements Checker An easy tool to check all the entry requirements for your destination.\n\nThe Upgrade Newsletter Unlock travel tips, hot destination insights, and exclusive flight deals.\n\nJoin Our Community With over 25,000 members on Facebook!\n\nEnter your email address to subscribe to Travel Off Path's latest breaking travel news, straight to your inbox.\n\nPosted on Last updated: September 1, 2025\n\nCategories Travel , Travel News",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/Delta-Will-Launch-New-Nonstop-Flights-To-2-Of-Europes-Trendiest-Sunny-Destinations.jpg",
    "source": "https://www.traveloffpath.com/delta-will-launch-new-nonstop-flights-to-2-of-europes-trendiest-sunny-destinations/",
    "author": "Vinicius Costa"
  },
  {
    "slug": "5-underrated-u-s-cities-perfect-for-a-weekend-getaway-this-fall",
    "title": "5 Underrated U.S. Cities Perfect For A Weekend Getaway This Fall",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "Posted on Last updated: August 31, 2025 0 Comments Posted By: Travel Off Path Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date. The kids are back in school, the long, hazy days of summer are in the rearview mirror, and there’s a new kind of energy in the air. It's that magical time of year when you start thinking about cozy sweaters, crisp autumn air, and that first glorious sip of a pumpkin spice latte. You're holding on to that hope of a perfect weekend fall getaway. Sure, you could book the obvious trip to New York City, but let's be real—you'll be fighting for a patch of grass in Central Park with a million other people. What if you could get all the amazing fall vibes without the crowds? Here at Travel Off Path , we believe the best autumn trips are the ones that fly under the radar. We've found 5 incredible, underrated U.S. cities that are perfect for a quick escape this season. 🍂 While everyone flocks to Nashville or the Smokies, Chattanooga is the smart choice for an active fall weekend. Tucked into the Tennessee River Valley, the city is surrounded by mountains that explode with color in late October. The vibe is laid-back, the hiking is epic, and the views are 10/10. Forget what you think you know about “flyover country.” Kansas City is having a major moment, and fall is the perfect time to visit. This city is a powerhouse of culture, with world-class jazz clubs, a surprisingly hip arts scene, and, of course, the best barbecue on the planet. There’s a special kind of energy in a great college town in the fall, and Madison might just be the best of them all. Situated on a narrow strip of land between two sparkling lakes, this city is pure autumn magic. The air is crisp, the university gives the city a vibrant buzz, and the fall colors are spectacular. As a less-crowded and more affordable alternative to Washington D.C., Richmond is a fall getaway that punches way above its weight. This city seamlessly blends four centuries of American history with a modern, creative, and seriously cool food and beer scene. The fall foliage along the James River is the cherry on top. The capital of America's smallest state remains one of the most underrated gems on the East Coast. What it lacks in size, it more than makes up for with its Ivy League charm,…",
    "content": "Posted on Last updated: August 31, 2025\n\n0 Comments Posted By: Travel Off Path Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date.\n\nThe kids are back in school, the long, hazy days of summer are in the rearview mirror, and there’s a new kind of energy in the air. It's that magical time of year when you start thinking about cozy sweaters, crisp autumn air, and that first glorious sip of a pumpkin spice latte.\n\nYou're holding on to that hope of a perfect weekend fall getaway. Sure, you could book the obvious trip to New York City, but let's be real—you'll be fighting for a patch of grass in Central Park with a million other people.\n\nWhat if you could get all the amazing fall vibes without the crowds? Here at Travel Off Path , we believe the best autumn trips are the ones that fly under the radar. We've found 5 incredible, underrated U.S. cities that are perfect for a quick escape this season. 🍂\n\nWhile everyone flocks to Nashville or the Smokies, Chattanooga is the smart choice for an active fall weekend. Tucked into the Tennessee River Valley, the city is surrounded by mountains that explode with color in late October. The vibe is laid-back, the hiking is epic, and the views are 10/10.\n\nForget what you think you know about “flyover country.” Kansas City is having a major moment, and fall is the perfect time to visit. This city is a powerhouse of culture, with world-class jazz clubs, a surprisingly hip arts scene, and, of course, the best barbecue on the planet.\n\nThere’s a special kind of energy in a great college town in the fall, and Madison might just be the best of them all. Situated on a narrow strip of land between two sparkling lakes, this city is pure autumn magic. The air is crisp, the university gives the city a vibrant buzz, and the fall colors are spectacular.\n\nAs a less-crowded and more affordable alternative to Washington D.C., Richmond is a fall getaway that punches way above its weight. This city seamlessly blends four centuries of American history with a modern, creative, and seriously cool food and beer scene. The fall foliage along the James River is the cherry on top.\n\nThe capital of America's smallest state remains one of the most underrated gems on the East Coast. What it lacks in size, it more than makes up for with its Ivy League charm, stunning architecture, and a one-of-a-kind art scene. The cool temps in the 50s and 60s are perfect for exploring.\n\nSo this fall, skip the usual tourist traps and make some memories in a city that feels like a real discovery. Happy travels, and enjoy all the autumn vibes! 🍂\n\nThe Travel Off Path Advantage: Your Travel Toolkit\n\nThe 1-Minute Trip Check Our flagship tool. Solves your entire pre-flight travel planning in a few easy steps. From entry rules to hidden fees and safety.\n\nU.S. Travel Advisory Checker An easy tool to check all the latest travel advisories from the U.S. State Department.\n\nEntry Requirements Checker An easy tool to check all the entry requirements for your destination.\n\nThe Upgrade Newsletter Unlock travel tips, hot destination insights, and exclusive flight deals.\n\nJoin Our Community With over 25,000 members on Facebook!\n\nEnter your email address to subscribe to Travel Off Path's latest breaking travel news, straight to your inbox.\n\nPosted on Last updated: August 31, 2025\n\nCategories Travel , Travel News",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/5-Underrated-U.S.-Cities-Perfect-For-A-Weekend-Getaway-This-Fall.jpg",
    "source": "https://www.traveloffpath.com/5-underrated-u-s-cities-perfect-for-a-weekend-getaway-this-fall/",
    "author": "Travel Off Path"
  },
  {
    "slug": "4-important-tips-for-visiting-cancun-this-fall-according-to-experts",
    "title": "4 Important Tips For Visiting Cancun This Fall According To Experts",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "Posted on Last updated: August 31, 2025 0 Comments Posted By: Vinicius Costa Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date. Fall is arguably the best period to visit Cancun if you're hoping for smaller crowds and cheaper prices. After all, the July and August crowds are gone, hotels deliberately lower prices to attract more guests, and there are getaway deals galore… or are there? For years now, sun-seekers on a budget have waited impatiently for September to book their Cancun vacay, knowing they would get more bang for their buck, but as the experts have told us in 2025, this may no longer be the case. After all, ‘low' and ‘high' seasons are no longer existing concepts in the Caribbean hub. That's one of 4 things the Cancun Sun , the leading independent English-speaking authority on all things Mayan Riviera, has shared as we head into the (supposedly) quieter months: If you're headed for Cancun this upcoming season, the main thing you should know is that those images of a deserted hotel strip, with a wide availability of first-come, first-served restaurants, and open slots on guided tours, may no longer be the case. As they have noted, ‘low season' now looks more like ‘less busy' . There are lower crowds than in winter, that's for sure, but if you're visiting on the weekend, you should expect a major influx of beach bums at public bathing areas, and partygoers to flock into the entertainment district. Long gone are the days you could just ‘chance it' and book stuff last-minute in the fall. Be it trendy restaurants, popular activities, like visiting cenotes or Mayan ruins, or spa appointments at your resort, you'd be wise to secure spots in advance. The Cancun Sun also reiterates that, despite the continuous crowding, the type of crowd changes. After all, schools across the United States and Canada have resumed classes, so you can for sure expect to see fewer families with children and adolescents in resorts. This helps contribute to the overall adult-centered, more laid-back feel. That being said, you can never entirely rule out children running around and splashing around in the pool when all you need is some peace and quiet. Your fellow Americans may be gone, but there will be families from other parts of the world that do not operate under the U.S. school schedule. In those cases, it's best to book an adults-only resort. Here are some options, and their average…",
    "content": "Posted on Last updated: August 31, 2025\n\n0 Comments Posted By: Vinicius Costa Post may contain affiliate links; we may receive compensation if you click links to those products. This may impact how offers are presented. Our site does not include all offers available. See our Disclosure & Privacy Policy for more info.Content on page accurate as of posting date.\n\nFall is arguably the best period to visit Cancun if you're hoping for smaller crowds and cheaper prices.\n\nAfter all, the July and August crowds are gone, hotels deliberately lower prices to attract more guests, and there are getaway deals galore… or are there?\n\nFor years now, sun-seekers on a budget have waited impatiently for September to book their Cancun vacay, knowing they would get more bang for their buck, but as the experts have told us in 2025, this may no longer be the case.\n\nAfter all, ‘low' and ‘high' seasons are no longer existing concepts in the Caribbean hub.\n\nThat's one of 4 things the Cancun Sun , the leading independent English-speaking authority on all things Mayan Riviera, has shared as we head into the (supposedly) quieter months:\n\nIf you're headed for Cancun this upcoming season, the main thing you should know is that those images of a deserted hotel strip, with a wide availability of first-come, first-served restaurants, and open slots on guided tours, may no longer be the case.\n\nAs they have noted, ‘low season' now looks more like ‘less busy' . There are lower crowds than in winter, that's for sure, but if you're visiting on the weekend, you should expect a major influx of beach bums at public bathing areas, and partygoers to flock into the entertainment district.\n\nLong gone are the days you could just ‘chance it' and book stuff last-minute in the fall. Be it trendy restaurants, popular activities, like visiting cenotes or Mayan ruins, or spa appointments at your resort, you'd be wise to secure spots in advance.\n\nThe Cancun Sun also reiterates that, despite the continuous crowding, the type of crowd changes.\n\nAfter all, schools across the United States and Canada have resumed classes, so you can for sure expect to see fewer families with children and adolescents in resorts. This helps contribute to the overall adult-centered, more laid-back feel.\n\nThat being said, you can never entirely rule out children running around and splashing around in the pool when all you need is some peace and quiet. Your fellow Americans may be gone, but there will be families from other parts of the world that do not operate under the U.S. school schedule.\n\nIn those cases, it's best to book an adults-only resort. Here are some options, and their average September nightly rate:\n\nAs you might have noticed from the averages given above, it's getting increasingly harder to come across those jaw-dropping, great hotel deals in Cancun.\n\nHistorically, September was notorious for its irresistible rates, usually of 50% off. In the words of the Cancun Sun , this era is now ‘over':\n\nGranted, there is still better value to be found in the fall compared to the winter period, but the rising demand from Cancun, not only from Americans, but travelers worldwide, has resulted in prices staying at a plateau instead of dropping significantly.\n\nWhen it comes to tours and private transportation, you might even notice there's no difference at all. Based on the expert advice, the best way to save money is to look for a ‘package deal': there are still plenty of ‘5th Night Free' and flight-and-hotel combos in offer.\n\nLast but not least, we have the weather conditions. There's no way of getting around it: September is peak hurricane season, and you should be prepared for tropical storms.\n\nThis does not mean you will definitely experience a hurricane visiting Cancun in September, as the probability remains low, but if it does happen, the city is probably one of the best-equipped in the Caribbean to deal with the phenomenon.\n\nResorts have their own hurricane codes and strict routines to ensure guests stay safe in the (unlikely) event of a seriously-disruptive hurricane, and you can always stay up to date with hurricane announcements through the National Hurricane Center.\n\nOn the upside, you can count on far less sargassum along the shoreline.\n\nAll in all, the fall remains an unbeatable period for experiencing Cancun's more ‘chill' side—just make sure you pack a raincoat. You know, just in case it starts pouring heavily precisely during your half-hour stroll outside the resort grounds.\n\nVini, our senior lead writer at Travel Off Path, has over 60+ countries under his belt (and currently weaving tales from Paris!), and a knack for turning off-the-beaten-path experiences into informative stories that will have you packing your bags.\n\nThe Travel Off Path Advantage: Your Travel Toolkit\n\nThe 1-Minute Trip Check Our flagship tool. Solves your entire pre-flight travel planning in a few easy steps. From entry rules to hidden fees and safety.\n\nU.S. Travel Advisory Checker An easy tool to check all the latest travel advisories from the U.S. State Department.\n\nEntry Requirements Checker An easy tool to check all the entry requirements for your destination.\n\nThe Upgrade Newsletter Unlock travel tips, hot destination insights, and exclusive flight deals.\n\nJoin Our Community With over 25,000 members on Facebook!\n\nEnter your email address to subscribe to Travel Off Path's latest breaking travel news, straight to your inbox.\n\nPosted on Last updated: August 31, 2025\n\nCategories Travel , Travel News",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/07/This-Is-How-To-Book-The-Perfect-Hotel-In-Cancun-According-To-Experts.jpg",
    "source": "https://www.traveloffpath.com/4-important-tips-for-visiting-cancun-this-fall-according-to-experts/",
    "author": "Vinicius Costa"
  },
  {
    "slug": "the-himalayan-village-where-you-can-see-the-cosmos",
    "title": "The Himalayan village where you can see the cosmos",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "In the Moon-like landscape of Hanle, the jet-black skies reveal otherworldly starry skies that lure travellers from far and wide.\n\nBut can locals preserve the natural darkness?",
    "content": "In the Moon-like landscape of Hanle, the jet-black skies reveal otherworldly starry skies that lure travellers from far and wide.\n\nBut can locals preserve the natural darkness?",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lzs4pc.jpg",
    "source": "https://www.bbc.com/travel/article/20250829-the-himalayan-village-where-you-can-see-the-cosmos?ocid=global_travel_rss",
    "author": "AventurOO Editorial"
  },
  {
    "slug": "the-chaotic-mega-market-feeding-mexico-city",
    "title": "The chaotic mega-market feeding Mexico City",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "How Central de Abasto, the world's largest market hidden in Mexico City's so-called \"trash district\", has become the unlikely backbone of its fine-dining revolution.",
    "content": "How Central de Abasto, the world's largest market hidden in Mexico City's so-called \"trash district\", has become the unlikely backbone of its fine-dining revolution.",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lzqm6f.jpg",
    "source": "https://www.bbc.com/travel/article/20250829-the-market-that-feeds-mexico-citys-best-restaurants?ocid=global_travel_rss",
    "author": "AventurOO Editorial"
  },
  {
    "slug": "where-americans-are-spending-labor-day-weekend",
    "title": "Where Americans are spending Labor Day Weekend",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "Seeing Shakespeare in New York, Bright Eyes in Seattle and Roald Dahl's Enormous Crocodile in London – these five destinations are topping lists for the last holiday of summer.",
    "content": "Seeing Shakespeare in New York, Bright Eyes in Seattle and Roald Dahl's Enormous Crocodile in London – these five destinations are topping lists for the last holiday of summer.",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lznqcf.jpg",
    "source": "https://www.bbc.com/travel/article/20250828-where-americans-are-spending-labor-day-weekend?ocid=global_travel_rss",
    "author": "AventurOO Editorial"
  },
  {
    "slug": "france-s-picture-perfect-car-free-islands",
    "title": "France's picture-perfect car-free islands",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "The Hyères Islands offer an idyllic escape into protected pine forests, unspoilt beaches – and one of France's most unique communities.",
    "content": "The Hyères Islands offer an idyllic escape into protected pine forests, unspoilt beaches – and one of France's most unique communities.",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lz9p7m.jpg",
    "source": "https://www.bbc.com/travel/article/20250827-the-french-rivieras-picture-perfect-car-free-island-escape?ocid=global_travel_rss",
    "author": "AventurOO Editorial"
  },
  {
    "slug": "how-to-plan-an-extremely-last-minute-trip",
    "title": "How to plan an extremely last-minute trip",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "Being willing to switch when, where and how you travel can still land you affordable trips on a week's notice.",
    "content": "Being willing to switch when, where and how you travel can still land you affordable trips on a week's notice.",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lyz47b.jpg",
    "source": "https://www.bbc.com/travel/article/20250825-how-to-plan-an-extremely-last-minute-trip?ocid=global_travel_rss",
    "author": "AventurOO Editorial"
  },
  {
    "slug": "pay-what-you-can-for-a-michelin-starred-meal",
    "title": "'Pay what you can' for a Michelin-starred meal",
    "category": "Stories",
    "date": "2025-09-01",
    "excerpt": "Michelin-starred Masala y Maiz hopes to spread the trend across Mexico and around the world.",
    "content": "Michelin-starred Masala y Maiz hopes to spread the trend across Mexico and around the world.",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lyzlkq.jpg",
    "source": "https://www.bbc.com/travel/article/20250825-pay-what-you-can-for-a-michelin-starred-meal?ocid=global_travel_rss",
    "author": "AventurOO Editorial"
  },
  {
    "slug": "the-artist-whose-fauci-portraits-enraged-the-white-house",
    "title": "The Artist Whose Fauci Portraits Enraged the White House",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . In 2019, Hugo Crosthwaite became the first Latino artist to win the Smithsonian National Portrait Gallery’s (NPG) prestigious triennial Outwin Boochever Portrait Competition. The Tijuana-born and San Diego-based illustrator received the contest’s grand prize: $25,000 and a portrait commission for the museum’s permanent collection. He chose to depict Anthony Fauci, then the director of the National Institute of Allergy and Infectious Diseases (NIAID), in a stop-motion format that captures the nuances of his complicated legacy, including his criticized and then celebrated oversight of the HIV/AIDs epidemic. Last week, Crosthwaite found his hard-won commission on a list of Smithsonian items that the White House found objectionable. He was one of at least three Mexican-born artists whose work was included on Trump’s art hit list , along with illustrator Rigoberto González and painter Felipe Galindo Gómez . “My first reaction was surprise,” Crosthwaite shared in an interview with Hyperallergic. “But then later on, [I] felt a bit of pride to be included in this list of other wonderful artists and wonderful projects that talk about the diversity of the United States’ history.” Hugo Crosthwaite was born in Tijuana and now lives in San Diego. In 2022, after winning the Outwin competition, Crosthwaite and the NPG considered a list of individuals for a portrait. They agreed on Fauci as the commission’s subject. At the time, the infectious disease specialist was a polarized figure: a revered pandemic hero and a detested political opponent of the right. Get the latest art news, reviews and opinions from Hyperallergic. “I jumped at the chance of doing this because it was 2022, we were in the middle of the COVID-19 pandemic,” Crosthwaite told Hyperallergic . “He became a symbol of this fight between science and truth, against conspiracy theories; Dr. Fauci kind of epitomizes the nation’s current political divide.” The five-minute stop motion animation, “A Portrait of Dr. Anthony Fauci” (2022), begins by portraying him as a young scientist in a lab. Later, a man infected by an unnamed virus becomes emaciated until he disappears into a black hole that morphs into a scene from ACT UP protests. Men carry signs that read “Silence = Death” and “Killed by the System.” Behind them, skeletons look to the sky. Still…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nIn 2019, Hugo Crosthwaite became the first Latino artist to win the Smithsonian National Portrait Gallery’s (NPG) prestigious triennial Outwin Boochever Portrait Competition. The Tijuana-born and San Diego-based illustrator received the contest’s grand prize: $25,000 and a portrait commission for the museum’s permanent collection. He chose to depict Anthony Fauci, then the director of the National Institute of Allergy and Infectious Diseases (NIAID), in a stop-motion format that captures the nuances of his complicated legacy, including his criticized and then celebrated oversight of the HIV/AIDs epidemic.\n\nLast week, Crosthwaite found his hard-won commission on a list of Smithsonian items that the White House found objectionable. He was one of at least three Mexican-born artists whose work was included on Trump’s art hit list , along with illustrator Rigoberto González and painter Felipe Galindo Gómez .\n\n“My first reaction was surprise,” Crosthwaite shared in an interview with Hyperallergic. “But then later on, [I] felt a bit of pride to be included in this list of other wonderful artists and wonderful projects that talk about the diversity of the United States’ history.”\n\nHugo Crosthwaite was born in Tijuana and now lives in San Diego. In 2022, after winning the Outwin competition, Crosthwaite and the NPG considered a list of individuals for a portrait. They agreed on Fauci as the commission’s subject. At the time, the infectious disease specialist was a polarized figure: a revered pandemic hero and a detested political opponent of the right.\n\nGet the latest art news, reviews and opinions from Hyperallergic.\n\n“I jumped at the chance of doing this because it was 2022, we were in the middle of the COVID-19 pandemic,” Crosthwaite told Hyperallergic . “He became a symbol of this fight between science and truth, against conspiracy theories; Dr. Fauci kind of epitomizes the nation’s current political divide.”\n\nThe five-minute stop motion animation, “A Portrait of Dr. Anthony Fauci” (2022), begins by portraying him as a young scientist in a lab. Later, a man infected by an unnamed virus becomes emaciated until he disappears into a black hole that morphs into a scene from ACT UP protests. Men carry signs that read “Silence = Death” and “Killed by the System.” Behind them, skeletons look to the sky.\n\nStill from “A Portrait of Dr. Anthony Fauci” (2022) The artwork references the AIDs memorial quilt before transitioning into a segment about the COVID-19 pandemic, in which a woman’s lungs explode into tiny bits of paper. Fauci is portrayed next to the White House press briefing room podium, where he often gave virus updates alongside Trump. Crosthwaite included a thumbs-up icon moving erratically up and down behind the podium, and Fauci off to the side. He also captured anti-Fauci sentiment and the right-wing rejection of vaccines, at one point portraying the scientist with devil horns. The stop-motion sequence ends with a woman receiving a vaccine, which cuts to a portrait of an aging Fauci.\n\nThe animation captured anti-Fauci sentiment and the right-wing rejection of vaccines. Crosthwaite told Hyperallergic that he doubts the Trump administration actually watched the video, instead targeted the work because of his identity. He rebuffed the White House’s Smithsonian list as a mediocre attempt to win a culture war, and said being included on the list was a badge of honor.\n\n“The portrait was done from the perspective of a Mexican-American artist, someone who’s cognizant of the impact of age and COVID-19 on my community, which is presented in the animation … the diverse people who are being attacked by viruses,” he said.\n\nThe artworks that Crosthwaite initially submitted to the Outwin competition had nothing to do with Fauci. In fact, the work that secured his national win was a different stop-motion animation, telling the story of a woman he met who had crossed the US-Mexico border illegally.\n\nCrosthwaite commended the Outwin prize’s capacity to open doors for artists like himself. Any artist residing in the United States who is at least 18 years old is eligible to submit to the competition. For Crosthwaite, it was life-changing.\n\n“Getting the commission to do the portrait of Dr. Fauci is actually a great honor — being part of the Smithsonian,” Crosthwaite told Hyperallergic. “My piece is part of the record of American history.”\n\nCrosthwaite found his hard-won commission on a list of Smithsonian items that the White House found objectionable. Still from “A Portrait of Dr. Anthony Fauci” (2022)\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Anthony Fauci , National Portrait Gallery , Trump Administration Isa Farfan x Isa Farfan is a staff reporter for Hyperallergic. In May 2024, she graduated from Barnard College, where she studied Political Science and English and served as the Columbia Daily Spectator's Arts &... More by Isa Farfan",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/whitehousefauci.jpeg?fit=2140%2C1610&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038060/hugo-crosthwaite-artist-whose-fauci-portraits-enraged-the-white-house/",
    "author": "Isa Farfan"
  },
  {
    "slug": "the-shocking-allure-of-erotic-abstraction",
    "title": "The Shocking Allure of Erotic Abstraction",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . LONDON — Some of the Courtauld’s previous exhibitions have suffered from insufficient curation . Abstract Erotic: Louise Bourgeois, Alice Adams, Eva Hesse , on the other hand, strikes the exact right balance. Drawing on scholar Jo Applin’s research, curator Alexandra Gerstein has taken as a starting point the work of feminist curator and critic Lucy Lippard, who coined the titular term to describe this sensuous s trand of art emerging in 1960s New York. Making perhaps the best use yet of the Courtauld’s teeny exhibition spaces next to the permanent collection, this small but unstuffed show gives proper breathing space for artistic dialogue and, crucially, for the viewer to engage in exploring differences and similarities between works and practices for themselves. In 1966, Lippard curated the exhibition Eccentric Abstraction to capture a new wave of sculptures created from unusual, pliable materials like wire, plastic mesh, netting, and latex, which evoked tactile organic forms and, by extension, the human body. This is the Courtauld’s first show devoted to standalone sculpture, and the contrast between these blob-like forms and its Impressionist-heavy permanent collection may go some way to recreate just how different — even alarming — these pieces will have appeared to 1960s audiences just getting over the shock of Abstract Expressionism’s rehauling of formalist painting. The three artists are each afforded an introductory caption presenting historical context. No direct written comparisons are made between them, nor any attempt to force commonality, for historically, there is none other than their working in generally the same space and time. This is good curating: The show allows viewers to ask and think for themselves. Its skill lies in making suggestions via the pieces selected for display, allowing for robust visual comparison. Viewers won’t be able to ignore the strain of eroticism that stems from their irresistible tactility, which is both alluring and fear-inducing, nor their uncanny resemblance to certain human appendages ( ahem ). Get the latest art news, reviews and opinions from Hyperallergic. Applin and Gerstein do point out that all three artists’ experimentation with latex marked a turning point in their explorations of eroticism and the unconscious. The exhibition’s most well-known artist, Bourgeois, was born in Paris in 1911 and moved to New…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nLONDON — Some of the Courtauld’s previous exhibitions have suffered from insufficient curation . Abstract Erotic: Louise Bourgeois, Alice Adams, Eva Hesse , on the other hand, strikes the exact right balance. Drawing on scholar Jo Applin’s research, curator Alexandra Gerstein has taken as a starting point the work of feminist curator and critic Lucy Lippard, who coined the titular term to describe this sensuous s trand of art emerging in 1960s New York. Making perhaps the best use yet of the Courtauld’s teeny exhibition spaces next to the permanent collection, this small but unstuffed show gives proper breathing space for artistic dialogue and, crucially, for the viewer to engage in exploring differences and similarities between works and practices for themselves.\n\nIn 1966, Lippard curated the exhibition Eccentric Abstraction to capture a new wave of sculptures created from unusual, pliable materials like wire, plastic mesh, netting, and latex, which evoked tactile organic forms and, by extension, the human body. This is the Courtauld’s first show devoted to standalone sculpture, and the contrast between these blob-like forms and its Impressionist-heavy permanent collection may go some way to recreate just how different — even alarming — these pieces will have appeared to 1960s audiences just getting over the shock of Abstract Expressionism’s rehauling of formalist painting.\n\nThe three artists are each afforded an introductory caption presenting historical context. No direct written comparisons are made between them, nor any attempt to force commonality, for historically, there is none other than their working in generally the same space and time. This is good curating: The show allows viewers to ask and think for themselves. Its skill lies in making suggestions via the pieces selected for display, allowing for robust visual comparison. Viewers won’t be able to ignore the strain of eroticism that stems from their irresistible tactility, which is both alluring and fear-inducing, nor their uncanny resemblance to certain human appendages ( ahem ).\n\nGet the latest art news, reviews and opinions from Hyperallergic.\n\nApplin and Gerstein do point out that all three artists’ experimentation with latex marked a turning point in their explorations of eroticism and the unconscious. The exhibition’s most well-known artist, Bourgeois, was born in Paris in 1911 and moved to New York in 1938. Duly included here is her “Filette (Sweeter Version)” (1968–99/ 2006), unmistakably an erect penis (or, more accurately, one yanked upwards by string) in urethane rubber, given the ambiguous French title “Little Girl.” Adams graduated from Columbia University with a degree in Fine Arts in 1953 before becoming an accomplished weaver. Her foray into obscure materials is here represented by such pieces as the nearby “Expanded Cylinder” (1970), in which she allowed latex foam to expand and set into a constricting tube of chain link, producing a regular weave-like texture while maintaining a phallic, slippery form. Finally, Hesse, born in 1936 in Hamburg before settling in New York, made sculptures of forms bound, twisted, and caught in netting. Applin and Gerstein draw out the latex connection again via the caption, which quotes Hesse on the material’s inevitable deterioration: “Art doesn’t last; life doesn’t last.” Fittingly, though unfortunately, there are no latex examples here.\n\nInstallation view of works by Eva Hesse It is also unfortunate that this small but perfectly formed show was relatively empty on a weekend. The scrappy, experimental mark-making explored by these three pioneering artists is one important strain in the development of feminist art. Their unsettling forms provoke, titillate, and amuse — welcome responses to female voices and artistic expression. Perhaps it is reflective of trends in audience attention that a solid academic show like this should be less visited than the packed-out recent exhibitions on Peter Doig or yet more Impressionism . We all know sex sells: Does the marketing perhaps need to shout “Eroticism!” or “Rubber penises!” to get punters through the door these days?\n\nInstallation view of Louise Bourgeois, “Filette (Sweeter Version)” (1968–99/ 2006) (left) and Alice Adams, “Expanded Cylinder” (1970) Installation view of Abstract Erotic: Louise Bourgeois, Eva Hesse, Alice Adams , featuring works by Eva Hesse and Alice Adams Abstract Erotic: Louise Bourgeois, Eva Hesse, Alice Adams continues at the Courtauld Gallery (Somerset House, London) through September 14. The exhibition was curated by Alexandra Gerstein based on the research of Jo Applin.\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Courtauld Gallery , London , Sculpture Olivia McEwan London based Olivia McEwan is a trained art historian with BA and MA degrees from the Courtauld Institute, now a freelance writer focusing on the London art world; this academic background contributing... More by Olivia McEwan",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/eed0c-scaled.jpeg?fit=2560%2C2113&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1035805/the-shocking-allure-of-erotic-abstraction-courtauld-gallery/",
    "author": "Olivia McEwan"
  },
  {
    "slug": "reclaiming-a-whitewashed-history-of-the-great-depression",
    "title": "Reclaiming a Whitewashed History of the Great Depression",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . When the United States Department of Agriculture established the Farm Security Administration (FSA) in 1937, hoping to provide aid to rural communities affected by the Great Depression, it also implemented a photography project headed by government official Roy Stryker. The photographs were meant to generate support for the agency, allowing the public to witness the impacts of the Depression for themselves. Made by recruited photographers and then selected by Stryker for inclusion in traveling exhibitions and news outlets, the chosen images overwhelmingly depicted White families — a narrow and literally whitewashed view of rural America. Crafting Sanctuaries: Black Spaces of the Black Great Depression South , a new exhibition at the Museum of Art and Light in Manhattan, Kansas, showcases a broader view of FSA imagery, focusing on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, Russell Lee, Marion Post Wolcott, Arthur Rothstein, Ben Shahn, and Jack Delano across six states: Alabama, Georgia, Louisiana, Florida, Mississippi, and Missouri. Presented in partnership with Art Bridges Foundation, the photos highlight the intimacy of life among one’s community — private quarters, public gathering spaces — and the care taken to build one together. The exhibition, curator Tamir Williams told Hyperallergic , “is an examination of the significance of Black Southerners investing in their spatial worlds — and more largely in beauty — while living through this intense period of economic hardship and racial violence.” Get the latest art news, reviews and opinions from Hyperallergic. During the summer of 2023, Ashley Holland, curator and director of Curatorial Initiatives for the Art Bridges Foundation, approached Williams to curate its first in-house traveling exhibition, drawing from the FSA photography collection. At the time, they’d just begun a job there as a curatorial research assistant. “I came across Nicholas Natanson’s The Black Image in the New Deal: The Politics of FSA Photography (1992) and Sarah Boxer’s ‘ Whitewashing the Great Depression ’ (2020) for The Atlantic ,” Williams said. “I knew that I wanted to focus on this issue of the absence of Black and other non-White persons from the larger visual memory of the Great Depression — and specifically explore how and why this exclusion happened and how it could be redressed.” Williams spent a…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nWhen the United States Department of Agriculture established the Farm Security Administration (FSA) in 1937, hoping to provide aid to rural communities affected by the Great Depression, it also implemented a photography project headed by government official Roy Stryker. The photographs were meant to generate support for the agency, allowing the public to witness the impacts of the Depression for themselves. Made by recruited photographers and then selected by Stryker for inclusion in traveling exhibitions and news outlets, the chosen images overwhelmingly depicted White families — a narrow and literally whitewashed view of rural America.\n\nCrafting Sanctuaries: Black Spaces of the Black Great Depression South , a new exhibition at the Museum of Art and Light in Manhattan, Kansas, showcases a broader view of FSA imagery, focusing on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, Russell Lee, Marion Post Wolcott, Arthur Rothstein, Ben Shahn, and Jack Delano across six states: Alabama, Georgia, Louisiana, Florida, Mississippi, and Missouri.\n\nPresented in partnership with Art Bridges Foundation, the photos highlight the intimacy of life among one’s community — private quarters, public gathering spaces — and the care taken to build one together. The exhibition, curator Tamir Williams told Hyperallergic , “is an examination of the significance of Black Southerners investing in their spatial worlds — and more largely in beauty — while living through this intense period of economic hardship and racial violence.”\n\nGet the latest art news, reviews and opinions from Hyperallergic.\n\nDuring the summer of 2023, Ashley Holland, curator and director of Curatorial Initiatives for the Art Bridges Foundation, approached Williams to curate its first in-house traveling exhibition, drawing from the FSA photography collection. At the time, they’d just begun a job there as a curatorial research assistant.\n\n“I came across Nicholas Natanson’s The Black Image in the New Deal: The Politics of FSA Photography (1992) and Sarah Boxer’s ‘ Whitewashing the Great Depression ’ (2020) for The Atlantic ,” Williams said. “I knew that I wanted to focus on this issue of the absence of Black and other non-White persons from the larger visual memory of the Great Depression — and specifically explore how and why this exclusion happened and how it could be redressed.”\n\nWilliams spent a week at the Library of Congress poring over the digital FSA collection. They were drawn to images of small homes built by both White and Black laborers, particularly in La Forge, Missouri. Curious about “what home and homemaking might have looked like for other Black persons and families beyond La Forge,” they expanded their research.\n\nThe exhibition’s photographs are reverent, offering glimpses into otherwise unseen instances of Black domesticity and community. “I find Jack Delano’s ‘Negro tenant family near Greensboro, Alabama’ (1941) to be incredibly striking,” shared Javier Rivero Ramos, associate curator at Art Bridges. In the image, a young family poses in their home, the walls and ceilings plastered and reinforced with newspaper clippings, a kitten at their feet. “It seems like every conceivable emotion, thought, and event unfolding through the country is somehow refracted in the image,” Ramos added. Ibby Ouweleen, Art Bridges curatorial associate, said she was “taken by Marion Post Wolcott’s interior scene of three children and a dog in their family home, which feels sort of magical and mundane at once.”\n\nArthur Rothstein, “Home of Negro family. Birmingham, Alabama” (1937/ 2024), silver gelatin print The exhibition is displayed in tandem with Sanctuary in Motion , a companion installation developed in collaboration with the Yuma Street Cultural Center. Kristy Peterson, vice president of Learning, Engagement, and Visitor Experiences at the museum, pointed to the history of the site.\n\n“Manhattan, Kansas, has a rich history as a town site established by abolitionist settlers, circa 1855,” Peterson told Hyperallergic . “ Sanctuary in Motion shares information about Manhattan’s history and community, and tells the story of Yuma Street [part of the city’s Historic District] … and its significance as a sanctuary where families made something out of nothing.”\n\nCrafting Sanctuaries , which runs through next spring, is both a corrective and a meditation. “It is my hope that these photographs allow viewers to see and witness how Black Southerners adopted expansive definitions of beauty to craft personal and communal sanctuaries and spaces of respite,” Williams said.\n\nArthur Rothstein, “Interior of the old Pettway home, now inhabited by John Miller, foreman of the Gees Bend Negroes. Alabama” (1937/ 2024), silver gelatin print\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Photography , Previews Monica Uszerowicz Monica Uszerowicz is a writer born and based in New York. More by Monica Uszerowicz",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/dzNBe-scaled.jpeg?fit=2560%2C1843&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038134/reclaiming-a-whitewashed-history-of-the-great-depression-museum-art-light-kansas/",
    "author": "Monica Uszerowicz"
  },
  {
    "slug": "art-dealers-get-candid-ahead-of-the-armory-show",
    "title": "Art Dealers Get Candid Ahead of the Armory Show",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Joe Amrhein and Susan Swenson were going to sit out the Armory Show this fall for the first time in a quarter century until they got a call last month from the fair’s director. The owners of Pierogi Gallery in Brooklyn’s Williamsburg neighborhood initially did not apply this year due to the show’s rising booth costs, which can exceed tens of thousands of dollars. Pierogi is planning the next phase of its business, which could include relocating to Lower Manhattan . But Armory executives Kyla McMillan and J. Tyler Woodall appealed to Pierogi and the fair’s shared history — in 2016, Amrhein suggested the Armory use an empty space to display Jonathan Schipper’s installation of a Volkswagen Golf crashing into a wall; the presentation of large-scale art has since become a cornerstone of the show. They recently negotiated a smaller exhibition space for Pierogi with a lower rate, enabling the gallery to return. “We had been on the fence about it since the economy is very uncertain and it’s a big investment,” Swenson said. “We’re not one of the big box galleries. Some of them have their own economies now.” Get the latest art news, reviews and opinions from Hyperallergic. The Armory Show has come a long way from exhibiting several New York gallerists on three floors of the Gramercy Park Hotel in the mid-1990s. Since 2021, the fair has set up camp at the spacious Javits Center near Manhattan’s Hudson Yards, where it will host some 230 galleries from more than 35 countries from September 4 through 7. The show also has new owners. Two years after Frieze acquired the Armory Show and EXPO Chicago, its parent company, Endeavor Group Holdings, sold its roster of art fairs for $200 million to Hollywood superagent Ari Emmanuel. The former Endeavor CEO envisions Frieze as a key piece of a new global events company he formed this year, and perhaps one positioned to compete with Art Basel’s dominance in the contemporary art market. But with a reported downturn in the market, galleries have been weighing their options. Once mainstays at the Armory, blue-chip institutions have instead drifted toward Frieze’s spring fair , the Art Dealers Association of America’s (ADAA) Art Show (before it…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nJoe Amrhein and Susan Swenson were going to sit out the Armory Show this fall for the first time in a quarter century until they got a call last month from the fair’s director.\n\nThe owners of Pierogi Gallery in Brooklyn’s Williamsburg neighborhood initially did not apply this year due to the show’s rising booth costs, which can exceed tens of thousands of dollars. Pierogi is planning the next phase of its business, which could include relocating to Lower Manhattan .\n\nBut Armory executives Kyla McMillan and J. Tyler Woodall appealed to Pierogi and the fair’s shared history — in 2016, Amrhein suggested the Armory use an empty space to display Jonathan Schipper’s installation of a Volkswagen Golf crashing into a wall; the presentation of large-scale art has since become a cornerstone of the show. They recently negotiated a smaller exhibition space for Pierogi with a lower rate, enabling the gallery to return.\n\n“We had been on the fence about it since the economy is very uncertain and it’s a big investment,” Swenson said. “We’re not one of the big box galleries. Some of them have their own economies now.”\n\nGet the latest art news, reviews and opinions from Hyperallergic.\n\nThe Armory Show has come a long way from exhibiting several New York gallerists on three floors of the Gramercy Park Hotel in the mid-1990s. Since 2021, the fair has set up camp at the spacious Javits Center near Manhattan’s Hudson Yards, where it will host some 230 galleries from more than 35 countries from September 4 through 7.\n\nThe show also has new owners. Two years after Frieze acquired the Armory Show and EXPO Chicago, its parent company, Endeavor Group Holdings, sold its roster of art fairs for $200 million to Hollywood superagent Ari Emmanuel. The former Endeavor CEO envisions Frieze as a key piece of a new global events company he formed this year, and perhaps one positioned to compete with Art Basel’s dominance in the contemporary art market.\n\nBut with a reported downturn in the market, galleries have been weighing their options.\n\nOnce mainstays at the Armory, blue-chip institutions have instead drifted toward Frieze’s spring fair , the Art Dealers Association of America’s (ADAA) Art Show (before it was abruptly canceled this year), or TEFAF New York — or they are skipping the New York fairs entirely. David Zwirner hasn’t exhibited at the Amory Show since 2022 , and chose to show at ADAA several years before that. Pace Gallery’s last year at the Armory was 2021 . Gagosian hasn’t shown at the Amory since 2020 , back when it was held at Piers 92 and 94. Lisson hasn’t been at the fair since 2019 .\n\nOthers are busy courting international buyers in Asia and the Middle East, where Art Basel Qatar will launch in Doha in February 2026. It doesn’t help that Frieze is competing against itself: Its three-year-old Frieze Seoul fair overlaps with Armory next week, forcing galleries to choose.\n\n“Everybody is asking where we should be investing our energy and time and our focus,” David Norr, partner at James Cohan Gallery, told Hyperallergic . “The cost of shipping, travel and built-in expenses in participation in these fairs continues to go up.”\n\nAlejandro García Contreras, “La balada de Jennie Ruby Jane” (2025) (image courtesy Swivel Gallery) Others are simply skipping the season altogether. Jack Shainman stepped back from showing at New York fairs in recent years to focus on its exhibitions in Chelsea and the newly renovated Clock Tower building in Civic Center. After wildfires ravaged Los Angeles in January, Night Gallery chose a gallery residency at Arsenal Contemporary instead of participating in several international art fairs.\n\n“This is both a result of the market and our ability to be in multiple places at once,” Night Gallery spokesperson Shy Watson said. “We are trying to create alternative models of exhibition, promotion, sales, and community.”\n\nThe Armory is used to a relatively high degree of churn. This year, 55 galleries are participating in the fair for the first time, with another 20 returning from a hiatus, roughly in line with figures from 2024, a fair spokesperson said.\n\nBut the relative lack of large commercial institutions at the show presents an opportunity for New York galleries to cultivate new collectors and promote their artists to a broader audience.\n\n“We feel like a large gallery there even though in most art fair contexts we’re very much in the middle,” said Norr of James Cohan. “It feels like you’re giving back some attention to a local ecosystem that’s not only familiar, but wants engagement.”\n\nLeft: Zanele Muholi, “Bester VIII, Philadelphia” (2018) (© Zanele Muholi, courtesy Yancey Richardson, New York) Right: Jason Bailer Lost, “Sister Work (A)” (2017) (image courtesy Anat Ebgi) Swivel Gallery owner Graham Wilson, who is participating for the first time, was excited that Armory reached out with an opportunity to showcase his roster of artists. Swivel will feature Alejandro García Contreras’s ceramics in the Presents section, which spotlights galleries under 10 years old, as well as an installation from multidisciplinary artist and filmmaker Simon Benjamin in the Platform section, this year curated by a nonprofit, the Georgia-based Souls Grown Deep Foundation.\n\n“The visibility of the fairs is 20 times more than an artist can get at a solo exhibition at a gallery,” Wilson said.\n\nThe draw of being able to meet new patrons so close to the city’s largest concentration of galleries remains a key appeal. Yancey Richardson, who is showing at Armory for the 16th year, appreciates that it’s only 12 blocks from her Chelsea gallery.\n\n“It’s nice to go and do a fair in another city or another country and develop a clientele there, but we also meet new clients here in New York,” she said. “Then those people will come often to visit the gallery during the year once they meet us.”\n\nAnat Ebgi opened a satellite location in Tribeca two years ago in part because of the success her Los Angeles-based gallery has had meeting clients at Armory, Moira Sims, the gallery’s New York director, told Hyperallergic .\n\n“A lot of clients come by on the first day and we see them at the gallery the second day, and then we see them back at the fair later in the week,” Sims said. “It feels like a prolonged engagement with clients at this fair in particular.”\n\nJennifer Carvalho, co-founder of Carvalho gallery in New York (photo courtesy the gallery) Sometimes, it’s too hard to choose. Jennifer Carvalho, who owns Carvalho gallery in Brooklyn, had participated in South Korean art fairs for several years, but never with Frieze Seoul, and had a good experience at the Armory last year. Next week, she’s planning to fly to Seoul to install a solo exhibition for London-based artist Yulia Iosilzon and attend previews before getting on a 6am flight back to New York. She lands at JFK Airport at 11am on Thursday — just in time for the Armory’s VIP opening.\n\n“I’ve invested in a flatbed seat and I’m just going to drink as much water as possible,” Carvalho said. “My team said they’ll have green tea waiting for me. I have an exceptional team.”\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Armory Week , Featured , New York , The Armory Show Aaron Short Aaron Short is a Brooklyn-based journalist covering politics, criminal justice, real estate, the environment, and the arts. His work has appeared in New York Magazine, the New York Post, The Daily Beast,... More by Aaron Short",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/armory.jpg?fit=2355%2C1864&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038050/new-york-art-dealers-get-candid-ahead-of-the-armory-show-2025/",
    "author": "Aaron Short"
  },
  {
    "slug": "facing-15m-budget-deficit-calarts-lays-off-workers",
    "title": "Facing $15M Budget Deficit, CalArts Lays Off Workers",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . A round of layoffs at the California Institute of the Arts (CalArts) this summer is raising alarms at one of the best-known arts schools in the country as the institution grapples with rising costs. The Santa Clarita-based private arts school laid off nine administrative employees in July, including five unionized workers and four non-union workers, claiming in a schoolwide message that CalArts needed to cut expenses in the face of a projected $15 million deficit . “The nine staff positions, as well as about a dozen vacant staff positions, are being eliminated as part of a necessary workforce reduction, which will enable CalArts to address a structural deficit, prioritize student-facing services, and better align our staffing with current and projected enrollments to continue providing exceptional educational opportunities to our students,” a CalArts spokesperson told Hyperallergic . But faculty and staff members are questioning the administration’s decision, arguing that the layoffs could harm the school’s ability to train and nurture the next generation of artists. Get the latest art news, reviews and opinions from Hyperallergic. “Everyone was disappointed in this having to happen at all when we’re working so hard to try to better serve the population,” Emily Lytle-Painter, a web and digital media producer at CalArts and union member, told Hyperallergic . “When we were trying to go into discussions with the administration, we felt like there were other avenues.” Tensions between CalArts employees and school leadership have been simmering since last fall, when dozens of faculty and staff decided to form a union after enduring what they described as years of stagnant wages, increased workloads, and minimal benefits. In December, CalArts faculty delivered a letter to President Ravi Rajan announcing their intention to organize with United Auto Workers in a unit that would represent approximately 600 workers. They held elections in March and ratified the union a month later. At the same time, the school had been struggling with enrollment, which declined by about 12 percent since the pandemic, from 1,532 students in 2019 to 1,353 students in 2023 (tuition surpassed $60,000 per year in 2025–26). In an April 2024 interview, Rajan told Inside Higher Education that CalArts was “ fiscally sound .” But the school proceeded with several budget…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nA round of layoffs at the California Institute of the Arts (CalArts) this summer is raising alarms at one of the best-known arts schools in the country as the institution grapples with rising costs.\n\nThe Santa Clarita-based private arts school laid off nine administrative employees in July, including five unionized workers and four non-union workers, claiming in a schoolwide message that CalArts needed to cut expenses in the face of a projected $15 million deficit .\n\n“The nine staff positions, as well as about a dozen vacant staff positions, are being eliminated as part of a necessary workforce reduction, which will enable CalArts to address a structural deficit, prioritize student-facing services, and better align our staffing with current and projected enrollments to continue providing exceptional educational opportunities to our students,” a CalArts spokesperson told Hyperallergic .\n\nBut faculty and staff members are questioning the administration’s decision, arguing that the layoffs could harm the school’s ability to train and nurture the next generation of artists.\n\nGet the latest art news, reviews and opinions from Hyperallergic.\n\n“Everyone was disappointed in this having to happen at all when we’re working so hard to try to better serve the population,” Emily Lytle-Painter, a web and digital media producer at CalArts and union member, told Hyperallergic . “When we were trying to go into discussions with the administration, we felt like there were other avenues.”\n\nTensions between CalArts employees and school leadership have been simmering since last fall, when dozens of faculty and staff decided to form a union after enduring what they described as years of stagnant wages, increased workloads, and minimal benefits. In December, CalArts faculty delivered a letter to President Ravi Rajan announcing their intention to organize with United Auto Workers in a unit that would represent approximately 600 workers. They held elections in March and ratified the union a month later.\n\nAt the same time, the school had been struggling with enrollment, which declined by about 12 percent since the pandemic, from 1,532 students in 2019 to 1,353 students in 2023 (tuition surpassed $60,000 per year in 2025–26).\n\nIn an April 2024 interview, Rajan told Inside Higher Education that CalArts was “ fiscally sound .” But the school proceeded with several budget cuts to reduce its operating costs, including tighter spending controls, hiring delays and travel limitations, and adjustments to admissions and financial aid packages. These measures, Rajan said in a schoolwide message, saved the school $5.5 million.\n\nThis spring, CalArts sought to reduce its headcount and sent voluntary separation and early retirement notices to between 50 and 60 faculty and staff, union leaders estimated. But only 32 employees, including 22 faculty and 10 staff, took the school’s offer and Rajan moved ahead with layoffs despite vociferous objections from the union.\n\n“I acknowledge how painful this news is,” Rajan wrote in a July 15 letter to faculty and staff reviewed by Hyperallergic . “These are not just abstract positions—they are roles held by our colleagues, teammates, and friends. I’m immensely grateful for their contributions and mindful of the weight of this moment for our community.”\n\nWhen the school announced layoffs, union leaders bargained with the administration for three months of severance, instead of two weeks of pay per year of service; three months of COBRA insurance; and priority rehiring in any vacant positions over the next two years for anyone who was laid off.\n\n“Everyone is understandably sad and worried, and there’s a general feeling of having to move forward with what we have,” Lytle-Painter said. “I personally was really proud of our bargaining team being able to bargain for increased benefits for those affected by the layoffs. That’s part of why we have a union.”\n\nThomas Leeb, an adjunct faculty member in the School of Music and union member, said he is approaching the next academic year that starts on September 8 with mixed emotions.\n\n“A lot of institutional knowledge has left with the voluntary separation program, and that’s sad and it hurts. At the same time, there’s a bit of optimism,” Leeb said, referencing the newly formed union. “Someone I spoke to who has been at CalArts for 25 years said this is the first time he felt protected.”\n\nEditor’s note 8/30/25 11am EST: A previous version of this article stated that 12 staffers were laid off. The story was updated to note that nine staffers were laid off and 12 vacant positions will not be filled. CalArts responded after publication.\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: CalArts , Labor Aaron Short Aaron Short is a Brooklyn-based journalist covering politics, criminal justice, real estate, the environment, and the arts. His work has appeared in New York Magazine, the New York Post, The Daily Beast,... More by Aaron Short",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/1620px-2012-1104-CalArts01.jpg?fit=1620%2C1080&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038229/facing-15m-budget-deficit-calarts-lays-off-workers/",
    "author": "Aaron Short"
  },
  {
    "slug": "the-2025-ny-art-book-fair-returns-to-moma-ps1",
    "title": "The 2025 NY Art Book Fair Returns to MoMA PS1",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Initiated in 2006, the NY Art Book Fair (NYABF) is a celebration and international gathering for artists’ book publishers to distribute their work, connect with broad audiences, and nurture new and longstanding relationships. This year’s fair marks an exciting and long-awaited return to MoMA PS1 , Printed Matter’s venue partner from 2009–2019, a pivotal decade in expanding the fair’s reach and impact, establishing NYABF as a cornerstone for the distribution of artists’ books and the preeminent gathering point for celebrating the form. This partnership also exemplifies a shared commitment to creating spaces where audiences can engage with new ideas and perspectives, while reaffirming Printed Matter’s core mission dedicated to the dissemination, understanding, and appreciation of artists’ books.\n\nNYABF 2025 takes place from Thursday, September 11, through Sunday, September 14, and will feature a wide range of interdisciplinary artistic practices, including self-publishing artists, collectives, small presses, institutions, rare and out-of-print book dealers, and art book distributors. With each fair, Printed Matter continues to foreground programs that address the present moment, while also working to increase awareness around artists’ books by providing various access points for visitors to engage with printed material in enriching and discursive ways.\n\nThis upcoming iteration of the fair includes special projects and installations by Boo-Hooray, Bread & Puppet Press, Corraini Edizioni, Hat & Beard Press, Special Special and 4N, Three Star Books, and an exhibition of archival material from The Detroit Printing Co-op. Two new screen-printed artist editions, “Untitled” (2025) by Huma Bhabha and “The 2nd Merlyn” (2025) by Richard Tuttle, will also be released during the fair.\n\nJoin Printed Matter on Thursday, September 11, from 7–10 PM for the Opening Night celebration, with music from Lydo, Sydney Spann, and voyeur. The first five hundred guests will also receive a limited ticket edition by Lyric Shen.\n\nTo learn more, visit pmabf.org .\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Event Announcement , New York Printed Matter, Inc. Printed Matter is the world's largest non-profit organization dedicated to publications by artists. More by Printed Matter, Inc.",
    "content": "Initiated in 2006, the NY Art Book Fair (NYABF) is a celebration and international gathering for artists’ book publishers to distribute their work, connect with broad audiences, and nurture new and longstanding relationships. This year’s fair marks an exciting and long-awaited return to MoMA PS1 , Printed Matter’s venue partner from 2009–2019, a pivotal decade in expanding the fair’s reach and impact, establishing NYABF as a cornerstone for the distribution of artists’ books and the preeminent gathering point for celebrating the form. This partnership also exemplifies a shared commitment to creating spaces where audiences can engage with new ideas and perspectives, while reaffirming Printed Matter’s core mission dedicated to the dissemination, understanding, and appreciation of artists’ books.\n\nNYABF 2025 takes place from Thursday, September 11, through Sunday, September 14, and will feature a wide range of interdisciplinary artistic practices, including self-publishing artists, collectives, small presses, institutions, rare and out-of-print book dealers, and art book distributors. With each fair, Printed Matter continues to foreground programs that address the present moment, while also working to increase awareness around artists’ books by providing various access points for visitors to engage with printed material in enriching and discursive ways.\n\nThis upcoming iteration of the fair includes special projects and installations by Boo-Hooray, Bread & Puppet Press, Corraini Edizioni, Hat & Beard Press, Special Special and 4N, Three Star Books, and an exhibition of archival material from The Detroit Printing Co-op. Two new screen-printed artist editions, “Untitled” (2025) by Huma Bhabha and “The 2nd Merlyn” (2025) by Richard Tuttle, will also be released during the fair.\n\nJoin Printed Matter on Thursday, September 11, from 7–10 PM for the Opening Night celebration, with music from Lydo, Sydney Spann, and voyeur. The first five hundred guests will also receive a limited ticket edition by Lyric Shen.\n\nTo learn more, visit pmabf.org .\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Event Announcement , New York Printed Matter, Inc. Printed Matter is the world's largest non-profit organization dedicated to publications by artists. More by Printed Matter, Inc.",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/megan-mack-185915-1-1-scaled.jpg?fit=2560%2C1707&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1037592/the-2025-ny-art-book-fair-returns-to-moma-ps1/",
    "author": "Printed Matter, Inc."
  },
  {
    "slug": "us-parks-agency-fires-ranger-who-displayed-trans-pride-flag-in-yosemit",
    "title": "US Parks Agency Fires Ranger Who Displayed Trans Pride Flag in Yosemite",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . As the Trump administration ramps up efforts to erase LGBTQ+ voices and communities of color from the historical narrative , Yosemite National Park has terminated the employment of a park ranger after they displayed a transgender pride flag on a landmark rock formation during their off-duty hours. Shannon “SJ” Joslin, a ranger and wildlife biologist who has been working at the park since 2021, said they were fired from their “dream job” on August 12 in an Instagram post . According to Joslin, Temporary Deputy Superintendent Ray McPadden of the National Park Service (NPS) told them that they had “[failed] to demonstrate acceptable conduct” after they hung the Trans Pride flag on the face of the granite monolith El Capitan. “The messages my termination send out to the public is that if you have an identity that has been turned into a ‘ideology’ not in line with the current administration, your rights will be different than other Americans that fall into the ‘ideal standard’ for who and what a person should be, look like, and believe in,” Joslin told Hyperallergic . An NPS spokesperson told Hyperallergic in a statement that the agency is “pursuing administrative action against multiple employees for failing to follow National Park Service regulations.” They declined to comment on the specifics of Joslin’s case. Get the latest art news, reviews and opinions from Hyperallergic. “We want to emphasize that we take the protection of the park’s resources and the experience of our visitors very seriously, and will not tolerate violations of laws and regulations that impact those resources and experiences,” the spokesperson said, alleging that “several unauthorized demonstrations involving El Capitan” last year had drawn complaints from visitors. SJ with the flag on the face of El Capitan in Yosemite (photo courtesy SJ Joslin) Joslin stated that they displayed the flag for about two hours on May 20 during their off-duty hours, and noted that Yosemite regulations did not ban the hanging of flags at the time. The following day, however, the NPS appears to have updated the park’s rules to prohibit the display of “any banner, flag, or sign larger than fifteen square feet” on any natural or cultural features without a permit, citing the need to…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nAs the Trump administration ramps up efforts to erase LGBTQ+ voices and communities of color from the historical narrative , Yosemite National Park has terminated the employment of a park ranger after they displayed a transgender pride flag on a landmark rock formation during their off-duty hours.\n\nShannon “SJ” Joslin, a ranger and wildlife biologist who has been working at the park since 2021, said they were fired from their “dream job” on August 12 in an Instagram post . According to Joslin, Temporary Deputy Superintendent Ray McPadden of the National Park Service (NPS) told them that they had “[failed] to demonstrate acceptable conduct” after they hung the Trans Pride flag on the face of the granite monolith El Capitan.\n\n“The messages my termination send out to the public is that if you have an identity that has been turned into a ‘ideology’ not in line with the current administration, your rights will be different than other Americans that fall into the ‘ideal standard’ for who and what a person should be, look like, and believe in,” Joslin told Hyperallergic .\n\nAn NPS spokesperson told Hyperallergic in a statement that the agency is “pursuing administrative action against multiple employees for failing to follow National Park Service regulations.” They declined to comment on the specifics of Joslin’s case.\n\nGet the latest art news, reviews and opinions from Hyperallergic.\n\n“We want to emphasize that we take the protection of the park’s resources and the experience of our visitors very seriously, and will not tolerate violations of laws and regulations that impact those resources and experiences,” the spokesperson said, alleging that “several unauthorized demonstrations involving El Capitan” last year had drawn complaints from visitors.\n\nSJ with the flag on the face of El Capitan in Yosemite (photo courtesy SJ Joslin) Joslin stated that they displayed the flag for about two hours on May 20 during their off-duty hours, and noted that Yosemite regulations did not ban the hanging of flags at the time. The following day, however, the NPS appears to have updated the park’s rules to prohibit the display of “any banner, flag, or sign larger than fifteen square feet” on any natural or cultural features without a permit, citing the need to “provide for an unimpaired visitor experience” and “protect natural and cultural resources.”\n\nWhile the new version of the compendium with the ban is dated May 20, the signature from the park’s acting superintendent, Raymond McPadden, is dated May 21, 2025. Previous versions of the compendium , accessed by Hyperallergic via the Wayback Machine, did not men tion flags or banners.\n\nHanging flags on the famous vertical wall of El Capitan is a tradition that many climbers have long participated in. In February, park employees flew an inverted United States flag over the side of the monolith’s cliff to protest the Trump administration’s cuts to the National Park Service. Last June, climbers hung a banner that read “Stop the Genocide” to decry the US-backed Israeli military’s assault on Palestine.\n\nThe NPS’s termination of Joslin’s employment comes amid the Trump administration’s ongoing attacks on LGBTQ+ rights and visibility. In February, the national parks agency expunged all references to trans and queer people from its website describing the 1969 Stonewall Rebellion. The erasure then extended to mentions of bisexual people in May.\n\n“In my celebration of identity and acceptance, I’ve been disparaged and deemed unacceptable,” Joslin told Hyperallergic. “It’s a tragic juxtaposition of how to treat human beings.”\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: LGBTQ , National Park Service Maya Pontone bluesky Maya Pontone (she/her) is a Staff News Writer at Hyperallergic. Originally from northern New Jersey, she currently resides in Brooklyn, where she covers daily news affecting the arts and culture, both... More by Maya Pontone",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/trans-flag-overtone-mitchell.jpg",
    "source": "https://hyperallergic.com/1036200/us-parks-agency-fires-ranger-who-displayed-trans-pride-flag-yosemite/",
    "author": "Maya Pontone"
  },
  {
    "slug": "new-york-area-shows-to-see-right-now",
    "title": "New York Area Shows to See Right Now",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . As the summer winds down and the season of art fairs and openings approaches, you might assume that the entire art world is on vacation right now. Don’t make the mistake of taking your own vacation from art just yet — there’s still plenty to see. For starters, visit CLAMP’s showcase of James Bidgood’s homoerotic photographs from the 1960s, a phantasmagoria of mythological cosplay closing this weekend. An exhibition of Beauford Delaney’s drawings at the Drawing Center is another must-see, as it focuses on the importance of this medium in the artist’s practice, and Sandra Poulson’s work, currently at MoMA PS1, is a fascinating take on the political life of domestic symbols and objects. Meanwhile, a quick trip to Greenwich, Connecticut, will lead you to the Bruce Museum, where Jeremy Frey’s stunning basketry awaits. And while you’re out and about in the city, make sure to check out American Art Catalogues’s small but potent show of paintings by Joe Brainard , up through this weekend. — Natalie Haddad, Reviews Editor CLAMP , 247 West 29th Street, Chelsea, Manhattan Through August 29 James Bidgood, “Bruce Kirkman Leaning on Willow Tree” (1965) (photo Daniel Larkin/ Hyperallergic ) Get the latest art news, reviews and opinions from Hyperallergic. “He portrayed young men with phantasmagorical aplomb, often as mythological figures, going against the grain of the beefcake sensibility dominant at the time.” — Daniel Larkin Bruce Museum , 1 Museum Drive, Greenwich, Connecticut Through September 7 Jeremy Frey, “Double-Walled Point Basket” (2018), ash, cedar bark, and dye (photo Julie Schneider/ Hyperallergic ) “In each impeccable vessel, ancestral Wabanaki basketmaking traditions crisscross with the Passamaquoddy artist’s distinctive creative vision.” — Julie Schneider The Drawing Center , 35 Wooster Street, Soho, Manhattan Through September 14 Beauford Delaney, “Self-Portrait” (1964), watercolor and gouache on paper (courtesy Ruth and Joe Fielden, Knoxville; photo Knoxville Museum of Art, © Estate of Beauford Delaney, by permission of Derek L. Spratley, Esquire, Court Appointed Administrator, Courtesy Michael Rosenfeld Gallery LLC, New York, NY) “For Delaney, being queer meant living and creating at the margins, where sexuality, race, and modernism intertwined in both visible and concealed ways.” — Alexandra M. Thomas MoMA PS1 , 22–25 Jackson Avenue, Long Island City, Queens Through October…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nAs the summer winds down and the season of art fairs and openings approaches, you might assume that the entire art world is on vacation right now. Don’t make the mistake of taking your own vacation from art just yet — there’s still plenty to see. For starters, visit CLAMP’s showcase of James Bidgood’s homoerotic photographs from the 1960s, a phantasmagoria of mythological cosplay closing this weekend. An exhibition of Beauford Delaney’s drawings at the Drawing Center is another must-see, as it focuses on the importance of this medium in the artist’s practice, and Sandra Poulson’s work, currently at MoMA PS1, is a fascinating take on the political life of domestic symbols and objects. Meanwhile, a quick trip to Greenwich, Connecticut, will lead you to the Bruce Museum, where Jeremy Frey’s stunning basketry awaits. And while you’re out and about in the city, make sure to check out American Art Catalogues’s small but potent show of paintings by Joe Brainard , up through this weekend. — Natalie Haddad, Reviews Editor\n\nCLAMP , 247 West 29th Street, Chelsea, Manhattan Through August 29\n\nJames Bidgood, “Bruce Kirkman Leaning on Willow Tree” (1965) (photo Daniel Larkin/ Hyperallergic ) Get the latest art news, reviews and opinions from Hyperallergic.\n\n“He portrayed young men with phantasmagorical aplomb, often as mythological figures, going against the grain of the beefcake sensibility dominant at the time.” — Daniel Larkin\n\nBruce Museum , 1 Museum Drive, Greenwich, Connecticut Through September 7\n\nJeremy Frey, “Double-Walled Point Basket” (2018), ash, cedar bark, and dye (photo Julie Schneider/ Hyperallergic ) “In each impeccable vessel, ancestral Wabanaki basketmaking traditions crisscross with the Passamaquoddy artist’s distinctive creative vision.” — Julie Schneider\n\nThe Drawing Center , 35 Wooster Street, Soho, Manhattan Through September 14\n\nBeauford Delaney, “Self-Portrait” (1964), watercolor and gouache on paper (courtesy Ruth and Joe Fielden, Knoxville; photo Knoxville Museum of Art, © Estate of Beauford Delaney, by permission of Derek L. Spratley, Esquire, Court Appointed Administrator, Courtesy Michael Rosenfeld Gallery LLC, New York, NY) “For Delaney, being queer meant living and creating at the margins, where sexuality, race, and modernism intertwined in both visible and concealed ways.” — Alexandra M. Thomas\n\nMoMA PS1 , 22–25 Jackson Avenue, Long Island City, Queens Through October 6\n\nSandra Poulson, “Candidato a Presidente da República de Angola” (2024), Oregon pine, found wooden bedframe, veneered plywood, chipboard, MDF, and steel (photo Lisa Yin Zhang/ Hyperallergic ) “Across these mostly household objects, Poulson emphasizes that history is something that haunts you as you sleep, as you dress, as you look at yourself in the mirror.” — Lisa Yin Zhang\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Featured , New York Lisa Yin Zhang Lisa Yin Zhang is Associate Editor at Hyperallergic, based in Queens, New York. More by Lisa Yin Zhang\n\nA man once knocked Daniel Larkin off his bar stool and flung mean words. He got up, smiled, and laughed as the bouncer showed him out. He doesn't give anyone the power to rain on his parade. It's more... More by Daniel Larkin\n\nWhen Julie Smith Schneider isn’t writing and editing, she’s carrying on her family’s pun tradition, making custom GIFs, or scheming in her cozy art studio. Keep up with her latest projects on Instagram. More by Julie Schneider\n\nAlexandra M. Thomas is an assistant professor of art history at Fordham University. She writes and teaches black and queer feminist art histories of Africa and the African diaspora. More by Alexandra M. Thomas",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/Bidgood_Pan-hires-copy.jpeg",
    "source": "https://hyperallergic.com/1035010/new-york-area-show-to-see-august-26-2025/",
    "author": "Lisa Yin Zhang, Daniel Larkin, Julie Schneider and Alexandra M. Thomas"
  },
  {
    "slug": "colorado-town-settles-with-native-artist-who-brought-free-speech-lawsu",
    "title": "Colorado Town Settles With Native Artist Who Brought Free Speech Lawsuit",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Húŋkpapȟa Lakȟóta painter Danielle SeeWalker has settled a civil rights lawsuit with the town of Vail, Colorado, more than a year after the municipality cancelled her artist residency over a pro-Palestine artwork. Brought by the American Civil Liberties Union (ACLU) of Colorado, the suit claimed that the town had violated the artist’s constitutional right to free speech. In last week’s settlement, Vail agreed to several concessions, including funding an art program “for underrepresented and economically disadvantaged people” and hosting a powwow led by SeeWalker every year for the next five years. “The intention is to allow other underrepresented artists, including Native American people, to have the opportunity of creating art in the town of Vail in place of my own missed opportunity,” SeeWalker said in a statement. The settlement also included Vail’s commitment to sponsor a “community forum” on Israel and Palestine that would include interfaith leaders and host an annual Indigenous-led cultural sensitivity training for employees of the municipality’s Arts and Public Places Department. Get the latest art news, reviews and opinions from Hyperallergic. A spokesperson for the town of Vail did not respond to Hyperallergic ‘s inquiries about when or how it would implement the terms of the settlement. The ACLU of Colorado has not yet responded to Hyperallergic ‘s inquiries. Danielle SeeWalker, “G is for Genocide” (2024) In 2024, SeeWalker was awarded Vail’s Art in Public Places (AIPP) artist residency, which had only been held once before, to create a public mural during the following summer. Months later, however, the town of Vail rescinded the opportunity after she posted an image of a pro-Palestine artwork on her Instagram that she said was unrelated to her public commission. In a public statement , the town said it removed SeeWalker from the project because it would “not use public funds to support any position on a polarizing geopolitical issue.” The painting “G for Genocide,” however, was created on SeeWalker’s own time and had not been submitted as her design for the public mural. She told Hyperallergic in an earlier interview that she created the work after observing common threads between Israel’s assault on Gaza and the history of Native Americans in the United States. The artwork was included in a…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nHúŋkpapȟa Lakȟóta painter Danielle SeeWalker has settled a civil rights lawsuit with the town of Vail, Colorado, more than a year after the municipality cancelled her artist residency over a pro-Palestine artwork. Brought by the American Civil Liberties Union (ACLU) of Colorado, the suit claimed that the town had violated the artist’s constitutional right to free speech.\n\nIn last week’s settlement, Vail agreed to several concessions, including funding an art program “for underrepresented and economically disadvantaged people” and hosting a powwow led by SeeWalker every year for the next five years.\n\n“The intention is to allow other underrepresented artists, including Native American people, to have the opportunity of creating art in the town of Vail in place of my own missed opportunity,” SeeWalker said in a statement.\n\nThe settlement also included Vail’s commitment to sponsor a “community forum” on Israel and Palestine that would include interfaith leaders and host an annual Indigenous-led cultural sensitivity training for employees of the municipality’s Arts and Public Places Department.\n\nGet the latest art news, reviews and opinions from Hyperallergic.\n\nA spokesperson for the town of Vail did not respond to Hyperallergic ‘s inquiries about when or how it would implement the terms of the settlement. The ACLU of Colorado has not yet responded to Hyperallergic ‘s inquiries.\n\nDanielle SeeWalker, “G is for Genocide” (2024) In 2024, SeeWalker was awarded Vail’s Art in Public Places (AIPP) artist residency, which had only been held once before, to create a public mural during the following summer. Months later, however, the town of Vail rescinded the opportunity after she posted an image of a pro-Palestine artwork on her Instagram that she said was unrelated to her public commission. In a public statement , the town said it removed SeeWalker from the project because it would “not use public funds to support any position on a polarizing geopolitical issue.”\n\nThe painting “G for Genocide,” however, was created on SeeWalker’s own time and had not been submitted as her design for the public mural. She told Hyperallergic in an earlier interview that she created the work after observing common threads between Israel’s assault on Gaza and the history of Native Americans in the United States. The artwork was included in a December 2024 collaboration between Hyperallergic and Jewish Currents that highlighted artists who had been silenced or censored over their support of Palestine.\n\nSeeWalker told Hyperallergic that settling with Vail was advantageous in that it allowed her to secure programming that other artists can benefit from, whereas a trial might only have yielded a financial result, if any. She said the settlement could have included additional terms she bargained for, but she intended to maximize community benefit over her own grievances.\n\n“Even if one other person is impacted in a good way, that is enough for me,” SeeWalker said. “My dad once told me, ‘Danielle, if you don’t speak up, no one will do it for you.’ I carry that with me everywhere I go.”\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Danielle SeeWalker , lawsuit Isa Farfan x Isa Farfan is a staff reporter for Hyperallergic. In May 2024, she graduated from Barnard College, where she studied Political Science and English and served as the Columbia Daily Spectator's Arts &... More by Isa Farfan",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/GisforGenocideinstudio.jpg",
    "source": "https://hyperallergic.com/1036790/colorado-town-settles-with-native-artist-danielle-seewalker-who-brought-free-speech-lawsuit/",
    "author": "Isa Farfan"
  },
  {
    "slug": "dust-storm-blows-away-ukrainian-artwork-at-burning-man",
    "title": "Dust Storm Blows Away Ukrainian Artwork at Burning Man",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Ferocious desert stormwinds have swept away a colossal Ukrainian artwork within hours of its installation at the annual Burning Man cultural festival in Nevada. A visual metaphor for the impending threat of war, the 50-foot-tall (~15.2-meter-tall) inflatable “Black Cloud” was destroyed shortly after debuting at the Black Rock Desert event yesterday, August 24, on Ukraine’s Independence Day. The work consisted of 45 interconnected blow-up forms with flashing strobes and a continuous soundscape created from real audio of warfare in Ukraine. General producer Vitaliy Deynega wrote on Facebook that although the installation was intended to withstand such weather conditions, it was torn apart in less than 15 minutes. The installation served as a visual metaphor of the threat of impending war. Get the latest art news, reviews and opinions from Hyperallergic. Fierce gusts of wind tore apart the inflatable installation within 15 minutes. “It was a feeling I experienced only once before — in February 2022, when I woke up to explosions and sirens,” Deynega said in a statement shared with Hyperallergic . The powerful dust storm, accompanied by 50 mph winds, has reportedly resulted in at least four minor injuries at Burning Man so far. It comes two years after torrential rainfall transformed the desert cultural festival into an enormous mud pit that stranded over 70,000 festival attendees in the temporary encampment. Hyperallergic has contacted Burning Man for comment. Despite the damage, the team behind “Black Cloud” has confirmed that the installation is slated to be rebuilt for a European tour. Dates and locations have not yet been announced. “Black Cloud” wasn’t the first Burning Man artwork to draw attention to the horrors of Russia’s war on Ukraine. At last year’s festival, Deynega and other Ukrainian artists unveiled “I’m Fine,” a more than 2,000-pound sculpture made of street signs from across the nation that were damaged by bullets and shrapnel. Since the start of Russia’s full-scale invasion more than three years ago, the United Nations Human Rights Monitoring Mission in Ukraine has documented 13,883 civilian deaths, including 726 children. Donald Trump’s recent meetings with Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky have yet to yield a ceasefire or peace deal. “Perhaps this storm has taken the threat with it,”…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nFerocious desert stormwinds have swept away a colossal Ukrainian artwork within hours of its installation at the annual Burning Man cultural festival in Nevada.\n\nA visual metaphor for the impending threat of war, the 50-foot-tall (~15.2-meter-tall) inflatable “Black Cloud” was destroyed shortly after debuting at the Black Rock Desert event yesterday, August 24, on Ukraine’s Independence Day. The work consisted of 45 interconnected blow-up forms with flashing strobes and a continuous soundscape created from real audio of warfare in Ukraine.\n\nGeneral producer Vitaliy Deynega wrote on Facebook that although the installation was intended to withstand such weather conditions, it was torn apart in less than 15 minutes.\n\nThe installation served as a visual metaphor of the threat of impending war. Get the latest art news, reviews and opinions from Hyperallergic.\n\nFierce gusts of wind tore apart the inflatable installation within 15 minutes. “It was a feeling I experienced only once before — in February 2022, when I woke up to explosions and sirens,” Deynega said in a statement shared with Hyperallergic .\n\nThe powerful dust storm, accompanied by 50 mph winds, has reportedly resulted in at least four minor injuries at Burning Man so far. It comes two years after torrential rainfall transformed the desert cultural festival into an enormous mud pit that stranded over 70,000 festival attendees in the temporary encampment. Hyperallergic has contacted Burning Man for comment.\n\nDespite the damage, the team behind “Black Cloud” has confirmed that the installation is slated to be rebuilt for a European tour. Dates and locations have not yet been announced.\n\n“Black Cloud” wasn’t the first Burning Man artwork to draw attention to the horrors of Russia’s war on Ukraine. At last year’s festival, Deynega and other Ukrainian artists unveiled “I’m Fine,” a more than 2,000-pound sculpture made of street signs from across the nation that were damaged by bullets and shrapnel.\n\nSince the start of Russia’s full-scale invasion more than three years ago, the United Nations Human Rights Monitoring Mission in Ukraine has documented 13,883 civilian deaths, including 726 children. Donald Trump’s recent meetings with Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky have yet to yield a ceasefire or peace deal.\n\n“Perhaps this storm has taken the threat with it,” said the “Black Cloud” building team in a statement. “A quiet hope on Ukraine’s Independence Day … drifting away on the desert winds.”\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Burning Man Maya Pontone bluesky Maya Pontone (she/her) is a Staff News Writer at Hyperallergic. Originally from northern New Jersey, she currently resides in Brooklyn, where she covers daily news affecting the arts and culture, both... More by Maya Pontone",
    "cover": "https://hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/black-clopud-far-away.jpg",
    "source": "https://hyperallergic.com/1036943/dust-storm-blows-away-ukrainian-artwork-at-burning-man/",
    "author": "Maya Pontone"
  },
  {
    "slug": "we-are-all-picasso-s-fishermen",
    "title": "We Are All Picasso’s Fishermen",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Pablo Picasso’s “Night Fishing at Antibes” (1939) at the Museum of Modern Art in New York (all photos Hakim Bishara/ Hyperallergic ) A quick perusal of the headlines these days is enough for one to conclude that dictators don’t die but multiply, and that history doesn’t repeat itself — it vomits in its own mouth. The year is 1939. It’s a balmy August night, lit by a big, yellow moon. Two fishermen in a boat are earning their keep out there off the shore of Antibes in southern France. One of them aims at a large, curmudgeonly fish with a pitchfork, the other tries his luck with a fishing line. A cautious crab keeps a safe distance. Gas lamps reflect on the water’s surface and flicker into the air. A girl on a bike observes the whole scene from a high dock while licking an ice cream. She’s there with a friend, it seems. Luxurious Monaco is less than an hour away by car. Beachy Nice is even closer. Everything looks fine and lovely. But beneath these calm waters swirl malignant tides that portend the onset of a Second, much deadlier World War just a few weeks away. Get the latest art news, reviews and opinions from Hyperallergic. This scene in Pablo Picasso’s “Night Fishing at Antibes” stopped me in my tracks during a visit to the Museum of Modern Art (MoMA) on a hot Saturday afternoon in New York City. Currently hung on a wall at a busy intersection connecting two escalators on the museum’s fifth floor, it’s nearly impossible to have a private moment with this Cubist masterpiece, much less heed its alarm that we’re never really too far away from a third, infinitely more horrific World War, probably powered by AI. The painting is currently hung on a wall at a busy intersection on MoMA’s fifth floor. This sprawling piece (6.75 by 11.3 feet, or two by 3.5 meters) was acquired for MoMA in 1952 by Olga Hirsh Guggenheim, wife of industrialist-philanthropist Simon Guggenheim, brother of Solomon R. Guggenheim, who started his own eponymous museum on Manhattan’s Fifth Avenue. The Guggenheims made their fortune from building a global mining and smelting empire, which reached its peak during the…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nPablo Picasso’s “Night Fishing at Antibes” (1939) at the Museum of Modern Art in New York (all photos Hakim Bishara/ Hyperallergic ) A quick perusal of the headlines these days is enough for one to conclude that dictators don’t die but multiply, and that history doesn’t repeat itself — it vomits in its own mouth.\n\nThe year is 1939. It’s a balmy August night, lit by a big, yellow moon. Two fishermen in a boat are earning their keep out there off the shore of Antibes in southern France. One of them aims at a large, curmudgeonly fish with a pitchfork, the other tries his luck with a fishing line. A cautious crab keeps a safe distance. Gas lamps reflect on the water’s surface and flicker into the air. A girl on a bike observes the whole scene from a high dock while licking an ice cream. She’s there with a friend, it seems.\n\nLuxurious Monaco is less than an hour away by car. Beachy Nice is even closer. Everything looks fine and lovely. But beneath these calm waters swirl malignant tides that portend the onset of a Second, much deadlier World War just a few weeks away.\n\nGet the latest art news, reviews and opinions from Hyperallergic.\n\nThis scene in Pablo Picasso’s “Night Fishing at Antibes” stopped me in my tracks during a visit to the Museum of Modern Art (MoMA) on a hot Saturday afternoon in New York City.\n\nCurrently hung on a wall at a busy intersection connecting two escalators on the museum’s fifth floor, it’s nearly impossible to have a private moment with this Cubist masterpiece, much less heed its alarm that we’re never really too far away from a third, infinitely more horrific World War, probably powered by AI.\n\nThe painting is currently hung on a wall at a busy intersection on MoMA’s fifth floor. This sprawling piece (6.75 by 11.3 feet, or two by 3.5 meters) was acquired for MoMA in 1952 by Olga Hirsh Guggenheim, wife of industrialist-philanthropist Simon Guggenheim, brother of Solomon R. Guggenheim, who started his own eponymous museum on Manhattan’s Fifth Avenue. The Guggenheims made their fortune from building a global mining and smelting empire, which reached its peak during the First World War. They, among others, have been accused of war profiteering by gouging the price of copper, which was essential for the arms industry. Many in the family have abandoned the mining industry since then. Now we recognize them more as great patrons of the arts, just as we do many contemporary MoMA donors and board members accused of extractivism and profiting off the military-industrial complex .\n\nAnd isn’t it an interesting coincidence that 1939, the year Picasso made “Night Fishing at Antibes,” is also the year he loaned “Guernica” (1937), his most famous anti-war painting, to MoMA for safekeeping after the outbreak of the war in Europe? Such is history, a turning wheel of irony. The people collecting and safeguarding the anti-war art are often the same ones selling the bombs.\n\nThe people collecting and safeguarding the anti-war art are often the same ones selling the bombs. PING ! As I stood blocking escalator traffic while contemplating these entanglements, a notification on my phone screen announced that the United States, 80 years after the atomic end of World War II, had positioned nuclear submarines close to Russia .\n\nOutside the museum, an August sun flagellated the asphalt roads, concrete pavements, and skyscrapers of Midtown Manhattan. It was a vengeful, punishing sun. A jingoistic sun that wants you to go the hell back to where you came from. Nevertheless, the streets teemed with people shopping, sightseeing, and licking ice cream — just going about their normal business. Every one of them looked like a Picasso fisherman to me.\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: Featured , MoMA , Pablo Picasso , World War II Hakim Bishara instagram linkedin Hakim Bishara is Hyperallergic's managing editor. He is a recipient of the 2019 Andy Warhol Foundation and Creative Capital Arts Writers Grant and he holds an MFA in Art Writing from the School of Visual... More by Hakim Bishara",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/image00003-scaled.jpeg?fit=2560%2C1375&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1035989/we-are-all-picasso-fishermen/",
    "author": "Hakim Bishara"
  },
  {
    "slug": "the-black-feminist-subconscious-of-ufuoma-essi-s-films",
    "title": "The Black Feminist Subconscious of Ufuoma Essi’s Films",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . At first glance, the two Super 8 films that comprise Ufuoma Essi’s exhibition at the Museum of Modern Art (MoMA) seem to compete for attention. “Bodies In Dissent” (2021) juxtaposes the artist’s footage of a performer with archival film of a 1960s jazz concert and a dancer in a succinct six minutes. On the opposite side of the gallery, “Half Memory” (2024) coalesces three years of filming in the United Kingdom, United States, and France into an allusive, nonlinear 27 minutes. Soon, though, the two works come to complement each other, their dreamlike atmospheres opening onto shared themes of history and memory threaded through with the voices of Black artists and intellectuals. In “Bodies In Dissent,” Essi’s scenes of artist Nambi Kiyira performing in a grassy green field are interspersed with black and white video of then-married jazz drummer Max Roach and singer Abbey Lincoln during a 1964 concert, and archival clips of dancer Loretta Abbott. Kiyira, wearing a long black dress, is seen alternately from afar and up close, backed by audio from the concert. “Half Memory” takes Toni Morrison’s essay “The Site of Memory” (1986) and her concept of “rememory” — repressed memories returning via a living force — as a jumping-off point for an exploration of individual and collective memory and history. In it, grainy imagery of public places like cities and beaches — suggesting both anonymous found footage and surveillance videos — is layered with the words of Morrison and other Black feminist scholars. Still of Ufuoma Essi, “Half Memory” (2024), scanned Super 8mm film (color), 27 min. (photo Natalie Haddad/ Hyperallergic ) Get the latest art news, reviews and opinions from Hyperallergic. Most online descriptions of Essi’s work, including her own artist statement, put forth a didactic portrait of the films (her website states that her art “revolves around Black feminist epistemology and the configuration of displaced histories”). These themes inhere in the references and connections she brings to light, but the films themselves are far more abstract and intuitive than academic and dry. The meditative pace and washed-out color palette of “Half Memory” reflect the ways that memories cohere, dissipate, and reemerge, while the pastoral setting of “Bodies In Dissent,” framing the performer’s elegant movements…",
    "content": "Sign in with Google Or Sign up Sign in to an existing account Privacy Policy\n\nSuccess! Your account was created and you’re signed in. Please visit My Account to verify and manage your account.\n\nAn account was already registered with this email. Please check your inbox for an authentication link.\n\nWe rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member .\n\nAt first glance, the two Super 8 films that comprise Ufuoma Essi’s exhibition at the Museum of Modern Art (MoMA) seem to compete for attention. “Bodies In Dissent” (2021) juxtaposes the artist’s footage of a performer with archival film of a 1960s jazz concert and a dancer in a succinct six minutes. On the opposite side of the gallery, “Half Memory” (2024) coalesces three years of filming in the United Kingdom, United States, and France into an allusive, nonlinear 27 minutes. Soon, though, the two works come to complement each other, their dreamlike atmospheres opening onto shared themes of history and memory threaded through with the voices of Black artists and intellectuals.\n\nIn “Bodies In Dissent,” Essi’s scenes of artist Nambi Kiyira performing in a grassy green field are interspersed with black and white video of then-married jazz drummer Max Roach and singer Abbey Lincoln during a 1964 concert, and archival clips of dancer Loretta Abbott. Kiyira, wearing a long black dress, is seen alternately from afar and up close, backed by audio from the concert.\n\n“Half Memory” takes Toni Morrison’s essay “The Site of Memory” (1986) and her concept of “rememory” — repressed memories returning via a living force — as a jumping-off point for an exploration of individual and collective memory and history. In it, grainy imagery of public places like cities and beaches — suggesting both anonymous found footage and surveillance videos — is layered with the words of Morrison and other Black feminist scholars.\n\nStill of Ufuoma Essi, “Half Memory” (2024), scanned Super 8mm film (color), 27 min. (photo Natalie Haddad/ Hyperallergic ) Get the latest art news, reviews and opinions from Hyperallergic.\n\nMost online descriptions of Essi’s work, including her own artist statement, put forth a didactic portrait of the films (her website states that her art “revolves around Black feminist epistemology and the configuration of displaced histories”). These themes inhere in the references and connections she brings to light, but the films themselves are far more abstract and intuitive than academic and dry. The meditative pace and washed-out color palette of “Half Memory” reflect the ways that memories cohere, dissipate, and reemerge, while the pastoral setting of “Bodies In Dissent,” framing the performer’s elegant movements and form, renders the work lush and painterly.\n\nThe show’s location, in one of MoMA’s free ground-floor galleries, is a boon for art lovers who don’t have $30 to spend on a museum visit. Essi’s focus on music and landscape calls to mind some film works by Cauleen Smith (for instance, her 2017 ode to Alice Coltrane, “Pilgrim”). Smith’s more cinematic vision strikes a balance between abstraction and narrative that Essi’s works don’t quite achieve — and maybe weren’t meant to. But the artists are separated by a generation or more (Essi was born in 1995, three years before Smith released her feature film, Drylongso ), and Essi’s aesthetic is still evolving.\n\nSome contextualizing materials, such as archival texts or background on Roach and Lincoln’s activism through music, might have brought the show to another level. However, Essi’s great skill in these pieces lies in articulating her conceptual concerns through aesthetic and sensory means. “Half Memory” evokes the workings of memory and its relationship with official and repressed histories through its fluid montage, while “Bodies In Dissent” interweaves the past and present of Black arts and activism through music and the body. The effect is subtle, but it lingers.\n\nStill of Ufuoma Essi, “Bodies in Dissent” (2021) (photo Natalie Haddad/ Hyperallergic ) Still of Ufuoma Essi, “Half Memory” (2024) (photo Natalie Haddad/ Hyperallergic ) Still of Ufuoma Essi, “Bodies in Dissent” (2021) (photo Natalie Haddad/ Hyperallergic ) Installation view of Projects: Ufuoma Essi at The Museum of Modern Art, New York (photo Jonathan Dorado) Ufuoma Essi continues at the Museum of Modern Art (11 West 53rd Street, Midtown, Manhattan) through October 13. The exhibition was organized by Gee Wesley.\n\nPlease consider supporting Hyperallergic ’s journalism during a time when independent, critical reporting is increasingly scarce.\n\nWe are not beholden to large corporations or billionaires. Our journalism is funded by readers like you , ensuring integrity and independence in our coverage. We strive to offer trustworthy perspectives on everything from art history to contemporary art. We spotlight artist-led social movements, uncover overlooked stories, and challenge established norms to make art more inclusive and accessible. With your support, we can continue to provide global coverage without the elitism often found in art journalism.\n\nIf you can, please join us as a member today . Millions rely on Hyperallergic for free, reliable information. By becoming a member, you help keep our journalism independent and accessible to all. Thank you for reading.\n\nShare Copied to clipboard Click to share on Mail (Opens in new window) Mail Click to share on Bluesky (Opens in new window) Bluesky Tagged: MoMA , New York Natalie Haddad Natalie Haddad is Reviews Editor at Hyperallergic and an art writer and historian. Natalie holds a PhD in Art History, Theory and Criticism from the University of California San Diego and focuses on World... More by Natalie Haddad",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/2021_Bodies-In-Dissent_Still-1.jpg?fit=2000%2C1451&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1035118/the-black-feminist-subconscious-of-ufuoma-essi-films/",
    "author": "Natalie Haddad"
  }
]