[
  {
    "slug": "the-artist-whose-fauci-portraits-enraged-the-white-house",
    "title": "The Artist Whose Fauci Portraits Enraged the White House",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Artist Whose Fauci Portraits Enraged the White House Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/whitehousefauci.jpeg?fit=2140%2C1610&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038060/hugo-crosthwaite-artist-whose-fauci-portraits-enraged-the-white-house/",
    "author": "AventurOO Editorial",
    "body": "<p>The Artist Whose Fauci Portraits Enraged the White House Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Features Trump Administration The Artist Whose Fauci Portraits Enraged the White House Hugo Crosthwaite, whose stop-motion animation about the scientist was targeted by the Trump administration, talks to Hyperallergic about the work’s backstory. by Isa Farfan 21 hours ago August 29, 2025 A still from Hugo Crosthwaite's commissioned portrait of Dr. Anthony Fauci (all images courtesy Hugo Crosthwaite) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . In 2019, Hugo Crosthwaite became the first Latino artist to win the Smithsonian National Portrait Gallery’s (NPG) prestigious triennial Outwin Boochever Portrait Competition. The Tijuana-born and San Diego-based illustrator received the contest’s grand prize: $25,000 and a portrait commission for the museum’s permanent collection. He chose to depict Anthony Fauci, then the director of the National Institute of Allergy and Infectious Diseases (NIAID), in a stop-motion format that captures the nuances of his complicated legacy, including his criticized and then celebrated oversight of the HIV/AIDs epidemic. Last week, Crosthwaite found his hard-won commission on a list of Smithsonian items that the White House found objectionable. He was one of at least three Mexican-born artists whose work was included on Trump’s art hit list , along with illustrator Rigoberto González and painter Felipe Galindo Gómez . “My first reaction was surprise,” Crosthwaite shared in an interview with Hyperallergic. “But then later on, [I] felt a bit of pride to be included in this list of other wonderful artists and wonderful projects that talk about the diversity of the United States’ history.” Hugo Crosthwaite was born in Tijuana and now lives in San Diego. In 2022, after winning the Outwin…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1038060/hugo-crosthwaite-artist-whose-fauci-portraits-enraged-the-white-house/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article at Smithsonian Magazine</a>\n</p>\n"
  },
  {
    "slug": "the-shocking-allure-of-erotic-abstraction",
    "title": "The Shocking Allure of Erotic Abstraction",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The Shocking Allure of Erotic Abstraction Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account M…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/eed0c-scaled.jpeg?fit=2560%2C2113&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1035805/the-shocking-allure-of-erotic-abstraction-courtauld-gallery/",
    "author": "AventurOO Editorial",
    "body": "<p>The Shocking Allure of Erotic Abstraction Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Art Review The Shocking Allure of Erotic Abstraction A show on Louise Bourgeois, Eva Hesse, and Alice Adams gives a sense of how different, even alarming, these pieces would have been to viewers in the 1960s. by Olivia McEwan 21 hours ago August 29, 2025 Alice Adams, \"Sheath\" (1964) (© Howcroft Photography, Boston; photo courtesy the Courtauld, all other photos Olivia McEwan/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . LONDON — Some of the Courtauld’s previous exhibitions have suffered from insufficient curation . Abstract Erotic: Louise Bourgeois, Alice Adams, Eva Hesse , on the other hand, strikes the exact right balance. Drawing on scholar Jo Applin’s research, curator Alexandra Gerstein has taken as a starting point the work of feminist curator and critic Lucy Lippard, who coined the titular term to describe this sensuous s trand of art emerging in 1960s New York. Making perhaps the best use yet of the Courtauld’s teeny exhibition spaces next to the permanent collection, this small but unstuffed show gives proper breathing space for artistic dialogue and, crucially, for the viewer to engage in exploring differences and similarities between works and practices for themselves. In 1966, Lippard curated the exhibition Eccentric Abstraction to capture a new wave of sculptures created from unusual, pliable materials like wire, plastic mesh, netting, and latex, which evoked tactile organic forms and, by extension, the human body. This is the Courtauld’s first show devoted to standalone sculpture, and the contrast between these blob-like forms and its Impressionist-heavy permanent collection may go some way to recreate just how different — even alarming — these…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1035805/the-shocking-allure-of-erotic-abstraction-courtauld-gallery/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article at Smithsonian Magazine</a>\n</p>\n"
  },
  {
    "slug": "reclaiming-a-whitewashed-history-of-the-great-depression",
    "title": "Reclaiming a Whitewashed History of the Great Depression",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Reclaiming a Whitewashed History of the Great Depression Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/dzNBe-scaled.jpeg?fit=2560%2C1843&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038134/reclaiming-a-whitewashed-history-of-the-great-depression-museum-art-light-kansas/",
    "author": "AventurOO Editorial",
    "body": "<p>Reclaiming a Whitewashed History of the Great Depression Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Features Previews Reclaiming a Whitewashed History of the Great Depression A new exhibition focuses on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, and Ben Shahn. by Monica Uszerowicz 21 hours ago August 29, 2025 Russell Lee, \"Son of sharecropper in window of old home, Southeast Missouri Farms\" (1938/ 2024) (all photos courtesy Art Bridges) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . When the United States Department of Agriculture established the Farm Security Administration (FSA) in 1937, hoping to provide aid to rural communities affected by the Great Depression, it also implemented a photography project headed by government official Roy Stryker. The photographs were meant to generate support for the agency, allowing the public to witness the impacts of the Depression for themselves. Made by recruited photographers and then selected by Stryker for inclusion in traveling exhibitions and news outlets, the chosen images overwhelmingly depicted White families — a narrow and literally whitewashed view of rural America. Crafting Sanctuaries: Black Spaces of the Black Great Depression South , a new exhibition at the Museum of Art and Light in Manhattan, Kansas, showcases a broader view of FSA imagery, focusing on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, Russell Lee, Marion Post Wolcott, Arthur Rothstein, Ben Shahn, and Jack Delano across six states: Alabama, Georgia, Louisiana, Florida, Mississippi, and Missouri. Presented in partnership with Art Bridges Foundation, the photos highlight the intimacy of life among one’s community — private quarters, public gathering spaces — and the care taken to build one together. The exhibition, curator Tamir Williams told Hyperallergic ,…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1038134/reclaiming-a-whitewashed-history-of-the-great-depression-museum-art-light-kansas/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article at Smithsonian Magazine</a>\n</p>\n"
  },
  {
    "slug": "art-dealers-get-candid-ahead-of-the-armory-show",
    "title": "Art Dealers Get Candid Ahead of the Armory Show",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Art Dealers Get Candid Ahead of the Armory Show Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My acc…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/armory.jpg?fit=2355%2C1864&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038050/new-york-art-dealers-get-candid-ahead-of-the-armory-show-2025/",
    "author": "AventurOO Editorial",
    "body": "<p>Art Dealers Get Candid Ahead of the Armory Show Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Art Dealers Get Candid Ahead of the Armory Show Amid market unease and slimmer blue-chip participation, some galleries see an opportunity to cultivate collectors at the mammoth Manhattan fair. by Aaron Short 8 hours ago August 29, 2025 Visitors navigate the labyrinthine booths of the 2024 Armory Show (photo Valentina Di Liscia/ Hyperallergic ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . Joe Amrhein and Susan Swenson were going to sit out the Armory Show this fall for the first time in a quarter century until they got a call last month from the fair’s director. The owners of Pierogi Gallery in Brooklyn’s Williamsburg neighborhood initially did not apply this year due to the show’s rising booth costs, which can exceed tens of thousands of dollars. Pierogi is planning the next phase of its business, which could include relocating to Lower Manhattan . But Armory executives Kyla McMillan and J. Tyler Woodall appealed to Pierogi and the fair’s shared history — in 2016, Amrhein suggested the Armory use an empty space to display Jonathan Schipper’s installation of a Volkswagen Golf crashing into a wall; the presentation of large-scale art has since become a cornerstone of the show. They recently negotiated a smaller exhibition space for Pierogi with a lower rate, enabling the gallery to return. “We had been on the fence about it since the economy is very uncertain and it’s a big investment,” Swenson said. “We’re not one of the big box galleries. Some of them have their own economies now.” Get the latest art news, reviews and opinions from Hyperallergic. Daily…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1038050/new-york-art-dealers-get-candid-ahead-of-the-armory-show-2025/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article at Smithsonian Magazine</a>\n</p>\n"
  },
  {
    "slug": "facing-15m-budget-deficit-calarts-lays-off-workers",
    "title": "Facing $15M Budget Deficit, CalArts Lays Off Workers",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "Facing $15M Budget Deficit, CalArts Lays Off Workers Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ M…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/1620px-2012-1104-CalArts01.jpg?fit=1620%2C1080&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1038229/facing-15m-budget-deficit-calarts-lays-off-workers/",
    "author": "AventurOO Editorial",
    "body": "<p>Facing $15M Budget Deficit, CalArts Lays Off Workers Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in News Facing $15M Budget Deficit, CalArts Lays Off Workers Faculty and union members are questioning the staff cuts, arguing that they will harm the school’s ability to nurture the next generation of artists. by Aaron Short August 29, 2025 August 30, 2025 California Institute of the Arts (photo by Bobak Ha'Eri, via Wikimedia Commons, CC BY 3.0 ) Subscribe to our newsletter Daily The latest stories every weekday Weekly Editors' picks and top stories Opportunities Monthly list for artists and art workers Sign in with Google Or Sign up Sign in to an existing account Privacy Policy Success! Your account was created and you’re signed in. Please visit My Account to verify and manage your account. An account was already registered with this email. Please check your inbox for an authentication link. We rely on readers like you to fund our journalism. If you value our coverage and want to support more of it, please join us as a member . A round of layoffs at the California Institute of the Arts (CalArts) this summer is raising alarms at one of the best-known arts schools in the country as the institution grapples with rising costs. The Santa Clarita-based private arts school laid off nine administrative employees in July, including five unionized workers and four non-union workers, claiming in a schoolwide message that CalArts needed to cut expenses in the face of a projected $15 million deficit . “The nine staff positions, as well as about a dozen vacant staff positions, are being eliminated as part of a necessary workforce reduction, which will enable CalArts to address a structural deficit, prioritize student-facing services, and better align our staffing with current and projected enrollments to continue providing exceptional educational opportunities to our students,” a CalArts spokesperson told Hyperallergic . But faculty and staff members are questioning the administration’s decision, arguing that the layoffs could harm the school’s ability to train and nurture the next generation of artists. Get the latest art news, reviews and opinions from Hyperallergic. Daily Weekly Opportunities Sign up “Everyone was disappointed in this having to happen at all when we’re working so hard to try to better serve…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1038229/facing-15m-budget-deficit-calarts-lays-off-workers/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article at Smithsonian Magazine</a>\n</p>\n"
  },
  {
    "slug": "the-2025-ny-art-book-fair-returns-to-moma-ps1",
    "title": "The 2025 NY Art Book Fair Returns to MoMA PS1",
    "category": "Culture",
    "date": "2025-09-01",
    "excerpt": "The 2025 NY Art Book Fair Returns to MoMA PS1 Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My accou…",
    "cover": "https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2025/08/megan-mack-185915-1-1-scaled.jpg?fit=2560%2C1707&quality=90&ssl=1",
    "source": "https://hyperallergic.com/1037592/the-2025-ny-art-book-fair-returns-to-moma-ps1/",
    "author": "AventurOO Editorial",
    "body": "<p>The 2025 NY Art Book Fair Returns to MoMA PS1 Close Sign In Search for: Search Facebook Instagram LinkedIn News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Close News Features Reviews Opinion Guides Community Opportunities Announcements Books Film Podcast Crosswords Interviews Comics Bluesky YouTube Instagram LinkedIn ~~~ My account Membership Donate About Us Skip to content Hyperallergic Sensitive to Art & its Discontents Sign In Open Search Search for: Search Menu Sign In Posted in Announcement The 2025 NY Art Book Fair Returns to MoMA PS1 This year’s fair features over 250 local and international artists’ book publishers, alongside a full weekend of programs and performances from September 11 through 14. by Printed Matter, Inc. August 29, 2025 August 28, 2025 2019 NY Art Book Fair (photo Megan Mack) Initiated in 2006, the NY Art Book Fair (NYABF) is a celebration and international gathering for artists’ book publishers to distribute their work, connect with broad audiences, and nurture new and longstanding relationships. This year’s fair marks an exciting and long-awaited return to MoMA PS1 , Printed Matter’s venue partner from 2009–2019, a pivotal decade in expanding the fair’s reach and impact, establishing NYABF as a cornerstone for the distribution of artists’ books and the preeminent gathering point for celebrating the form. This partnership also exemplifies a shared commitment to creating spaces where audiences can engage with new ideas and perspectives, while reaffirming Printed Matter’s core mission dedicated to the dissemination, understanding, and appreciation of artists’ books. NYABF 2025 takes place from Thursday, September 11, through Sunday, September 14, and will feature a wide range of interdisciplinary artistic practices, including self-publishing artists, collectives, small presses, institutions, rare and out-of-print book dealers, and art book distributors. With each fair, Printed Matter continues to foreground programs that address the present moment, while also working to increase awareness around artists’ books by providing various access points for visitors to engage with printed material in enriching and discursive ways. This upcoming iteration of the fair includes special projects and installations by Boo-Hooray, Bread & Puppet Press, Corraini Edizioni, Hat & Beard Press, Special Special and 4N, Three Star Books, and an exhibition of archival material from The Detroit Printing Co-op. Two new screen-printed artist editions, “Untitled” (2025) by Huma Bhabha and “The 2nd Merlyn” (2025) by Richard Tuttle, will also be released during the fair. Join Printed Matter on Thursday, September 11, from 7–10 PM for the Opening Night celebration, with music from Lydo, Sydney Spann, and voyeur. The first five hundred guests will also receive a limited ticket edition by Lyric Shen. To learn more, visit pmabf.org…</p>\n<p class=\"small text-muted mt-4\">\n  Source: <a href=\"https://hyperallergic.com/1037592/the-2025-ny-art-book-fair-returns-to-moma-ps1/\" target=\"_blank\" rel=\"nofollow noopener\">Read the full article at Smithsonian Magazine</a>\n</p>\n"
  }
]