[
  {
    "slug": "these-5-u-s-scenic-train-rides-offer-the-best-fall-views-this-year",
    "title": "These 5 U.S. Scenic Train Rides Offer The Best Fall Views This Year",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "With the close of summer, it means that fall is starting to make its way into the minds of most of us. To many people across the U.S., fall means cozy nights, apple cider, warm sweaters, and, of course, the fall foliage craze that begins to take over the country. Foliage fever is real, and while road trips and national park hikes are great, why not experience America’s beautiful autumn views by rail this year? Here at Travel Off Path, we’ve seen that train travel is having a major moment. It’s a chance to sit back, relax, and soak in the stunning views without the stress of driving. Based on the scenic railways travelers were raving about last year, here are 5 U.S. train rides that offer some of the best fall views for 2025. 🚂 Conway Scenic Railroad, New Hampshire The Angle: Classic New England Beauty If you want the quintessential New England fall experience, this is it. While there are many foliage trains in the region, travelers in 2024 consistently gushed that the Mountaineer route on the Conway Scenic Railroad is one of the most spectacular rail journeys in the country. Winding through the heart of the White Mountains and the dramatic Crawford Notch, this trip offers cliffside views, historic trestles, and a sea of vibrant red and orange maple trees. - The Experience: This is a longer, more immersive trip, offering a dining car and a true feeling of golden-era train travel. - Best Time To Go: The first two weeks of October are typically peak season for this part of New Hampshire. 🏞️ Cuyahoga Valley Scenic Railroad, Ohio The Angle: A National Park by Rail There’s a reason this Ohio favorite remains on the list: it’s one of the only scenic railways that runs directly through a U.S. National Park. The Cuyahoga Valley Scenic Railroad gives you a front-row seat to the deep forests and rolling hills of the park as they explode into fiery shades of red, orange, and purple. It’s an incredibly accessible way to experience a national park’s fall beauty. - The Experience: Look for themed rides like the “Ales on Rails” beer-tasting excursions for a fun, adults-only trip. - Best Time To Go: Mid-to-late October is the sweet spot for peak color in this region. ⛰️ Cass Scenic Railroad, West Virginia The Angle: Authentic Appalachian Adventure For a truly unique and historic experience, head to the mountains of West Virginia. The Cass Scenic Railroad is not a typical tourist train; it's an authentic, historic logging railroad that uses powerful steam locomotives to chug its way up a mountain. The journey through the rugged Appalachian wilderness is spectacular, culminating in a panoramic view…",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/hese-5-U.S.-Scenic-Train-Rides-Offer-The-Best-Fall-Views-This-Year.jpg",
    "source": "https://www.traveloffpath.com/these-5-u-s-scenic-train-rides-offer-the-best-fall-views-this-year/"
  },
  {
    "slug": "new-ultra-cheap-flights-launching-from-u-s-to-this-trendy-caribbean-pa",
    "title": "New Ultra-Cheap Flights Launching From U.S. To This Trendy Caribbean Paradise",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "Already thinking of your next sun-drenched Caribbean getaway this winter? Before you go ahead and spend hundreds of dollars on those ‘irresistible' round-trip flights that are, in fact, not as cheap as they could be, you'll want to hear this one out: From November 15, Arajet, the Dominican Republic's new budget carrier, will start ultra-affordable direct flights from Chicago to Punta Cana. Home to postcard white-sand beaches hugged by teal seas, world-class resorts, and a lively entertainment district peppered with restaurants and nightclubs, it is one of the trendiest destinations in the Tropics, and it's never been cheaper to get to: At Last… Arajet Is Coming To Chicago! You might not have come across Arajet in your flight searches before, but that's because they're a new airline launched in 2022, and until recently, they operated to and from select hubs across the Americas. It has grown significantly since its launch, and by 2025, it will already serve destinations such as Miami (MIA), Newark (EWR), and even San Juan (SJU) in Puerto Rico. Arajet isn't exactly known for its top-notch service, comfy flying experience, and wide range of onboard amenities, but what they do excel at is their unbeatable prices. That is, if you're flying at the lowest possible fare, with carry-on only. From Miami, round-trip tickets average only $196 flying to Punta Cana (PUJ), and from Newark (EWR) to Santo Domingo, the culture-loaded capital of the Dominican Republic, you can expect to pay roughly $208 both ways. Given their low-cost appeal, it was about time they finally debuted in the Midwest market: $234 Roundtrip Fares Going To Punta Cana From November 15, Arajet service will begin between Chicago O'Hare (ORD) and Punta Cana, with base round-trip fares currently estimated at $234 (without extras). We're sure this might increase as time goes on, but for now, the predicted frequency is three-times-weekly flights, with the operation days as follows: - From Punta Cana (PUJ): Tuesdays, Saturdays, and Sundays - From Chicago O'Hare (ORD): Mondays, Wednesdays, and Saturdays Outbound flights departing from Chicago have a listed departure of 10:27 A.M. from ORD, arriving to PUJ at 5:12 P.M. for a total flight time of 4h45. Meanwhile, return flights from PUJ are expected to depart at 5:47 A.M. (who here's an early bird?), touching down back in ORD at 8:57 A.M. just in time for breakfast at Berghoff Cafe in Terminal 1. What To Expect Flying Arajet When it comes to Arajet's bag allowance, you should know it uses the common low-cost carrier structure: - ‘Base' fare: personal item only, with no free carry-on or checked luggage - ‘Comfort': larger carry allowance or one checked baggage, depending on route - ‘Extra': checked baggage, priority…",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/New-Ultra-Cheap-Flights-Launching-From-U.S.-To-This-Trendy-Caribbean-Paradise.jpg",
    "source": "https://www.traveloffpath.com/new-ultra-cheap-flights-launching-from-u-s-to-this-trendy-caribbean-paradise/"
  },
  {
    "slug": "these-3-paradise-islands-named-must-visit-destinations-this-fall",
    "title": "These 3 Paradise Islands Named Must-Visit Destinations This Fall",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "PSLs are sure to be tasty, but you don't have to give in to the idea that the only way to enjoy the fall season is by reaching into the back of your closet for your finest checkered flannel to hit up apple orchards and tree-lined mountain roadways. There are still stunning beaches awaiting all across the globe. While some popular U.S. beach towns don't quite have the same appeal as sunny summers, that's what passports are here for. The travel experts at FlightHub have mixed personal insight and data to craft a list of must-visit fall destinations. While icons like New York, LA, and Orlando make the cut time and time again, there were some real surprises for more adventurous travelers seeking to escape axe-throwing at pumpkin patches in favor of paradisal sun-drenched shores. These 3 international paradise islands were named must-visit destinations this fall: 3) San Blas, Panama Panama may not have been on your Bingo card for a Caribbean escape this fall, but as a recent visitor to this highly underrated and diverse utopia of wildlife, pristine beaches, and cultural delights, it earned my stamp of approval right away. While I didn't have the chance to visit the cluster of islands making up San Blas, I did visit another practically untouched seaside oasis (Portobelo) on the other side of the country, and it was definitely worth the adventure. Though San Blas is where locals send tourists for an ideal picture-perfect beach vacation, as it's more suited for flawless getaways, while Portobelo is a small town still making its way onto travelers' itineraries. In San Blas, you'll find immense beauty and a rich indigenous culture. As beautiful as this region may be, don't quite expect Cancun-level resorts. Flying into Panama City is the easy part, then you'll need to tap into your sense of wanderlust as the trek ahead is a doozy, so many hire a professional guide. Upon arrival, expect a rustic, off-grid experience with gleaming white-sand beaches, crystal-clear waters, and a lack of large-scale tourism infrastructure, which is all part of the appeal. From there, island-hop, snorkel, swim, lounge beachside, and learn all about Guna culture at your leisure. 2) Vis, Croatia We at Travel Off Path already recently revealed another awesome Croatian destination (Zagreb) taking this Mediterranean hotspot by storm, so if you thought Dubrovnik was the only way to experience this trendy country, we've got news for you! Honestly, now is a great time to start planning your trip anywhere in Croatia for more elbow room on the beach, but the little island of Vis is a year-round tight-lipped secret. Boasting a Mediterranean climate, you know the weather is just as nice (if not…",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/These-3-Paradise-Islands-Named-Must-Visit-Destinations-This-Fall.jpg",
    "source": "https://www.traveloffpath.com/these-3-paradise-islands-named-must-visit-destinations-this-fall/"
  },
  {
    "slug": "delta-will-launch-new-nonstop-flights-to-2-of-europe-s-trendiest-sunny",
    "title": "Delta Will Launch New Nonstop Flights To 2 Of Europe’s Trendiest Sunny Destinations",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "Planning a European getaway for the coming year, but you've been waiting for new nonstop routes to open from your favorite hub at Boston Logan International? This time, you're in luck, as Delta is adding not one, but two new European destinations to the Massachusetts capital's network from May 16, 2026: Madrid, Spain's capital and its leading city break, and Nice, the trendiest beach spot in the South of France. Here's everything you need to know about the new flights, and what to expect from Delta's summer 2026 strategy: Boston As Delta's New Gateway To Europe Over the last few years, Delta has ramped up Europe-bound service from its Boston (BOS) base like no other, from boosting frequency to cities like London and Barcelona, to starting new flights to in-demand destinations that previously lacked a connection with Massachusetts. When it comes to Madrid, there are in fact nonstop flights from Boston to the Spanish capital already, except they're operated by Spain's own Iberia, and in the high season, they're joined by low-cost JetBlue. Be that as it may, there has never been a full-service, U.S.-based airline operating in this market. As for Nice, this will be the first time Boston-based travelers enjoy a nonstop connection to the Pearl of the French Riviera, without requiring stopovers in Paris. Previously, Delta only offered nonstop service to Nice from Atlanta, New York (JFK), and Philadelphia. Now that Madrid and Nice are in the cards, Delta will serve at least a dozen European destinations from Boston next summer. Madrid flights will be available daily, while Nice ones will initially run on a three-times-weekly schedule, on Tuesdays, Thursdays, and Saturdays. By the way, in the meantime, Barcelona flights will increase to a daily frequency from May 7, and Milan will see four-times-weekly flights from May 16. What To Expect From Delta's New Europe Flights It's no wonder Delta is investing this heavily in Boston, now that Logan International hosts their Delta One Lounge and a revamped, larger Sky Club Space. In short, they're aiming to become the first choice for travelers heading to Europe. Comfort plays a huge part in it, as well. Both Madrid and Nice routes will be run on a brand new Airbus A330-900neo, with a 281-seat configuration. Out of those, 29 are reserved for Delta One (their business class) seats, 28 are for Premium Select (the equivalent to Premium Economy, 56 are Comfort+ seats (these typically offer extra legroom), and finally, 168 seats in the Main Cabin. As far as competition goes, Madrid is a smart move. Seeing that only JetBlue offered Boston–Madrid flights in summer, with their restrictive luggage policies and subpar in-flight services, Delta's addition will lure travelers who…",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/Delta-Will-Launch-New-Nonstop-Flights-To-2-Of-Europes-Trendiest-Sunny-Destinations.jpg",
    "source": "https://www.traveloffpath.com/delta-will-launch-new-nonstop-flights-to-2-of-europes-trendiest-sunny-destinations/"
  },
  {
    "slug": "5-underrated-u-s-cities-perfect-for-a-weekend-getaway-this-fall",
    "title": "5 Underrated U.S. Cities Perfect For A Weekend Getaway This Fall",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "The kids are back in school, the long, hazy days of summer are in the rearview mirror, and there’s a new kind of energy in the air. It's that magical time of year when you start thinking about cozy sweaters, crisp autumn air, and that first glorious sip of a pumpkin spice latte. You're holding on to that hope of a perfect weekend fall getaway. Sure, you could book the obvious trip to New York City, but let's be real—you'll be fighting for a patch of grass in Central Park with a million other people. What if you could get all the amazing fall vibes without the crowds? Here at Travel Off Path, we believe the best autumn trips are the ones that fly under the radar. We've found 5 incredible, underrated U.S. cities that are perfect for a quick escape this season. 🍂 ⛰️ Chattanooga, Tennessee The Ultimate Outdoor Adventure Hub While everyone flocks to Nashville or the Smokies, Chattanooga is the smart choice for an active fall weekend. Tucked into the Tennessee River Valley, the city is surrounded by mountains that explode with color in late October. The vibe is laid-back, the hiking is epic, and the views are 10/10. - You Have To: Take the incline railway up Lookout Mountain to visit Rock City and Ruby Falls. The panoramic view of seven states is a classic for a reason. For a more chill experience, walk across the vibrant blue Walnut Street Bridge and explore the cool local shops and cafes in the NorthShore district. 🍖 Kansas City, Missouri The Cool & Cultured Midwest Surprise Forget what you think you know about “flyover country.” Kansas City is having a major moment, and fall is the perfect time to visit. This city is a powerhouse of culture, with world-class jazz clubs, a surprisingly hip arts scene, and, of course, the best barbecue on the planet. - You Have To: Make a pilgrimage to an iconic BBQ joint like Joe's Kansas City (yes, the one in the gas station!) or Arthur Bryant's. Then, spend an afternoon at the incredible (and free!) Nelson-Atkins Museum of Art before checking out the galleries and breweries in the trendy Crossroads Arts District. 🧀 Madison, Wisconsin The Perfect College Town Weekend There’s a special kind of energy in a great college town in the fall, and Madison might just be the best of them all. Situated on a narrow strip of land between two sparkling lakes, this city is pure autumn magic. The air is crisp, the university gives the city a vibrant buzz, and the fall colors are spectacular. - You Have To: Spend Saturday morning at the Dane County Farmers' Market, one of…",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/08/5-Underrated-U.S.-Cities-Perfect-For-A-Weekend-Getaway-This-Fall.jpg",
    "source": "https://www.traveloffpath.com/5-underrated-u-s-cities-perfect-for-a-weekend-getaway-this-fall/"
  },
  {
    "slug": "4-important-tips-for-visiting-cancun-this-fall-according-to-experts",
    "title": "4 Important Tips For Visiting Cancun This Fall According To Experts",
    "category": "Travel",
    "date": "2025-09-01",
    "excerpt": "Fall is arguably the best period to visit Cancun if you're hoping for smaller crowds and cheaper prices. After all, the July and August crowds are gone, hotels deliberately lower prices to attract more guests, and there are getaway deals galore… or are there? For years now, sun-seekers on a budget have waited impatiently for September to book their Cancun vacay, knowing they would get more bang for their buck, but as the experts have told us in 2025, this may no longer be the case. After all, ‘low' and ‘high' seasons are no longer existing concepts in the Caribbean hub. That's one of 4 things the Cancun Sun, the leading independent English-speaking authority on all things Mayan Riviera, has shared as we head into the (supposedly) quieter months: Cancun's ‘Low Season' Is a Thing of the Past If you're headed for Cancun this upcoming season, the main thing you should know is that those images of a deserted hotel strip, with a wide availability of first-come, first-served restaurants, and open slots on guided tours, may no longer be the case. As they have noted, ‘low season' now looks more like ‘less busy'. There are lower crowds than in winter, that's for sure, but if you're visiting on the weekend, you should expect a major influx of beach bums at public bathing areas, and partygoers to flock into the entertainment district. Long gone are the days you could just ‘chance it' and book stuff last-minute in the fall. Be it trendy restaurants, popular activities, like visiting cenotes or Mayan ruins, or spa appointments at your resort, you'd be wise to secure spots in advance. Who Will You Be Sharing the Resort With? The Cancun Sun also reiterates that, despite the continuous crowding, the type of crowd changes. After all, schools across the United States and Canada have resumed classes, so you can for sure expect to see fewer families with children and adolescents in resorts. This helps contribute to the overall adult-centered, more laid-back feel. That being said, you can never entirely rule out children running around and splashing around in the pool when all you need is some peace and quiet. Your fellow Americans may be gone, but there will be families from other parts of the world that do not operate under the U.S. school schedule. In those cases, it's best to book an adults-only resort. Here are some options, and their average September nightly rate: - Le Blanc Spa Resort—$706-a-night - Atelier Playa Mujeres—$708-a-night - Excellence Playa Mujeres—$622-a-night - Live Aqua Beach Resort—$337-a-night - Royalton CHIC Cancun—$257-a-night Deep Discounts Are Over, But Value Can Be Found As you might have noticed from the averages given above, it's…",
    "cover": "https://www.traveloffpath.com/wp-content/uploads/2025/07/This-Is-How-To-Book-The-Perfect-Hotel-In-Cancun-According-To-Experts.jpg",
    "source": "https://www.traveloffpath.com/4-important-tips-for-visiting-cancun-this-fall-according-to-experts/"
  },
  {
    "slug": "these-5-u-s-scenic-train-rides-offer-the-best-fall-views-this-year",
    "title": "These 5 U.S. Scenic Train Rides Offer The Best Fall Views This Year",
    "category": "Travel",
    "date": "2025-09-01",
    "author": "Travel Off Path",
    "source": "https://www.traveloffpath.com/these-5-u-s-scenic-train-rides-offer-the-best-fall-views-this-year/",
    "cover": "assets/img/cover-fallback.jpg",
    "excerpt": "--- title: These 5 U.S. Scenic Train Rides Offer The Best Fall Views This Year author: Travel Off Path url: https://www.traveloffpath.com/these-5-u-s-scenic-train-rides-offer-the-best-fall-views-this-year/ hostname: traveloffpath.com description: Forget the traffic! 🚂 See the best fall foliage this year from a scenic train. Our guide reveals 5 stunning rail journeys for the ultimate autumn color show. sitename: Travel Off Path date: 2025-09-01 categories: ['Travel', 'Travel News'] tags: ['fall travel', 'Scenic Trains', 'Train Travel'] --- With the close of summer, it means that fall is starting to make its way into the minds of most of us. To many people across the U.S., fall means cozy nights, apple cider, warm sweaters, and, of course, the fall foliage craze that begins to take over the country. Foliage fever is real, and while road trips and national park hikes are great, why not experience America’s beautiful autumn views by rail this year? Here at Travel Off Path, we’ve seen that train travel is having a major moment. It’s a chance to sit back, relax, and soak in the stunning views without the stress of driving. Based on the scenic railways travelers were raving about last year, here are 5 U.S. train rides that offer some of the best fall views for 2025. 🚂 Conway Scenic Railroad, New Hampshire The Angle: Classic New England Beauty If you want the quintessential New England fall experience, this is it. While there are many foliage trains in the region, travelers in 2024 consistently gushed that the Mountaineer route on the Conway Scenic Railroad is one of the most spectacular rail journeys in the country. Winding through the heart of the White Mountains and the dramatic Crawford Notch, this trip offers cliffside views, historic trestles, and a sea of vibrant red and orange maple trees. - The Experience: This is a longer, more immersive trip, offering a dining car and a true feeling of golden-era train travel. - Best Time To Go: The first two weeks of October are typically peak season for this part of New Hampshire. 🏞️ Cuyahoga Valley Scenic Railroad, Ohio The Angle: A National Park by Rail There’s a reason this Ohio favorite remains on the list: it’s one of the only scenic railways that runs directly through a U.S. National Park. The Cuyahoga Valley Scenic Railroad gives you a front-row seat to the deep forests and rolling hills of the park as they explode into fiery shades of red, orange, and purple. It’s an incredibly accessible way to experience a national park’s fall beauty. - The Experience: Look for themed rides like the “Ales on Rails” beer-tasting excursions for a fun, adults-only trip. - Best Time To Go: Mid-to-late October is the sweet spot for peak color…",
    "content": "---\ntitle: These 5 U.S. Scenic Train Rides Offer The Best Fall Views This Year\nauthor: Travel Off Path\nurl: https://www.traveloffpath.com/these-5-u-s-scenic-train-rides-offer-the-best-fall-views-this-year/\nhostname: traveloffpath.com\ndescription: Forget the traffic! 🚂 See the best fall foliage this year from a scenic train. Our guide reveals 5 stunning rail journeys for the ultimate autumn color show.\nsitename: Travel Off Path\ndate: 2025-09-01\ncategories: ['Travel', 'Travel News']\ntags: ['fall travel', 'Scenic Trains', 'Train Travel']\n---\nWith the close of summer, it means that fall is starting to make its way into the minds of most of us. To many people across the U.S., fall means cozy nights, apple cider, warm sweaters, and, of course, the fall foliage craze that begins to take over the country.\nFoliage fever is real, and while road trips and national park hikes are great, why not experience America’s beautiful autumn views by rail this year? Here at Travel Off Path, we’ve seen that train travel is having a major moment. It’s a chance to sit back, relax, and soak in the stunning views without the stress of driving.\nBased on the scenic railways travelers were raving about last year, here are 5 U.S. train rides that offer some of the best fall views for 2025.\n🚂 Conway Scenic Railroad, New Hampshire\nThe Angle: Classic New England Beauty\nIf you want the quintessential New England fall experience, this is it. While there are many foliage trains in the region, travelers in 2024 consistently gushed that the Mountaineer route on the Conway Scenic Railroad is one of the most spectacular rail journeys in the country. Winding through the heart of the White Mountains and the dramatic Crawford Notch, this trip offers cliffside views, historic trestles, and a sea of vibrant red and orange maple trees.\n- The Experience: This is a longer, more immersive trip, offering a dining car and a true feeling of golden-era train travel.\n- Best Time To Go: The first two weeks of October are typically peak season for this part of New Hampshire.\n🏞️ Cuyahoga Valley Scenic Railroad, Ohio\nThe Angle: A National Park by Rail\nThere’s a reason this Ohio favorite remains on the list: it’s one of the only scenic railways that runs directly through a U.S. National Park. The Cuyahoga Valley Scenic Railroad gives you a front-row seat to the deep forests and rolling hills of the park as they explode into fiery shades of red, orange, and purple. It’s an incredibly accessible way to experience a national park’s fall beauty.\n- The Experience: Look for themed rides like the “Ales on Rails” beer-tasting excursions for a fun, adults-only trip.\n- Best Time To Go: Mid-to-late October is the sweet spot for peak color in this region.\n⛰️ Cass Scenic Railroad, West Virginia\nThe Angle: Authentic Appalachian Adventure\nFor a truly unique and historic experience, head to the mountains of West Virginia. The Cass Scenic Railroad is not a typical tourist train; it's an authentic, historic logging railroad that uses powerful steam locomotives to chug its way up a mountain. The journey through the rugged Appalachian wilderness is spectacular, culminating in a panoramic view from Bald Knob, the third-highest point in the state.\n- The Experience: This is a loud, powerful, and authentic steam train ride that feels like stepping back in time. The views from the top are absolutely breathtaking.\n- Best Time To Go: The first three weeks of October offer the best chance for vibrant colors.\n🏜️ Verde Canyon Railroad, Arizona\nThe Angle: Surprising Desert Beauty\nA fall foliage trip in the Arizona desert? Absolutely! This is our “underrated gem” pick that travelers raved about last year for being so unexpected. The Verde Canyon Railroad follows the Verde River through a stunning red rock canyon. In the fall, the cottonwood and sycamore trees that line the river turn a brilliant, shocking yellow, creating an incredible contrast against the red cliffs and blue sky.\n- The Experience: Book a seat in an open-air viewing car to get the best, unobstructed photos of the canyon and the vibrant ribbon of gold below.\n- Best Time To Go: Late October through the first two weeks of November.\n🏔️ Durango & Silverton Narrow Gauge Railroad, Colorado\nThe Angle: The Rocky Mountain Epic\nThis is a true bucket-list journey. The historic Durango & Silverton steam train winds its way through the remote wilderness of the San Juan National Forest, carving through canyons alongside the rushing Animas River. In the fall, the route is lined with millions of golden aspen trees, creating a world-class spectacle of color. It's an unforgettable, epic journey that consistently ranks as one of the best train rides in the world.\n- The Experience: This is an all-day adventure. The train climbs nearly 3,000 feet on its way to the historic mining town of Silverton.\n- Best Time To Go: The last two weeks of September are prime time for the “aspen gold” rush.\nSo this fall, trade the highway traffic for a window seat and let someone else do the driving for a change. It’s a perfect way to experience the magic of the season without the stress. Happy Fall Travels! 🚂\nThe Travel Off Path Advantage: Your Travel Toolkit\nThe 1-Minute Trip Check\nOur flagship tool. Solves your entire pre-flight travel planning in a few easy steps. From entry rules to hidden fees and safety.\nU.S. Travel Advisory Checker\nAn easy tool to check all the latest travel advisories from the U.S. State Department.\nEntry Requirements Checker\nAn easy tool to check all the entry requirements for your destination.\nThe Upgrade Newsletter\nUnlock travel tips, hot destination insights, and exclusive flight deals.\nJoin Our Community\nWith over 25,000 members on Facebook!\nSubscribe To Our Latest Posts\nEnter your email address to subscribe to Travel Off Path's latest breaking travel news, straight to your inbox."
  },
  {
    "slug": "new-ultra-cheap-flights-launching-from-u-s-to-this-trendy-caribbean-pa",
    "title": "New Ultra-Cheap Flights Launching From U.S. To This Trendy Caribbean Paradise",
    "category": "Travel",
    "date": "2025-09-01",
    "author": "Vinicius Costa",
    "source": "https://www.traveloffpath.com/new-ultra-cheap-flights-launching-from-u-s-to-this-trendy-caribbean-paradise/",
    "cover": "assets/img/cover-fallback.jpg",
    "excerpt": "--- title: New Ultra-Cheap Flights Launching From U.S. To This Trendy Caribbean Paradise author: Vinicius Costa url: https://www.traveloffpath.com/new-ultra-cheap-flights-launching-from-u-s-to-this-trendy-caribbean-paradise/ hostname: traveloffpath.com description: From November 15, Chicagoans will be able to fly to Punta Cana from as cheap as $234 roundtrip with Dominican low-cost carrier Arajet. sitename: Travel Off Path date: 2025-09-01 categories: ['Travel', 'Travel News'] tags: ['Arajet', 'chicago', 'Dominican Republic', 'Illinois', 'new flighs', 'Punta Cana'] --- Already thinking of your next sun-drenched Caribbean getaway this winter? Before you go ahead and spend hundreds of dollars on those ‘irresistible' round-trip flights that are, in fact, not as cheap as they could be, you'll want to hear this one out: From November 15, Arajet, the Dominican Republic's new budget carrier, will start ultra-affordable direct flights from Chicago to Punta Cana. Home to postcard white-sand beaches hugged by teal seas, world-class resorts, and a lively entertainment district peppered with restaurants and nightclubs, it is one of the trendiest destinations in the Tropics, and it's never been cheaper to get to: At Last… Arajet Is Coming To Chicago! You might not have come across Arajet in your flight searches before, but that's because they're a new airline launched in 2022, and until recently, they operated to and from select hubs across the Americas. It has grown significantly since its launch, and by 2025, it will already serve destinations such as Miami (MIA), Newark (EWR), and even San Juan (SJU) in Puerto Rico. Arajet isn't exactly known for its top-notch service, comfy flying experience, and wide range of onboard amenities, but what they do excel at is their unbeatable prices. That is, if you're flying at the lowest possible fare, with carry-on only. From Miami, round-trip tickets average only $196 flying to Punta Cana (PUJ), and from Newark (EWR) to Santo Domingo, the culture-loaded capital of the Dominican Republic, you can expect to pay roughly $208 both ways. Given their low-cost appeal, it was about time they finally debuted in the Midwest market: $234 Roundtrip Fares Going To Punta Cana From November 15, Arajet service will begin between Chicago O'Hare (ORD) and Punta Cana, with base round-trip fares currently estimated at $234 (without extras). We're sure this might increase as time goes on, but for now, the predicted frequency is three-times-weekly flights, with the operation days as follows: - From Punta Cana (PUJ): Tuesdays, Saturdays, and Sundays - From Chicago O'Hare (ORD): Mondays, Wednesdays, and Saturdays Outbound flights departing from Chicago have a listed departure of 10:27 A.M. from ORD, arriving to PUJ at 5:12 P.M. for a total flight time of 4h45. Meanwhile, return flights from PUJ are expected to depart at 5:47 A.M. (who here's an early bird?), touching down back in ORD at…",
    "content": "---\ntitle: New Ultra-Cheap Flights Launching From U.S. To This Trendy Caribbean Paradise\nauthor: Vinicius Costa\nurl: https://www.traveloffpath.com/new-ultra-cheap-flights-launching-from-u-s-to-this-trendy-caribbean-paradise/\nhostname: traveloffpath.com\ndescription: From November 15, Chicagoans will be able to fly to Punta Cana from as cheap as $234 roundtrip with Dominican low-cost carrier Arajet.\nsitename: Travel Off Path\ndate: 2025-09-01\ncategories: ['Travel', 'Travel News']\ntags: ['Arajet', 'chicago', 'Dominican Republic', 'Illinois', 'new flighs', 'Punta Cana']\n---\nAlready thinking of your next sun-drenched Caribbean getaway this winter? Before you go ahead and spend hundreds of dollars on those ‘irresistible' round-trip flights that are, in fact, not as cheap as they could be, you'll want to hear this one out:\nFrom November 15, Arajet, the Dominican Republic's new budget carrier, will start ultra-affordable direct flights from Chicago to Punta Cana.\nHome to postcard white-sand beaches hugged by teal seas, world-class resorts, and a lively entertainment district peppered with restaurants and nightclubs, it is one of the trendiest destinations in the Tropics, and it's never been cheaper to get to:\nAt Last… Arajet Is Coming To Chicago!\nYou might not have come across Arajet in your flight searches before, but that's because they're a new airline launched in 2022, and until recently, they operated to and from select hubs across the Americas.\nIt has grown significantly since its launch, and by 2025, it will already serve destinations such as Miami (MIA), Newark (EWR), and even San Juan (SJU) in Puerto Rico.\nArajet isn't exactly known for its top-notch service, comfy flying experience, and wide range of onboard amenities, but what they do excel at is their unbeatable prices. That is, if you're flying at the lowest possible fare, with carry-on only.\nFrom Miami, round-trip tickets average only $196 flying to Punta Cana (PUJ), and from Newark (EWR) to Santo Domingo, the culture-loaded capital of the Dominican Republic, you can expect to pay roughly $208 both ways.\nGiven their low-cost appeal, it was about time they finally debuted in the Midwest market:\n$234 Roundtrip Fares Going To Punta Cana\nFrom November 15, Arajet service will begin between Chicago O'Hare (ORD) and Punta Cana, with base round-trip fares currently estimated at $234 (without extras).\nWe're sure this might increase as time goes on, but for now, the predicted frequency is three-times-weekly flights, with the operation days as follows:\n- From Punta Cana (PUJ): Tuesdays, Saturdays, and Sundays\n- From Chicago O'Hare (ORD): Mondays, Wednesdays, and Saturdays\nOutbound flights departing from Chicago have a listed departure of 10:27 A.M. from ORD, arriving to PUJ at 5:12 P.M. for a total flight time of 4h45.\nMeanwhile, return flights from PUJ are expected to depart at 5:47 A.M. (who here's an early bird?), touching down back in ORD at 8:57 A.M. just in time for breakfast at Berghoff Cafe in Terminal 1.\nWhat To Expect Flying Arajet\nWhen it comes to Arajet's bag allowance, you should know it uses the common low-cost carrier structure:\n- ‘Base' fare: personal item only, with no free carry-on or checked luggage\n- ‘Comfort': larger carry allowance or one checked baggage, depending on route\n- ‘Extra': checked baggage, priority boarding, and add-ons you'd typically have to pay for are included\nAs of now, the average fares for the Comfort and Extra fares from Chicago to Punta Cana haven't been formally disclosed, but based on Arajet's historical pricing, we can expect Comfort to start at approximately $253 and Extra at $269.\nOnce again, these are estimates, and final prices depend on seat availability, seasonal demand, and other factors.\nEither way, there's no denying Arajet will be a stone in American and United's shoes, and perhaps even Frontier's, once they enter the Chicago market.\nWith American Airlines, the cheapest round-trip tickets going to Punta Cana from O'Hare are $328. With United, that's an even pricier $348, and with Frontier, they average $328.\nPrepare For Your Punta Cana Getaway\nIf you're flying to Punta Cana this winter, make sure you prepare in advance with our newly-launched, free-to-use Traveler Tools.\nUse our TOP Entry Requirement Checker to verify whether there are any visa or digital entry permit restrictions imposed on Americans, and the (already popular) Travel Advisory Check, to stay on the loop about security updates at your destination.\nThe Travel Off Path Advantage: Your Travel Toolkit\nThe 1-Minute Trip Check\nOur flagship tool. Solves your entire pre-flight travel planning in a few easy steps. From entry rules to hidden fees and safety.\nU.S. Travel Advisory Checker\nAn easy tool to check all the latest travel advisories from the U.S. State Department.\nEntry Requirements Checker\nAn easy tool to check all the entry requirements for your destination.\nThe Upgrade Newsletter\nUnlock travel tips, hot destination insights, and exclusive flight deals.\nJoin Our Community\nWith over 25,000 members on Facebook!\nSubscribe To Our Latest Posts\nEnter your email address to subscribe to Travel Off Path's latest breaking travel news, straight to your inbox."
  },
  {
    "slug": "these-3-paradise-islands-named-must-visit-destinations-this-fall",
    "title": "These 3 Paradise Islands Named Must-Visit Destinations This Fall",
    "category": "Travel",
    "date": "2025-09-01",
    "author": "Sam Sears",
    "source": "https://www.traveloffpath.com/these-3-paradise-islands-named-must-visit-destinations-this-fall/",
    "cover": "assets/img/cover-fallback.jpg",
    "excerpt": "--- title: These 3 Paradise Islands Named Must-Visit Destinations This Fall author: Sam Sears url: https://www.traveloffpath.com/these-3-paradise-islands-named-must-visit-destinations-this-fall/ hostname: traveloffpath.com description: Escape the ordinary this fall. Discover pristine islands with surprising culture that promise adventure and relaxation beyond summer. sitename: Travel Off Path date: 2025-09-01 categories: ['Travel', 'Travel News'] tags: ['beach vacations', 'fall travel', 'island getaways', 'trending'] --- PSLs are sure to be tasty, but you don't have to give in to the idea that the only way to enjoy the fall season is by reaching into the back of your closet for your finest checkered flannel to hit up apple orchards and tree-lined mountain roadways. There are still stunning beaches awaiting all across the globe. While some popular U.S. beach towns don't quite have the same appeal as sunny summers, that's what passports are here for. The travel experts at FlightHub have mixed personal insight and data to craft a list of must-visit fall destinations. While icons like New York, LA, and Orlando make the cut time and time again, there were some real surprises for more adventurous travelers seeking to escape axe-throwing at pumpkin patches in favor of paradisal sun-drenched shores. These 3 international paradise islands were named must-visit destinations this fall: 3) San Blas, Panama Panama may not have been on your Bingo card for a Caribbean escape this fall, but as a recent visitor to this highly underrated and diverse utopia of wildlife, pristine beaches, and cultural delights, it earned my stamp of approval right away. While I didn't have the chance to visit the cluster of islands making up San Blas, I did visit another practically untouched seaside oasis (Portobelo) on the other side of the country, and it was definitely worth the adventure. Though San Blas is where locals send tourists for an ideal picture-perfect beach vacation, as it's more suited for flawless getaways, while Portobelo is a small town still making its way onto travelers' itineraries. In San Blas, you'll find immense beauty and a rich indigenous culture. As beautiful as this region may be, don't quite expect Cancun-level resorts. Flying into Panama City is the easy part, then you'll need to tap into your sense of wanderlust as the trek ahead is a doozy, so many hire a professional guide. Upon arrival, expect a rustic, off-grid experience with gleaming white-sand beaches, crystal-clear waters, and a lack of large-scale tourism infrastructure, which is all part of the appeal. From there, island-hop, snorkel, swim, lounge beachside, and learn all about Guna culture at your leisure. 2) Vis, Croatia We at Travel Off Path already recently revealed another awesome Croatian destination (Zagreb) taking this Mediterranean hotspot by storm, so if you thought Dubrovnik was the only way…",
    "content": "---\ntitle: These 3 Paradise Islands Named Must-Visit Destinations This Fall\nauthor: Sam Sears\nurl: https://www.traveloffpath.com/these-3-paradise-islands-named-must-visit-destinations-this-fall/\nhostname: traveloffpath.com\ndescription: Escape the ordinary this fall. Discover pristine islands with surprising culture that promise adventure and relaxation beyond summer.\nsitename: Travel Off Path\ndate: 2025-09-01\ncategories: ['Travel', 'Travel News']\ntags: ['beach vacations', 'fall travel', 'island getaways', 'trending']\n---\nPSLs are sure to be tasty, but you don't have to give in to the idea that the only way to enjoy the fall season is by reaching into the back of your closet for your finest checkered flannel to hit up apple orchards and tree-lined mountain roadways.\nThere are still stunning beaches awaiting all across the globe.\nWhile some popular U.S. beach towns don't quite have the same appeal as sunny summers, that's what passports are here for.\nThe travel experts at FlightHub have mixed personal insight and data to craft a list of must-visit fall destinations.\nWhile icons like New York, LA, and Orlando make the cut time and time again, there were some real surprises for more adventurous travelers seeking to escape axe-throwing at pumpkin patches in favor of paradisal sun-drenched shores.\nThese 3 international paradise islands were named must-visit destinations this fall:\n3) San Blas, Panama\nPanama may not have been on your Bingo card for a Caribbean escape this fall, but as a recent visitor to this highly underrated and diverse utopia of wildlife, pristine beaches, and cultural delights, it earned my stamp of approval right away.\nWhile I didn't have the chance to visit the cluster of islands making up San Blas, I did visit another practically untouched seaside oasis (Portobelo) on the other side of the country, and it was definitely worth the adventure.\nThough San Blas is where locals send tourists for an ideal picture-perfect beach vacation, as it's more suited for flawless getaways, while Portobelo is a small town still making its way onto travelers' itineraries.\nIn San Blas, you'll find immense beauty and a rich indigenous culture. As beautiful as this region may be, don't quite expect Cancun-level resorts.\nFlying into Panama City is the easy part, then you'll need to tap into your sense of wanderlust as the trek ahead is a doozy, so many hire a professional guide.\nUpon arrival, expect a rustic, off-grid experience with gleaming white-sand beaches, crystal-clear waters, and a lack of large-scale tourism infrastructure, which is all part of the appeal.\nFrom there, island-hop, snorkel, swim, lounge beachside, and learn all about Guna culture at your leisure.\n2) Vis, Croatia\nWe at Travel Off Path already recently revealed another awesome Croatian destination (Zagreb) taking this Mediterranean hotspot by storm, so if you thought Dubrovnik was the only way to experience this trendy country, we've got news for you!\nHonestly, now is a great time to start planning your trip anywhere in Croatia for more elbow room on the beach, but the little island of Vis is a year-round tight-lipped secret.\nBoasting a Mediterranean climate, you know the weather is just as nice (if not better) than summer, and given the lack of crowds here anyway, it makes it even more enjoyable for a relaxing escape, wining and dining with tranquil beaches and picturesque villages wrapping the island, but don't skip the hidden cove of Stiniva (see first photo).\nSample local Vugava and Plavac Mali wines, hike to Mount Hum, and always grab a patio seat when possible, especially in the town of the same name (Vis), along with Komiža.\nDon't expect flashy resorts cramping your space on a dreamy beach. Instead, it's much easier to find boutique hotels in town.\nTo get here, your best bet is flying into Split and hopping on a ferry, where you'll bypass Hvar, a more popular island overshadowing Vis, even for mainstream travelers like me.\n1) Boracay, Philippines\nIf you had to guess the top destination Americans have their eyes on in the Philippines, what would you guess?\nManila? Cebu? Palawan? nope!\nSurprise, surprise. It's Boracay, according to our last feature on this surging island.\nThe irony is that Boracay limits the number of daily visitors to minimize environmental impact and provide more enjoyment for beachgoers.\nEven with its diminutive size, this island packs a punch with powdery white-sand beaches, transparent waters, and a plethora of aquatic thrills, ranging from sailing, snorkeling, and banana boat rides, and for the ultimate relaxation, expect to be offered massages by beach vendors.\nWhether they're properly vetted or not is a different story…\nWhite Beach (living up to its name) is where you'll find premier resorts nestled against white sand, and Puka Shell Beach is more known for its seclusion and colorful shells washing ashore.\nIf you're a seafood lover, there are a few places across Asia that will please your palate the same way as Boracay.\nWith beachfront barbecues blazing fresh catches, you'll never celebrate July 4th with a backyard burger again.\nTo reach Boracay, many opt to fly from Manila to Caticlan and then take a ferry. Best of all, if you do get lost, the Philippines is primarily an English-speaking nation.\nThe Travel Off Path Advantage: Your Travel Toolkit\nThe 1-Minute Trip Check\nOur flagship tool. Solves your entire pre-flight travel planning in a few easy steps. From entry rules to hidden fees and safety.\nU.S. Travel Advisory Checker\nAn easy tool to check all the latest travel advisories from the U.S. State Department.\nEntry Requirements Checker\nAn easy tool to check all the entry requirements for your destination.\nThe Upgrade Newsletter\nUnlock travel tips, hot destination insights, and exclusive flight deals.\nJoin Our Community\nWith over 25,000 members on Facebook!\nSubscribe To Our Latest Posts\nEnter your email address to subscribe to Travel Off Path's latest breaking travel news, straight to your inbox."
  },
  {
    "slug": "delta-will-launch-new-nonstop-flights-to-2-of-europe-s-trendiest-sunny",
    "title": "Delta Will Launch New Nonstop Flights To 2 Of Europe’s Trendiest Sunny Destinations",
    "category": "Travel",
    "date": "2025-09-01",
    "author": "Vinicius Costa",
    "source": "https://www.traveloffpath.com/delta-will-launch-new-nonstop-flights-to-2-of-europes-trendiest-sunny-destinations/",
    "cover": "assets/img/cover-fallback.jpg",
    "excerpt": "--- title: Delta Will Launch New Nonstop Flights To 2 Of Europe's Trendiest Sunny Destinations author: Vinicius Costa url: https://www.traveloffpath.com/delta-will-launch-new-nonstop-flights-to-2-of-europes-trendiest-sunny-destinations/ hostname: traveloffpath.com description: From May 2026, Delta will be launching new nonstop flights from Boston International Airport to Madrid in Spain and Nice in France. sitename: Travel Off Path date: 2025-09-01 categories: ['Travel', 'Travel News'] tags: ['American travelers', 'boston', 'delta', 'europe', 'european union', 'france', 'madrid', 'Nice', 'South Of France'] --- Planning a European getaway for the coming year, but you've been waiting for new nonstop routes to open from your favorite hub at Boston Logan International? This time, you're in luck, as Delta is adding not one, but two new European destinations to the Massachusetts capital's network from May 16, 2026: Madrid, Spain's capital and its leading city break, and Nice, the trendiest beach spot in the South of France. Here's everything you need to know about the new flights, and what to expect from Delta's summer 2026 strategy: Boston As Delta's New Gateway To Europe Over the last few years, Delta has ramped up Europe-bound service from its Boston (BOS) base like no other, from boosting frequency to cities like London and Barcelona, to starting new flights to in-demand destinations that previously lacked a connection with Massachusetts. When it comes to Madrid, there are in fact nonstop flights from Boston to the Spanish capital already, except they're operated by Spain's own Iberia, and in the high season, they're joined by low-cost JetBlue. Be that as it may, there has never been a full-service, U.S.-based airline operating in this market. As for Nice, this will be the first time Boston-based travelers enjoy a nonstop connection to the Pearl of the French Riviera, without requiring stopovers in Paris. Previously, Delta only offered nonstop service to Nice from Atlanta, New York (JFK), and Philadelphia. Now that Madrid and Nice are in the cards, Delta will serve at least a dozen European destinations from Boston next summer. Madrid flights will be available daily, while Nice ones will initially run on a three-times-weekly schedule, on Tuesdays, Thursdays, and Saturdays. By the way, in the meantime, Barcelona flights will increase to a daily frequency from May 7, and Milan will see four-times-weekly flights from May 16. What To Expect From Delta's New Europe Flights It's no wonder Delta is investing this heavily in Boston, now that Logan International hosts their Delta One Lounge and a revamped, larger Sky Club Space. In short, they're aiming to become the first choice for travelers heading to Europe. Comfort plays a huge part in it, as well. Both Madrid and Nice routes will be run on a brand new Airbus A330-900neo, with a 281-seat configuration. Out of those, 29…",
    "content": "---\ntitle: Delta Will Launch New Nonstop Flights To 2 Of Europe's Trendiest Sunny Destinations\nauthor: Vinicius Costa\nurl: https://www.traveloffpath.com/delta-will-launch-new-nonstop-flights-to-2-of-europes-trendiest-sunny-destinations/\nhostname: traveloffpath.com\ndescription: From May 2026, Delta will be launching new nonstop flights from Boston International Airport to Madrid in Spain and Nice in France.\nsitename: Travel Off Path\ndate: 2025-09-01\ncategories: ['Travel', 'Travel News']\ntags: ['American travelers', 'boston', 'delta', 'europe', 'european union', 'france', 'madrid', 'Nice', 'South Of France']\n---\nPlanning a European getaway for the coming year, but you've been waiting for new nonstop routes to open from your favorite hub at Boston Logan International?\nThis time, you're in luck, as Delta is adding not one, but two new European destinations to the Massachusetts capital's network from May 16, 2026: Madrid, Spain's capital and its leading city break, and Nice, the trendiest beach spot in the South of France.\nHere's everything you need to know about the new flights, and what to expect from Delta's summer 2026 strategy:\nBoston As Delta's New Gateway To Europe\nOver the last few years, Delta has ramped up Europe-bound service from its Boston (BOS) base like no other, from boosting frequency to cities like London and Barcelona, to starting new flights to in-demand destinations that previously lacked a connection with Massachusetts.\nWhen it comes to Madrid, there are in fact nonstop flights from Boston to the Spanish capital already, except they're operated by Spain's own Iberia, and in the high season, they're joined by low-cost JetBlue. Be that as it may, there has never been a full-service, U.S.-based airline operating in this market.\nAs for Nice, this will be the first time Boston-based travelers enjoy a nonstop connection to the Pearl of the French Riviera, without requiring stopovers in Paris. Previously, Delta only offered nonstop service to Nice from Atlanta, New York (JFK), and Philadelphia.\nNow that Madrid and Nice are in the cards, Delta will serve at least a dozen European destinations from Boston next summer. Madrid flights will be available daily, while Nice ones will initially run on a three-times-weekly schedule, on Tuesdays, Thursdays, and Saturdays.\nBy the way, in the meantime, Barcelona flights will increase to a daily frequency from May 7, and Milan will see four-times-weekly flights from May 16.\nWhat To Expect From Delta's New Europe Flights\nIt's no wonder Delta is investing this heavily in Boston, now that Logan International hosts their Delta One Lounge and a revamped, larger Sky Club Space. In short, they're aiming to become the first choice for travelers heading to Europe.\nComfort plays a huge part in it, as well. Both Madrid and Nice routes will be run on a brand new Airbus A330-900neo, with a 281-seat configuration.\nOut of those, 29 are reserved for Delta One (their business class) seats, 28 are for Premium Select (the equivalent to Premium Economy, 56 are Comfort+ seats (these typically offer extra legroom), and finally, 168 seats in the Main Cabin.\nAs far as competition goes, Madrid is a smart move. Seeing that only JetBlue offered Boston–Madrid flights in summer, with their restrictive luggage policies and subpar in-flight services, Delta's addition will lure travelers who aren't exactly keen on budget carriers.\nNice, on the other hand, is a long-overdue inclusion, given the rising demand for the South of France among Americans, and the fact it was missing altogether from Boston's flight map. Better late than never, as they say.\nJointly, the routes will boost Boston's connectivity with Southern Europe and ensure Massachusetts travelers get to these sunny spots without layovers.\nWhy Visit Madrid In 2026\nAs the capital of Spain, Madrid has no shortage of world-class museums, elegant boulevards, and lush parks to discover.\nIt plays host to the Prado Museum, one of the largest in the world, guarding masterpieces by artists such as Goya, El Greco, and Rubens. Nearby, the Royal Palace of Madrid is Europe's largest royal residence, beating London's Buckingham Palace, except that you can visit this one on a guided tour.\nOver at Retiro Park, Madrid's very own ‘Central Park', tourists will find a sprawling green oasis, right in the middle of the bustling city, and when exploring the city's charming Historic Center, it's impossible to miss Plaza Mayor, an iconic square surrounded by arcaded buildings.\nAnd How Nice Is Nice?\nCraving beaches and culture instead? Nice is your best bet at finding both, as Madrid, unlike many other sun-drenched gems in Spain, isn't on the coast.\nNice is a vibrant city straddling France's Mediterranean shoreline, best known for its picture-perfect Vieux-Nice, an Old Town peppered with local-frequented trattorias and bars, and cut through with winding, cobbled lanes, and a lively marina.\nIts long Promenade des Anglais is a boardwalk running along a turquoise stretch of sea, and though the beach there isn't made of the same white sand that makes neighboring Cannes so appealing, the warm waters and townscape views are unbeatable.\nWhether you're flying with Delta to Madrid or Nice next year, you should be prepared for upcoming changes in entry requirements that will affect all Americans traveling to Europe—this includes a new mandatory digital permit you'll need to apply for before traveling.\nLearn more about it here.\nThe Travel Off Path Advantage: Your Travel Toolkit\nThe 1-Minute Trip Check\nOur flagship tool. Solves your entire pre-flight travel planning in a few easy steps. From entry rules to hidden fees and safety.\nU.S. Travel Advisory Checker\nAn easy tool to check all the latest travel advisories from the U.S. State Department.\nEntry Requirements Checker\nAn easy tool to check all the entry requirements for your destination.\nThe Upgrade Newsletter\nUnlock travel tips, hot destination insights, and exclusive flight deals.\nJoin Our Community\nWith over 25,000 members on Facebook!\nSubscribe To Our Latest Posts\nEnter your email address to subscribe to Travel Off Path's latest breaking travel news, straight to your inbox."
  },
  {
    "slug": "5-underrated-u-s-cities-perfect-for-a-weekend-getaway-this-fall",
    "title": "5 Underrated U.S. Cities Perfect For A Weekend Getaway This Fall",
    "category": "Travel",
    "date": "2025-09-01",
    "author": "Travel Off Path",
    "source": "https://www.traveloffpath.com/5-underrated-u-s-cities-perfect-for-a-weekend-getaway-this-fall/",
    "cover": "assets/img/cover-fallback.jpg",
    "excerpt": "--- title: 5 Underrated U.S. Cities Perfect For A Weekend Getaway This Fall author: Travel Off Path url: https://www.traveloffpath.com/5-underrated-u-s-cities-perfect-for-a-weekend-getaway-this-fall/ hostname: traveloffpath.com description: Skip the crowds this fall! 🍂 Discover 5 underrated U.S. cities perfect for a weekend getaway, from charming outdoor hubs to historic and hip towns. sitename: Travel Off Path date: 2025-08-31 categories: ['Travel', 'Travel News'] tags: ['fall travel', 'underrated', 'US cities'] --- The kids are back in school, the long, hazy days of summer are in the rearview mirror, and there’s a new kind of energy in the air. It's that magical time of year when you start thinking about cozy sweaters, crisp autumn air, and that first glorious sip of a pumpkin spice latte. You're holding on to that hope of a perfect weekend fall getaway. Sure, you could book the obvious trip to New York City, but let's be real—you'll be fighting for a patch of grass in Central Park with a million other people. What if you could get all the amazing fall vibes without the crowds? Here at Travel Off Path, we believe the best autumn trips are the ones that fly under the radar. We've found 5 incredible, underrated U.S. cities that are perfect for a quick escape this season. 🍂 ⛰️ Chattanooga, Tennessee The Ultimate Outdoor Adventure Hub While everyone flocks to Nashville or the Smokies, Chattanooga is the smart choice for an active fall weekend. Tucked into the Tennessee River Valley, the city is surrounded by mountains that explode with color in late October. The vibe is laid-back, the hiking is epic, and the views are 10/10. - You Have To: Take the incline railway up Lookout Mountain to visit Rock City and Ruby Falls. The panoramic view of seven states is a classic for a reason. For a more chill experience, walk across the vibrant blue Walnut Street Bridge and explore the cool local shops and cafes in the NorthShore district. 🍖 Kansas City, Missouri The Cool & Cultured Midwest Surprise Forget what you think you know about “flyover country.” Kansas City is having a major moment, and fall is the perfect time to visit. This city is a powerhouse of culture, with world-class jazz clubs, a surprisingly hip arts scene, and, of course, the best barbecue on the planet. - You Have To: Make a pilgrimage to an iconic BBQ joint like Joe's Kansas City (yes, the one in the gas station!) or Arthur Bryant's. Then, spend an afternoon at the incredible (and free!) Nelson-Atkins Museum of Art before checking out the galleries and breweries in the trendy Crossroads Arts District. 🧀 Madison, Wisconsin The Perfect College Town Weekend There’s a special kind of energy in a great college…",
    "content": "---\ntitle: 5 Underrated U.S. Cities Perfect For A Weekend Getaway This Fall\nauthor: Travel Off Path\nurl: https://www.traveloffpath.com/5-underrated-u-s-cities-perfect-for-a-weekend-getaway-this-fall/\nhostname: traveloffpath.com\ndescription: Skip the crowds this fall! 🍂 Discover 5 underrated U.S. cities perfect for a weekend getaway, from charming outdoor hubs to historic and hip towns.\nsitename: Travel Off Path\ndate: 2025-08-31\ncategories: ['Travel', 'Travel News']\ntags: ['fall travel', 'underrated', 'US cities']\n---\nThe kids are back in school, the long, hazy days of summer are in the rearview mirror, and there’s a new kind of energy in the air. It's that magical time of year when you start thinking about cozy sweaters, crisp autumn air, and that first glorious sip of a pumpkin spice latte.\nYou're holding on to that hope of a perfect weekend fall getaway. Sure, you could book the obvious trip to New York City, but let's be real—you'll be fighting for a patch of grass in Central Park with a million other people.\nWhat if you could get all the amazing fall vibes without the crowds? Here at Travel Off Path, we believe the best autumn trips are the ones that fly under the radar. We've found 5 incredible, underrated U.S. cities that are perfect for a quick escape this season. 🍂\n⛰️ Chattanooga, Tennessee\nThe Ultimate Outdoor Adventure Hub\nWhile everyone flocks to Nashville or the Smokies, Chattanooga is the smart choice for an active fall weekend. Tucked into the Tennessee River Valley, the city is surrounded by mountains that explode with color in late October. The vibe is laid-back, the hiking is epic, and the views are 10/10.\n- You Have To: Take the incline railway up Lookout Mountain to visit Rock City and Ruby Falls. The panoramic view of seven states is a classic for a reason. For a more chill experience, walk across the vibrant blue Walnut Street Bridge and explore the cool local shops and cafes in the NorthShore district.\n🍖 Kansas City, Missouri\nThe Cool & Cultured Midwest Surprise\nForget what you think you know about “flyover country.” Kansas City is having a major moment, and fall is the perfect time to visit. This city is a powerhouse of culture, with world-class jazz clubs, a surprisingly hip arts scene, and, of course, the best barbecue on the planet.\n- You Have To: Make a pilgrimage to an iconic BBQ joint like Joe's Kansas City (yes, the one in the gas station!) or Arthur Bryant's. Then, spend an afternoon at the incredible (and free!) Nelson-Atkins Museum of Art before checking out the galleries and breweries in the trendy Crossroads Arts District.\n🧀 Madison, Wisconsin\nThe Perfect College Town Weekend\nThere’s a special kind of energy in a great college town in the fall, and Madison might just be the best of them all. Situated on a narrow strip of land between two sparkling lakes, this city is pure autumn magic. The air is crisp, the university gives the city a vibrant buzz, and the fall colors are spectacular.\n- You Have To: Spend Saturday morning at the Dane County Farmers' Market, one of the biggest and best in the country, which takes over the entire Capitol Square. Then, grab a beer at the iconic Memorial Union Terrace on Lake Mendota for one of the best waterfront fall views you’ll find anywhere.\n🎨 Richmond, Virginia\nWhere History Meets Hip\nAs a less-crowded and more affordable alternative to Washington D.C., Richmond is a fall getaway that punches way above its weight. This city seamlessly blends four centuries of American history with a modern, creative, and seriously cool food and beer scene. The fall foliage along the James River is the cherry on top.\n- You Have To: Go brewery-hopping in Scott's Addition, a former industrial neighborhood that's now home to some of the best craft beer in the state. Then, spend an afternoon exploring the quirky boutiques and amazing restaurants in the famous Carytown neighborhood.\n🔥 Providence, Rhode Island\nThe Charming & Unique Coastal Gem\nThe capital of America's smallest state remains one of the most underrated gems on the East Coast. What it lacks in size, it more than makes up for with its Ivy League charm, stunning architecture, and a one-of-a-kind art scene. The cool temps in the 50s and 60s are perfect for exploring.\n- You Have To: Plan your weekend around WaterFire, a stunning art installation of bonfires blazing just above the surface of the three rivers that run through the city. It’s a completely unique and magical experience, perfect for a crisp autumn night. Afterward, head to Federal Hill for some of the best and most authentic Italian food in the country.\nSo this fall, skip the usual tourist traps and make some memories in a city that feels like a real discovery. Happy travels, and enjoy all the autumn vibes! 🍂\nThe Travel Off Path Advantage: Your Travel Toolkit\nThe 1-Minute Trip Check\nOur flagship tool. Solves your entire pre-flight travel planning in a few easy steps. From entry rules to hidden fees and safety.\nU.S. Travel Advisory Checker\nAn easy tool to check all the latest travel advisories from the U.S. State Department.\nEntry Requirements Checker\nAn easy tool to check all the entry requirements for your destination.\nThe Upgrade Newsletter\nUnlock travel tips, hot destination insights, and exclusive flight deals.\nJoin Our Community\nWith over 25,000 members on Facebook!\nSubscribe To Our Latest Posts\nEnter your email address to subscribe to Travel Off Path's latest breaking travel news, straight to your inbox."
  },
  {
    "slug": "4-important-tips-for-visiting-cancun-this-fall-according-to-experts",
    "title": "4 Important Tips For Visiting Cancun This Fall According To Experts",
    "category": "Travel",
    "date": "2025-09-01",
    "author": "Vinicius Costa",
    "source": "https://www.traveloffpath.com/4-important-tips-for-visiting-cancun-this-fall-according-to-experts/",
    "cover": "assets/img/cover-fallback.jpg",
    "excerpt": "--- title: 4 Important Tips For Visiting Cancun This Fall According To Experts author: Vinicius Costa url: https://www.traveloffpath.com/4-important-tips-for-visiting-cancun-this-fall-according-to-experts/ hostname: traveloffpath.com description: From bigger crowds to limited getaway deals, off-season Cancun is changing at a shockingly fast pace. sitename: Travel Off Path date: 2025-08-31 categories: ['Travel', 'Travel News'] tags: ['cancun', 'Latin America', 'mexican caribbean', 'Mexico', 'quintana roo'] --- Fall is arguably the best period to visit Cancun if you're hoping for smaller crowds and cheaper prices. After all, the July and August crowds are gone, hotels deliberately lower prices to attract more guests, and there are getaway deals galore… or are there? For years now, sun-seekers on a budget have waited impatiently for September to book their Cancun vacay, knowing they would get more bang for their buck, but as the experts have told us in 2025, this may no longer be the case. After all, ‘low' and ‘high' seasons are no longer existing concepts in the Caribbean hub. That's one of 4 things the Cancun Sun, the leading independent English-speaking authority on all things Mayan Riviera, has shared as we head into the (supposedly) quieter months: Cancun's ‘Low Season' Is a Thing of the Past If you're headed for Cancun this upcoming season, the main thing you should know is that those images of a deserted hotel strip, with a wide availability of first-come, first-served restaurants, and open slots on guided tours, may no longer be the case. As they have noted, ‘low season' now looks more like ‘less busy'. There are lower crowds than in winter, that's for sure, but if you're visiting on the weekend, you should expect a major influx of beach bums at public bathing areas, and partygoers to flock into the entertainment district. Long gone are the days you could just ‘chance it' and book stuff last-minute in the fall. Be it trendy restaurants, popular activities, like visiting cenotes or Mayan ruins, or spa appointments at your resort, you'd be wise to secure spots in advance. Who Will You Be Sharing the Resort With? The Cancun Sun also reiterates that, despite the continuous crowding, the type of crowd changes. After all, schools across the United States and Canada have resumed classes, so you can for sure expect to see fewer families with children and adolescents in resorts. This helps contribute to the overall adult-centered, more laid-back feel. That being said, you can never entirely rule out children running around and splashing around in the pool when all you need is some peace and quiet. Your fellow Americans may be gone, but there will be families from other parts of the world that do not operate under the U.S. school schedule. In those cases, it's best…",
    "content": "---\ntitle: 4 Important Tips For Visiting Cancun This Fall According To Experts\nauthor: Vinicius Costa\nurl: https://www.traveloffpath.com/4-important-tips-for-visiting-cancun-this-fall-according-to-experts/\nhostname: traveloffpath.com\ndescription: From bigger crowds to limited getaway deals, off-season Cancun is changing at a shockingly fast pace.\nsitename: Travel Off Path\ndate: 2025-08-31\ncategories: ['Travel', 'Travel News']\ntags: ['cancun', 'Latin America', 'mexican caribbean', 'Mexico', 'quintana roo']\n---\nFall is arguably the best period to visit Cancun if you're hoping for smaller crowds and cheaper prices.\nAfter all, the July and August crowds are gone, hotels deliberately lower prices to attract more guests, and there are getaway deals galore… or are there?\nFor years now, sun-seekers on a budget have waited impatiently for September to book their Cancun vacay, knowing they would get more bang for their buck, but as the experts have told us in 2025, this may no longer be the case.\nAfter all, ‘low' and ‘high' seasons are no longer existing concepts in the Caribbean hub.\nThat's one of 4 things the Cancun Sun, the leading independent English-speaking authority on all things Mayan Riviera, has shared as we head into the (supposedly) quieter months:\nCancun's ‘Low Season' Is a Thing of the Past\nIf you're headed for Cancun this upcoming season, the main thing you should know is that those images of a deserted hotel strip, with a wide availability of first-come, first-served restaurants, and open slots on guided tours, may no longer be the case.\nAs they have noted, ‘low season' now looks more like ‘less busy'. There are lower crowds than in winter, that's for sure, but if you're visiting on the weekend, you should expect a major influx of beach bums at public bathing areas, and partygoers to flock into the entertainment district.\nLong gone are the days you could just ‘chance it' and book stuff last-minute in the fall. Be it trendy restaurants, popular activities, like visiting cenotes or Mayan ruins, or spa appointments at your resort, you'd be wise to secure spots in advance.\nWho Will You Be Sharing the Resort With?\nThe Cancun Sun also reiterates that, despite the continuous crowding, the type of crowd changes.\nAfter all, schools across the United States and Canada have resumed classes, so you can for sure expect to see fewer families with children and adolescents in resorts. This helps contribute to the overall adult-centered, more laid-back feel.\nThat being said, you can never entirely rule out children running around and splashing around in the pool when all you need is some peace and quiet. Your fellow Americans may be gone, but there will be families from other parts of the world that do not operate under the U.S. school schedule.\nIn those cases, it's best to book an adults-only resort. Here are some options, and their average September nightly rate:\n- Le Blanc Spa Resort—$706-a-night\n- Atelier Playa Mujeres—$708-a-night\n- Excellence Playa Mujeres—$622-a-night\n- Live Aqua Beach Resort—$337-a-night\n- Royalton CHIC Cancun—$257-a-night\nDeep Discounts Are Over, But Value Can Be Found\nAs you might have noticed from the averages given above, it's getting increasingly harder to come across those jaw-dropping, great hotel deals in Cancun.\nHistorically, September was notorious for its irresistible rates, usually of 50% off. In the words of the Cancun Sun, this era is now ‘over':\nGranted, there is still better value to be found in the fall compared to the winter period, but the rising demand from Cancun, not only from Americans, but travelers worldwide, has resulted in prices staying at a plateau instead of dropping significantly.\nWhen it comes to tours and private transportation, you might even notice there's no difference at all. Based on the expert advice, the best way to save money is to look for a ‘package deal': there are still plenty of ‘5th Night Free' and flight-and-hotel combos in offer.\nNavigating the Weather: Hurricanes and Sargassum\nLast but not least, we have the weather conditions. There's no way of getting around it: September is peak hurricane season, and you should be prepared for tropical storms.\nThis does not mean you will definitely experience a hurricane visiting Cancun in September, as the probability remains low, but if it does happen, the city is probably one of the best-equipped in the Caribbean to deal with the phenomenon.\nResorts have their own hurricane codes and strict routines to ensure guests stay safe in the (unlikely) event of a seriously-disruptive hurricane, and you can always stay up to date with hurricane announcements through the National Hurricane Center.\nOn the upside, you can count on far less sargassum along the shoreline.\nAll in all, the fall remains an unbeatable period for experiencing Cancun's more ‘chill' side—just make sure you pack a raincoat. You know, just in case it starts pouring heavily precisely during your half-hour stroll outside the resort grounds.\nThe Travel Off Path Advantage: Your Travel Toolkit\nThe 1-Minute Trip Check\nOur flagship tool. Solves your entire pre-flight travel planning in a few easy steps. From entry rules to hidden fees and safety.\nU.S. Travel Advisory Checker\nAn easy tool to check all the latest travel advisories from the U.S. State Department.\nEntry Requirements Checker\nAn easy tool to check all the entry requirements for your destination.\nThe Upgrade Newsletter\nUnlock travel tips, hot destination insights, and exclusive flight deals.\nJoin Our Community\nWith over 25,000 members on Facebook!\nSubscribe To Our Latest Posts\nEnter your email address to subscribe to Travel Off Path's latest breaking travel news, straight to your inbox."
  },
  {
    "slug": "the-himalayan-village-where-you-can-see-the-cosmos",
    "title": "The Himalayan village where you can see the cosmos",
    "category": "Stories",
    "date": "2025-09-01",
    "author": "AventurOO Editorial",
    "source": "https://www.bbc.com/travel/article/20250829-the-himalayan-village-where-you-can-see-the-cosmos?ocid=global_travel_rss",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lzs4pc.jpg",
    "excerpt": "--- title: The Himalayan village where you can see the cosmos author: Vandana K url: https://www.bbc.com/travel/article/20250829-the-himalayan-village-where-you-can-see-the-cosmos hostname: bbc.com description: In the Moon-like landscape of Hanle, the jet-black skies reveal otherworldly starry skies that lure travellers from far and wide. But can locals preserve the natural darkness? sitename: BBC date: 2025-09-01 --- The Himalayan village where you can see the cosmos In the Moon-like landscape of Hanle, the jet-black skies reveal otherworldly starry skies that lure travellers from far and wide. But can locals preserve the natural darkness? I'm walking downhill as evening gives way to night, transfixed by what is unfolding above. As though someone is slowly rolling a screen in a shadow puppet show, an inky blue canvas emerges, where stars pop left and right. Mouth agape, I realise that the hazy band of light stretching above me is the Milky Way. A howl from a dog perched on a rock ledge brings me back to terra firma. I'm on Mount Digpa Ratsa Ri in the village of Hanle, where the Earth and cosmos are in close communion. Situated at 5,290m above sea level in the barren, Moon-like landscape of northern India's Ladakh region, Hanle rates \"one\" (the darkest) on the Bortle dark sky scale, with 270 clear nights a year. Here, locals routinely switch off the lights after sunset to reveal the nightly eye-popping displays of stars. Over the last few years, travellers have been drawn to Hanle not just for the jet-black skies but also for the chance to experience astronomy intimately, guided by locals who are now making the cosmos their livelihood. Since 2022, when the Hanle Dark Sky Reserve (HDSR) was founded here – spanning 1,074 sq km, six villages, a monastery and 10 stationary telescopes – a network of homestays has flourished. Local-led stargazing expeditions unfold on rooftops, courtyards and below the dome-shaped Indian Astronomical Observatory, which houses one of the world's highest optical telescopes. Another stellar event is Hanle's annual Star Party, held each September at the end of the brief four-month window when the village is accessible to outsiders before the harsh winter sets in. The nocturnal festival draws serious stargazers and astrophotographers from across India, who come armed with telescopes and specialised cameras for deep sky observations. Reaching for the stars I've just arrived from Leh, the capital of Ladakh, to explore this remote landscape. The homestay I've chosen is a modest, single-storey concrete structure with shared dorms. My Tibetan-Ladakhi hosts welcome me with tingmo, a steamed bread with dal and thupka, a soup of hand-pulled noodles. Plan your trip When to go: June-September, ideally around the new Moon to see the Milky Way. The annual Star Party takes place in…",
    "content": "---\ntitle: The Himalayan village where you can see the cosmos\nauthor: Vandana K\nurl: https://www.bbc.com/travel/article/20250829-the-himalayan-village-where-you-can-see-the-cosmos\nhostname: bbc.com\ndescription: In the Moon-like landscape of Hanle, the jet-black skies reveal otherworldly starry skies that lure travellers from far and wide. But can locals preserve the natural darkness?\nsitename: BBC\ndate: 2025-09-01\n---\nThe Himalayan village where you can see the cosmos\nIn the Moon-like landscape of Hanle, the jet-black skies reveal otherworldly starry skies that lure travellers from far and wide. But can locals preserve the natural darkness?\nI'm walking downhill as evening gives way to night, transfixed by what is unfolding above. As though someone is slowly rolling a screen in a shadow puppet show, an inky blue canvas emerges, where stars pop left and right. Mouth agape, I realise that the hazy band of light stretching above me is the Milky Way.\nA howl from a dog perched on a rock ledge brings me back to terra firma. I'm on Mount Digpa Ratsa Ri in the village of Hanle, where the Earth and cosmos are in close communion. Situated at 5,290m above sea level in the barren, Moon-like landscape of northern India's Ladakh region, Hanle rates \"one\" (the darkest) on the Bortle dark sky scale, with 270 clear nights a year. Here, locals routinely switch off the lights after sunset to reveal the nightly eye-popping displays of stars.\nOver the last few years, travellers have been drawn to Hanle not just for the jet-black skies but also for the chance to experience astronomy intimately, guided by locals who are now making the cosmos their livelihood. Since 2022, when the Hanle Dark Sky Reserve (HDSR) was founded here – spanning 1,074 sq km, six villages, a monastery and 10 stationary telescopes – a network of homestays has flourished. Local-led stargazing expeditions unfold on rooftops, courtyards and below the dome-shaped Indian Astronomical Observatory, which houses one of the world's highest optical telescopes.\nAnother stellar event is Hanle's annual Star Party, held each September at the end of the brief four-month window when the village is accessible to outsiders before the harsh winter sets in. The nocturnal festival draws serious stargazers and astrophotographers from across India, who come armed with telescopes and specialised cameras for deep sky observations.\nReaching for the stars\nI've just arrived from Leh, the capital of Ladakh, to explore this remote landscape. The homestay I've chosen is a modest, single-storey concrete structure with shared dorms. My Tibetan-Ladakhi hosts welcome me with tingmo, a steamed bread with dal and thupka, a soup of hand-pulled noodles.\nPlan your trip\nWhen to go: June-September, ideally around the new Moon to see the Milky Way. The annual Star Party takes place in September.\nGetting there: Fly Delhi to Leh, then rest 48 hours to acclimatise. Take a bus (Wednesday/Saturday) or shared taxi to Hanle. Apply for permits in advance (required for all visitors).\nStay: Book homestays well ahead. Try Hanle Lodge for private rooms or budget-friendly Pole Star.\nDo: Join a stargazing session with a trained astro guide, visit Hanle monastery and hike to the observatory on Mount Digpa Ratsa Ri.\nEat: Eat Ladakhi food or Indian meals at your homestay; there are barely any restaurants or grocery stores in the village.\nThere's little to do in Hanle while the Sun is shining, so I hitch a ride to Hanle's white-walled Buddhist monastery, perched above the valley. I look down onto the green and rusty hues of the meadows criss-crossed by glinting streams and encircled by brown, wrinkled mountains.\nThis pastureland wasn't always home to telescopes and stargazers. Prior to 1992 – when scientists from the Indian Institute of Astrophysics (IIA) identified Hanle's conditions as ideal for astronomy – only a handful of Changpa nomadic families lived in the area. But when the Indian Astronomical Observatory was built and astrotourism developed – bolstered by the installation of the Himalayan Chandra Telescope in 2000, followed by MACE, the world's second-largest gamma ray telescope at the IIA campus – most of the nomads settled here permanently and created a tiny yet tight knit community, explained Dorje Angchuk, the observatory's engineer-in-charge.\nSoon, growing tourism from stargazers, wildlife enthusiasts and visitors to the nearby Umling La pass brought light pollution to Hanle. To restore the darkness of the night, IIA consulted with villagers, tapping dark sky reserves in the Canary Islands and Hawai'i for inspiration, and eventually founding HDSR with a focus on reducing light pollution and promoting astrotourism. Local guides received training on stars, constellations and guiding visitors.\nShruti Sharma, a marketing professional from Jodhpur, recounted her 2017 visit to Hanle on a motorbike trip through Ladakh. \"The houses had switched off their lights, everyone had their equipment out, and there was excitement in the air,\" she told me. \"When I saw the Milky Way with my naked eye, I thought, 'what is this magic?'\"\nStargazing into the pitch-black night\nLate one night, I find myself in astro guide Kesang Dorjey's front yard for a stargazing session with a handful of other young travellers from other parts of India, who have stopped in Hanle for a night to see its spectacular cosmic tapestry. Dorjey tries to get our attention as we line up behind the telescope. With a red laser pointer, he traces the Andromeda Galaxy and Saturn's rings.\n\"The old nomads say the more time you spend in darkness, the better you can see by learning to use starlight,\" he said. Before electricity, the Changpa herders used the pole star to guide them down mountainsides at night.\nThe villagers, who practice Tibetan Buddhism, make offerings during nyi 'dzin and zla 'dzin, the solar and lunar eclipse, which are considered auspicious. Celestial bodies are also a part of local folk music; when a bride departs her home at dawn after a marriage ceremony, a song called Namlangs say karchen is sung which mentions Venus rising, explained Dorjey.\nThese Changpa traditions now sit alongside modern astrotourism, like IIA's Star Party – about to enter its third year. It's the opening night of the event and I have gathered on the grounds of the IIA campus with amateur astronomers and astrophotographers from all over India, who are eager to tick off their stargazing bucket list and take long-exposure photos of outer space. As darkness falls, only red LED flashlights are visible, used by astronomers to preserve night vision. Astrophotographer Dhruv Patel from Ahmedabad arrived with his initially reluctant mother Kiran, who remarked: \"Even when I close my eyes, I can see stars and only stars. I feel like lying on the ground to keep watching them.\"\nThe increase in tourism in the three years since HDSR's creation has brought higher income but also concerns. \"I feel a growing tension about how we will preserve Hanle with the increasing number of tourists,\" said Dorjey. On a June night last year, more than 100 people gathered outside his house to see the stars, which meant he had to work until 02:30. Last summer, homestay owners turned away tourists due to limited capacity.\nMore like this:\n• Why the mighty Himalayas are getting harder and harder to see\n• The last places on Earth to see truly dark starry nights\n• Could a star-bathing retreat help calm your frazzled mind?\nTo protect the darkness, villagers switch off lights at dusk and there is no power supply after 23:00. Many locals have also installed blackout curtains, lampshades and warm bulbs. IIA is also establishing practical measures like road delineators to keep vehicles on designated paths and plans to decentralise astrotourism across Ladakh.\n\"It is just like any viral story,\" said Angchuk. \"After the sudden excitement around Hanle subsides, the number of tourists will stabilise and only serious stargazers will visit.\"\nOn my last morning, I rise before dawn to find the sky still shimmering with stars. I take in Hanle's precious dark skies one last time before catching my ride back to Leh, hoping this otherworldly village can balance sharing its celestial wonders with preserving them.\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram."
  },
  {
    "slug": "the-chaotic-mega-market-feeding-mexico-city",
    "title": "The chaotic mega-market feeding Mexico City",
    "category": "Stories",
    "date": "2025-09-01",
    "author": "AventurOO Editorial",
    "source": "https://www.bbc.com/travel/article/20250829-the-market-that-feeds-mexico-citys-best-restaurants?ocid=global_travel_rss",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lzqm6f.jpg",
    "excerpt": "--- title: From trash to tasting menu: The market that feeds Mexico City's best restaurants author: La Carmina url: https://www.bbc.com/travel/article/20250829-the-market-that-feeds-mexico-citys-best-restaurants hostname: bbc.com description: How Central de Abasto, the world's largest market hidden in Mexico City's so-called \"trash district\", has become the unlikely backbone of its fine-dining revolution. sitename: BBC date: 2025-08-30 --- From trash to tasting menu: The market that feeds Mexico City's best restaurants How Central de Abasto, the world's largest market hidden in Mexico City's so-called \"trash district\", has become the unlikely backbone of its fine-dining revolution. Mexico City's status as one of the world's top culinary capitals is often credited to the creative tasting menus and celebrity chef collaborations found in its upscale Roma Norte neighbourhood. But the flavours served on those affluent, tree-lined streets often begin their journey to the plate at dawn – in a sprawling, chaotic market in one of the city's poorest boroughs. Located in Iztapalapa, Central de Abasto is the largest wholesale market in the world, covering 3.27 sq km – roughly the size of New York City's Central Park – and supplying 80% of the capital's produce. Between 04:00 and 08:00, the sprawl feels like a scene from Blade Runner, with buyers elbowing their way through narrow paths to haggle at thousands of warehouses and slapdash produce stalls. Diableros (hand-truck porters) sprint through the maze of crowds and beeping trucks, careful not to bump into colleagues balancing wooden crates on their heads. Whenever I hear a trilling whistle, I jump aside to let a \"little devil\" race past with a comically overloaded bundle. Central de Abasto opened in 1982 to replace La Merced, CDMX's colonial-era trading centre. Every day, it welcomes half a million visitors and handles more than 30,000 tons of produce from across Mexico. The ramshackle vibe is characteristic of Iztapalapa, historically derided as a \"trash district\" for its landfills and prisons. Today, 43% of its two million residents live in moderate to extreme poverty, making it one of the capital's poorest boroughs. Yet Central's pivotal role in feeding the capital's world-class restaurants is shifting perceptions. Although home shoppers also visit, Central's focus is on large-scale buying – with supersized displays to match. I gawk at a wall of watermelons piled higher than my head and a giant stacks of carrots. I smell the garlic shop before I see it: it has boxes of bulbs stacked to the ceiling, braids dangling from the rafters. Then, I follow my nose to a vendor hawking juicy tacos campechanos (grilled beef and sausage with cactus, potatoes and pico de gallo). The sheer variety of the mercado's selection reflects Mexico's multitudes of microclimates, and vendors come from all over the region to sell…",
    "content": "---\ntitle: From trash to tasting menu: The market that feeds Mexico City's best restaurants\nauthor: La Carmina\nurl: https://www.bbc.com/travel/article/20250829-the-market-that-feeds-mexico-citys-best-restaurants\nhostname: bbc.com\ndescription: How Central de Abasto, the world's largest market hidden in Mexico City's so-called \"trash district\", has become the unlikely backbone of its fine-dining revolution.\nsitename: BBC\ndate: 2025-08-30\n---\nFrom trash to tasting menu: The market that feeds Mexico City's best restaurants\nHow Central de Abasto, the world's largest market hidden in Mexico City's so-called \"trash district\", has become the unlikely backbone of its fine-dining revolution.\nMexico City's status as one of the world's top culinary capitals is often credited to the creative tasting menus and celebrity chef collaborations found in its upscale Roma Norte neighbourhood. But the flavours served on those affluent, tree-lined streets often begin their journey to the plate at dawn – in a sprawling, chaotic market in one of the city's poorest boroughs.\nLocated in Iztapalapa, Central de Abasto is the largest wholesale market in the world, covering 3.27 sq km – roughly the size of New York City's Central Park – and supplying 80% of the capital's produce. Between 04:00 and 08:00, the sprawl feels like a scene from Blade Runner, with buyers elbowing their way through narrow paths to haggle at thousands of warehouses and slapdash produce stalls. Diableros (hand-truck porters) sprint through the maze of crowds and beeping trucks, careful not to bump into colleagues balancing wooden crates on their heads. Whenever I hear a trilling whistle, I jump aside to let a \"little devil\" race past with a comically overloaded bundle.\nCentral de Abasto opened in 1982 to replace La Merced, CDMX's colonial-era trading centre. Every day, it welcomes half a million visitors and handles more than 30,000 tons of produce from across Mexico. The ramshackle vibe is characteristic of Iztapalapa, historically derided as a \"trash district\" for its landfills and prisons. Today, 43% of its two million residents live in moderate to extreme poverty, making it one of the capital's poorest boroughs. Yet Central's pivotal role in feeding the capital's world-class restaurants is shifting perceptions.\nAlthough home shoppers also visit, Central's focus is on large-scale buying – with supersized displays to match. I gawk at a wall of watermelons piled higher than my head and a giant stacks of carrots. I smell the garlic shop before I see it: it has boxes of bulbs stacked to the ceiling, braids dangling from the rafters. Then, I follow my nose to a vendor hawking juicy tacos campechanos (grilled beef and sausage with cactus, potatoes and pico de gallo). The sheer variety of the mercado's selection reflects Mexico's multitudes of microclimates, and vendors come from all over the region to sell uniquely Mexican produce.\nChefs have long bought staples at Central de Abasto, but over the past 10 to 15 years a new wave of fine-dining pioneers began coming not just for bulk produce, but for rarer, organic and indigenous ingredients. Farmers like Alfredo Cruz Camacho illustrate the shift. At one of the market's many long tables, he proudly displays candy cane beetroot with red and white inner rings and glossy baby heirloom tomatoes. His specialty crops caught the attention of Michelin-starred chefs browsing the stalls, including Israel Montero of Siembra Comedor. \"He invited me to his restaurant in [the upscale neighbourhood of] Polanco, an area unknown to me as I only lived off the chinampas in Tláhuac [floating farms pioneered by the Aztecs],\" Camacho recalls.\nSoon, five-star restaurants were asking Camacho to grow microgreens he'd never heard of, like shungiku and sorrel. \"Chefs are always looking for ingredients that make a dish unique, like a distinctive stamp on a canvas,\" he says. \"That's what I provide to help them finish their masterpieces.\"\nWorld's Table\nBBC.com's World's Table \"smashes the kitchen ceiling\" by changing the way the world thinks about food, through the past, present and future.\nAs I drive 45 minutes northwest to Roma Norte, Iztapalapa's concrete grit gives way to elegant Art Nouveau architecture and tree-lined avenues buzzing with hipster cafés and bars. In this upscale area, tasting menus start at 2,000 pesos (£80) – quite the jump from my 50-peso (£2) market tacos.\nI exchange my trainers for heels to dine at Michelin-recognised Lorea, set in a tranquil, industrial-chic multilevel space. Most chefs send their staff to stock the kitchen, but Lorea's Oswaldo Oliva wakes up at dawn to do it himself.\n\"It's my favourite part of the week,\" he tells me. \"Standing in front of the market stalls, watching the hustle and bustle, smelling the fresh produce, chatting with the vendors – it's like an adrenaline shot every time.\"\nOliva arrives at 06:00 and browses for two hours. \"How I decide what to buy? Honestly, it's intuition,\" he muses. \"When I see the produce, a mental roadmap just appears in my head.\"\nHow to visit Central de Abasto\n• Open Monday to Saturday. Arrive between 08:00 and 12:00 to avoid the dawn rush but still have access to plenty of produce.\n• If taking a rideshare or taxi, there is a 10 pesos entrance fee per car. Ask your driver to wait as there may be no mobile service or WiFi at the market.\n• By public transport, take metro line 8 to Aculco station then an M1 bus to Central de Abasto.\n• Wear sun protection and walking shoes that can get dirty, and bring pesos for purchases.\n• The market is safe for tourists but it's best to leave behind expensive items. Visitors can book a guided tour for $95 (£70).\nThe spoon-shaped green purslane that caught my eye at the market also got Oliva's attention, appearing on his menu as smoky stems atop a tamal floating on shrimp bisque. He also found fresh huitlacoche (blue-grey corn fungus), which became a bonus course on a handmade charred tortilla.\nThe next evening, I step into a 19th-Century mansion with a spiral staircase and oval cut-out windows straight out of a Tim Burton movie. Paula Campos manages World's 50 Best-ranked cocktail bar Rayo on the top floor and oversees the produce at Fónico, the upscale Mexican restaurant downstairs.\n\"Over the years, Central de Abasto has become more dynamic,\" Campos tells me. \"There's a stronger presence of organic and small-scale regional farmers bringing rarer items [as well as] a growing number of high-end buyers.\" Cultivating close relationships with vendors gets her first dibs on seasonal treasures. \"For example, they might reserve a small batch of finger limes or wild herbs before they're gone,\" she says, which level up Rayo's indigenous-influenced craft cocktails.\nAs I eat my way around Roma Norte, I increasingly spot connections between the seemingly disparate worlds of market labourers and luxury diners. Baby corn has just come into season and I see the trending vegetable on several tasting menus. Maíz Tinto chars the kernels with truffled mayo and meco chilli; while Barolo gives them an Italian twist with a dab of Taleggio cheese and a dust of grasshopper powder.\nThe unlikely relationship between a gastronomic hub and a working-class district has grown stronger thanks to a visionary government social project. Since 2019, CDMX has established 15 \"Utopias\" or community centres, in Iztapalapa. Beatriz Cervantes, coordinator of Utopia Meyehualco, beams as she shows me around brightly painted public spaces that offer free music and recreational classes, health consultations and other services that support vulnerable locals, including workers at Central.\nSix Utopias have Wellbeing Dining Halls, which run from Tuesday to Saturday and serve about 160 daily takeaway meals for a nominal fee of 11 pesos (£0.40) each. In line with its recent commitment to reducing waste, \"Central de Abasto makes donations of supplies, especially food that is left over but still usable for cooking,\" Cervantes tells me. \"Menus are based on a meal plan generated weekly in coordination with the cooks and a nutritionist. They consist of rice, beans, lentils or soup and a main dish [that changes daily].\"\nMore like this:\n• The hidden wonders of Mexico's sacred underwater world\n• Islas Marías: A notorious prison island turned natural paradise\n• A Oaxacan chef's guide to the best of Oaxaca City's street food\nThe collaboration has been a success, whittling down the piles of organic refuse at the market while giving families access to nutritious, high-quality food. Utopias are also powered by renewable energy generated from more 30,000 solar panels on the market's rooftops, forming the largest solar farm in the world and further instilling pride in the community.\nFew tourists visit Central de Abasto, despite being welcome – yet almost every CDMX diner indirectly experiences a connection to it. As Olivo puts it, \"[They are] two sides of the same coin. Our Mexican identity is reflected in the food we serve, and that is directly linked to where we buy our ingredients.\"\nCamacho echoes the sentiment, calling his clients \"brave alchemist warriors\" for opening his eyes to rare herbs and encouraging him to experiment with crops. This market-to-table culture of mutual admiration and resourcefulness is what makes Mexico City one of the world's finest food destinations.\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram."
  },
  {
    "slug": "where-americans-are-spending-labor-day-weekend",
    "title": "Where Americans are spending Labor Day Weekend",
    "category": "Stories",
    "date": "2025-09-01",
    "author": "AventurOO Editorial",
    "source": "https://www.bbc.com/travel/article/20250828-where-americans-are-spending-labor-day-weekend?ocid=global_travel_rss",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lznqcf.jpg",
    "excerpt": "--- title: The last hurrah: Where American travellers are spending Labor Day weekend author: Lynn Brown url: https://www.bbc.com/travel/article/20250828-where-americans-are-spending-labor-day-weekend hostname: bbc.com description: Seeing Shakespeare in New York, Bright Eyes in Seattle and Roald Dahl's Enormous Crocodile in London – these five destinations are topping lists for the last holiday of summer. sitename: BBC date: 2025-08-29 --- The last hurrah: Where American travellers are spending Labor Day weekend Seeing Shakespeare in New York, Bright Eyes in Seattle and Roald Dahl's Enormous Crocodile in London – these five destinations are topping lists for the last holiday of summer. For many Americans, Labor Day marks the unofficial end of summer; a long weekend for parades, barbecues and one last getaway before the school year begins. According to the American Automobile Association (AAA), the Transportation Security Administration expects 17.4 million people to travel between 28 August and 3 September, up from 17.2 million last year. Data from travel sites including AAA, Dollar Flight Club and Kayak show that domestic travel is up significantly, likely due to the fact that domestic flights are the cheapest they've been in five years. \"This Labor Day we're seeing one of the biggest splits in pricing we've ever tracked,\" says Jesse Neugarten, founder and CEO of Dollar Flight Club. \"Domestic flights are about 5% lower than last year and nearly 20% lower than 2019. On the flip side, international fares are still sky-high.\" According to Neugarten, international fares are two to three times higher on average, while domestic Labor Day fares are currently at a five-year low, with New York, Seattle and Boston being some of the most affordable US destinations overall. Even so, Americans aren't just staying close to home. There are several international destinations showing up on Labor Day travel hot lists, with Rome and London ranking among the most affordable this year, according to Dollar Flight Club. \"Labor Day caps off summer travel and provides one final holiday weekend before the fall routine begins,\" Stacey Barber, Vice President of AAA Travel, said in a statement. Here are the five top destinations Americans are choosing for their last hurrah of summer 2025. New York City, New York The Big Apple remains one of the busiest Labor Day hubs, with Kayak noting it as one of the most popular destinations this time of year. That's no surprise as the US Open continues this weekend, and the West Indian Parade thunders through Brooklyn on 1 September. At an average $263 flight cost – down 2% from last year – it's also a relative bargain. Beyond the parade, the free Shakespeare in the Park festival is back this summer after a renovation hiatus, with a starry lineup including Sandra Oh, Peter…",
    "content": "---\ntitle: The last hurrah: Where American travellers are spending Labor Day weekend\nauthor: Lynn Brown\nurl: https://www.bbc.com/travel/article/20250828-where-americans-are-spending-labor-day-weekend\nhostname: bbc.com\ndescription: Seeing Shakespeare in New York, Bright Eyes in Seattle and Roald Dahl's Enormous Crocodile in London – these five destinations are topping lists for the last holiday of summer.\nsitename: BBC\ndate: 2025-08-29\n---\nThe last hurrah: Where American travellers are spending Labor Day weekend\nSeeing Shakespeare in New York, Bright Eyes in Seattle and Roald Dahl's Enormous Crocodile in London – these five destinations are topping lists for the last holiday of summer.\nFor many Americans, Labor Day marks the unofficial end of summer; a long weekend for parades, barbecues and one last getaway before the school year begins. According to the American Automobile Association (AAA), the Transportation Security Administration expects 17.4 million people to travel between 28 August and 3 September, up from 17.2 million last year. Data from travel sites including AAA, Dollar Flight Club and Kayak show that domestic travel is up significantly, likely due to the fact that domestic flights are the cheapest they've been in five years.\n\"This Labor Day we're seeing one of the biggest splits in pricing we've ever tracked,\" says Jesse Neugarten, founder and CEO of Dollar Flight Club. \"Domestic flights are about 5% lower than last year and nearly 20% lower than 2019. On the flip side, international fares are still sky-high.\"\nAccording to Neugarten, international fares are two to three times higher on average, while domestic Labor Day fares are currently at a five-year low, with New York, Seattle and Boston being some of the most affordable US destinations overall.\nEven so, Americans aren't just staying close to home. There are several international destinations showing up on Labor Day travel hot lists, with Rome and London ranking among the most affordable this year, according to Dollar Flight Club.\n\"Labor Day caps off summer travel and provides one final holiday weekend before the fall routine begins,\" Stacey Barber, Vice President of AAA Travel, said in a statement.\nHere are the five top destinations Americans are choosing for their last hurrah of summer 2025.\nNew York City, New York\nThe Big Apple remains one of the busiest Labor Day hubs, with Kayak noting it as one of the most popular destinations this time of year. That's no surprise as the US Open continues this weekend, and the West Indian Parade thunders through Brooklyn on 1 September. At an average $263 flight cost – down 2% from last year – it's also a relative bargain. Beyond the parade, the free Shakespeare in the Park festival is back this summer after a renovation hiatus, with a starry lineup including Sandra Oh, Peter Dinklage and Lupita Nyong'o.\nSeattle, Washington\nSeattle is a top choice for music lovers this Labor Day weekend, and the top domestic choice overall according to AAA. This year's edition of the Kitsap Blues Music Festival brings artists including Christone \"Kingfish\" Ingram and Eric Gales; while Bumbershoot, Seattle's largest music and arts festival, features Bright Eyes, Janelle Monáe and Tank and the Bangas. Expect a citywide celebration of art, music, food and culture.\nBoston, Massachusetts\nBoston shows up on all three lists as one of the most popular and affordable destinations this Labor Day, and as of 28 August it's reachable by what Amtrak is calling its \"fastest passenger train in the US\", the NextGen Acela, which reaches 160mph and connects Boston to New York, Washington DC and various points between. On 1 September, the city is also hosting its first Labor Day parade which will see marchers organised by the Greater Boston Labor Council stroll from the State House to City Hall Plaza. The Lawn on D, an open-air community space, will have a family-friendly celebration with lawn games and live music all weekend. Baseball lovers should catch a game at the legendary Fenway Park, where the Chicago Cubs will face the Pittsburgh Pirates this weekend.\nLondon, UK\nFor those still dreaming of heading overseas, London is among the most affordable international destinations for Americans, with flights averaging $687, down 5% from last year.\nMore like this:\n• Three experts tips for taking a last-minute break for less\n• Is this the end of the breakfast buffet?\n• The rise of ultra-sport holidays\nOnce there, visitors can take in Brigadoon and Roald Dahl's The Enormous Crocodile at Regent's Park Open Air Theatre, or tour Buckingham Palace before its magnificent State Rooms close to the public on 28 September. This year is also the 200th anniversary of the modern railway, and the London Transport Museum is offering a series of family-friendly activities and workshops to highlight the milestone.\nRome, Italy\nDespite summer heat – and recent overtourism protests – Rome remains high on Americans' bucket lists. Bookings to the Italian capital are up this year, with more than 30 million visitors, including many Americans, flocking to the city for the Catholic Jubilee. Labor Day travellers can enjoy music, theatre and cultural exhibitions at the Estate Romana festival, which takes place on the weekends from 15 June until 15 October; or catch a concert at the Roma Summer Fest, a citywide music festival that runs into September.\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram."
  },
  {
    "slug": "france-s-picture-perfect-car-free-islands",
    "title": "France's picture-perfect car-free islands",
    "category": "Stories",
    "date": "2025-09-01",
    "author": "AventurOO Editorial",
    "source": "https://www.bbc.com/travel/article/20250827-the-french-rivieras-picture-perfect-car-free-island-escape?ocid=global_travel_rss",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lz9p7m.jpg",
    "excerpt": "--- title: The French Riviera's picture-perfect car-free island escape author: Erin Henk url: https://www.bbc.com/travel/article/20250827-the-french-rivieras-picture-perfect-car-free-island-escape hostname: bbc.com description: The Hyères Islands offer an idyllic escape into protected pine forests, unspoilt beaches – and one of France's most unique communities. sitename: BBC date: 2025-08-28 --- The French Riviera's picture-perfect car-free island escape A brief ferry ride from the glitz of the French Riviera, the Hyères Islands offer an idyllic escape into protected pine forests, unspoilt beaches – and one of France's most unique communities. The ferry ride from the Giens Peninsula takes just about 15 minutes, but when my feet touch the vehicle-free streets of Porquerolles, the French Riviera's glittering mainland already feels worlds away. Porquerolles is one of the three Hyères Islands (Îles d'Hyères), an archipelago stretching eastward from Giens like an ellipsis in the Mediterranean Sea. While the French Rivera lures visitors with its glamorous resorts and timeless elegance, it's often overrun by traffic and showy crowds. These islands, covered in pine forests and blissfully car-free, offer an unassuming alternative to the glitz of Cannes and Saint-Tropez. Stepping off the ferry, the cacophony of cicadas floods my ears. I'm well-accustomed to this soundtrack of southern France, but I've never heard them at such a pitch – here, no motors cut their hum. The harbour is fringed with pines, palm trees and sunset-coloured houses. Cyclists whirl by, dismounting to stroll down the main thoroughfare, where everyone seems to have an ice cream in hand. Having sat in traffic for hours to enter Saint-Tropez and shoulder-bumped strangers along the crowded lanes of Èze, I've yearned to find an unspoilt corner of the French Rivera – one with thyme-scented breezes and luminous beaches. The Hyères Islands just might be it. Three islands, three rhythms Also called the Golden Islands (Îles d'Or) for their sun-shimmering schist bedrock, the Hyères Islands have been inhabited by monks, pirates and Napoleon's military over their 2,400-year history. Since 1963, they've formed part of Port-Cros National Park, with strict protections: no camping or loud noise and a near-total ban on smoking due to wildfire risk. Each isle has a its own vibe: cyclists' paradise Porquerolles; outdoorsy Port-Cros; and free-spirited Levant, home to France's best-known nudist community. Plan your visit: When to go: April-October Get there: Ferries run year-round to the Hyères Islands from the Giens Peninsula. Boats to Porquerolles (15-20 minutes) leave from Tour Fondue; to Port-Cros and Levant (45-60 mins) from Port d'Hyéres. There are also ferries between Port-Cros and Levant, but no routes between Porquerolles and the other islands Stay: Porquerolles has the widest choice of hotels; Port-Cros has limited options (bring provisions); Levant has a handful of guesthouses. On Porquerolles I am eager to explore its…",
    "content": "---\ntitle: The French Riviera's picture-perfect car-free island escape\nauthor: Erin Henk\nurl: https://www.bbc.com/travel/article/20250827-the-french-rivieras-picture-perfect-car-free-island-escape\nhostname: bbc.com\ndescription: The Hyères Islands offer an idyllic escape into protected pine forests, unspoilt beaches – and one of France's most unique communities.\nsitename: BBC\ndate: 2025-08-28\n---\nThe French Riviera's picture-perfect car-free island escape\nA brief ferry ride from the glitz of the French Riviera, the Hyères Islands offer an idyllic escape into protected pine forests, unspoilt beaches – and one of France's most unique communities.\nThe ferry ride from the Giens Peninsula takes just about 15 minutes, but when my feet touch the vehicle-free streets of Porquerolles, the French Riviera's glittering mainland already feels worlds away.\nPorquerolles is one of the three Hyères Islands (Îles d'Hyères), an archipelago stretching eastward from Giens like an ellipsis in the Mediterranean Sea. While the French Rivera lures visitors with its glamorous resorts and timeless elegance, it's often overrun by traffic and showy crowds. These islands, covered in pine forests and blissfully car-free, offer an unassuming alternative to the glitz of Cannes and Saint-Tropez.\nStepping off the ferry, the cacophony of cicadas floods my ears. I'm well-accustomed to this soundtrack of southern France, but I've never heard them at such a pitch – here, no motors cut their hum. The harbour is fringed with pines, palm trees and sunset-coloured houses. Cyclists whirl by, dismounting to stroll down the main thoroughfare, where everyone seems to have an ice cream in hand.\nHaving sat in traffic for hours to enter Saint-Tropez and shoulder-bumped strangers along the crowded lanes of Èze, I've yearned to find an unspoilt corner of the French Rivera – one with thyme-scented breezes and luminous beaches. The Hyères Islands just might be it.\nThree islands, three rhythms\nAlso called the Golden Islands (Îles d'Or) for their sun-shimmering schist bedrock, the Hyères Islands have been inhabited by monks, pirates and Napoleon's military over their 2,400-year history. Since 1963, they've formed part of Port-Cros National Park, with strict protections: no camping or loud noise and a near-total ban on smoking due to wildfire risk.\nEach isle has a its own vibe: cyclists' paradise Porquerolles; outdoorsy Port-Cros; and free-spirited Levant, home to France's best-known nudist community.\nPlan your visit:\nWhen to go: April-October\nGet there: Ferries run year-round to the Hyères Islands from the Giens Peninsula. Boats to Porquerolles (15-20 minutes) leave from Tour Fondue; to Port-Cros and Levant (45-60 mins) from Port d'Hyéres. There are also ferries between Port-Cros and Levant, but no routes between Porquerolles and the other islands\nStay: Porquerolles has the widest choice of hotels; Port-Cros has limited options (bring provisions); Levant has a handful of guesthouses.\nOn Porquerolles I am eager to explore its 51km of bike paths. Cars were banned in 1985, and while the island is completely pedestrian-friendly, cycling is the classic way to experience the forests, beaches and the island's sole village, which hums with restaurants and shops.\nI hire a mountain bike from Velos a Porquerolles and set off along shaded pine-scented paths. At the crescent-shaped Notre Dame Beach – one of several white-sand beaches along Porquerolles' north coast – people snorkel and lounge. The beach is ringed with oak and Aleppo pines, some of which stretch out over the transparent water as if tempted to jump in.\n\"There's a different spirit than on the coast,\" says Laura Barbier, who owns specialty grocery Chez Laura in the village. \"There is no traffic, no cars. It's amazing. The slow life.\"\nEmbracing this slow life includes outdoor wine tasting. In 1912, mining mogul François-Joseph Fournier planted 180 grapevines after giving Porquerolles as a wedding present to his wife; today, some of these historic vines are used to make the celebrated rosé wines of Domaine La Courtade at Villa Carmignac. Sommelier Caroline Aubry explains to me how the island's micro-climate, schist and mistral winds, which \"clean\" grapes of destructive bacteria, are ideal for production.\nAt the villa's sprawling sculpture garden, I walk past wind-whipped lavender bushes, through green and golden land that seems to roll into the sea before cycling to the 16th-Century Fort Saint-Agathe for sweeping harbour views.\nPorquerolles has not escaped overtourism and social media's influence, however, which Barbier says has ruined undiscovered places. \"There used to be little corners where only we went, but now everyone knows about them,\" she says.\nIndeed, after the number of visitors to Porquerolles became too great in high season (reaching above 12,000 in a single day) measures were put in place in 2021 to cap visitors.\n\"We are working on both limiting visitor numbers and managing visitor flows in order to preserve the island,\" says Virginie Fernandez, manager of Port-Cros National Park Visitors Centre. This includes capping visitors at 6,000 per day, promoting Porquerolles' lesser-known attractions and educating tourism industry professionals and businesses about how to pass good practices on to their clients. \"It's important to sensitise the public so they know how to respect such richly biodiverse areas,\" she says.\nDeeper into the wild\nIf Porquerolles still feels too busy, Port-Cros and Levant are the antidote.\nA 45-minute ferry from Giens, Port-Cros's only sign of habitation is its port village; a blip of houses and restaurants that are overlooked by the 16th-Century Fort du Moulin, one of five forts on this craggy island. I cross the village in minutes, responding to strangers' bonjours as I pass.\nBut what Port-Cros lacks in human trappings, it makes up for in wild beauty. Unlike Porquerolles, there are no bicycles as this hilly and densely forested island cannot accommodate them. Instead, 30km of hiking trails with striking views of the cobalt blue Mediterranean run through the island. One even goes underwater; starting near the shore of La Palud Beach (Plage du Palud), snorkellers can follow six underwater markers that explain the rich marine life, including 500 species of algae, a Neptune grass meadow and a wild array of colourful fish species.\nIn early morning, I walk cliffside under arching pines and olive trees. Rugged South Beach (Plage du Sud), framed by rocks and green forest, is empty when I arrive. A sailing boat bobs on the horizon, with an islet and the French coastline in the background. I can hardly believe that I am standing on an empty Côte d'Azur beach in the middle of summer.\nThe next day, I set off for the untamed isle of Levant, whose land meets the sea in jagged cliffs. Ninety percent of this 1,000-hectare island is an off-limits military base. The remaining part is Heliopolis, a nudist colony founded in 1931. This private community is open to the public so long as people respect its spirit, which is to live simply and healthily in commune with nature, far from urban life's constraints.\nClothing is optional throughout Heliopolis, save for Plage des Grottes – the island's only sand beach – where nudity is compulsory. There is no public electricity, and with no natural ground source, water is scarce. Visitors and residents must limit noise, refrain from smoking and cover their seats if dining undressed. Everyone gets around on foot, as bicycles are prohibited on the steep, narrow streets.\nA live-and-let-live-within-the-rules kind of attitude is palpable here, with people vocalising their appreciation for Levant as a unique, treasured space. People say bonjour when they pass; naked, clothed, resident or visitor. No one seems to be on their phones. When I ask locals why, I get similar responses: people want to be free of them.\nMore like this:\n• The US neighbourhood where cars are banned\n• The US island with no cars and one horse for every person\n• St-Tropez: The town telling visitors to stay away this summer\n\"When we are on Levant, we live like we are on Levant,\" says Marie-Pierre Romanello, owner of Adam et Eve Boutique. \"You don't bring your other way of life here. The spirit of freedom and simplicity must remain our way.\"\n\"It's the feeling of nature, the sea, freedom, the Sun,\" that make this place special, says Heliopolis' deputy mayor Frédéric Capoulade, who co-authored a book on its history \"It's also the quiet.\"\nAt dusk I'm in Place Durville, the main square, where all ages – from toddlers to seniors – gather. Some wear shorts and t-shirts, others are in heels and sheer sarongs or nothing at all. Dogs run off leash. A basket of bread sits outside the shuttered bakery, for sale on the honour system.\nI arrived in Levant with an open mind but also trepidation, until my campsite's manager assured me it wasn't offensive to stay clothed. But at the beach, I summon the courage to follow the no-clothing rule and snorkel among dreamfish and ornate wrasse. Levant's affirming space has put me at ease.\nOn the Hyères Islands, the enchantingly simple, romantic French Riviera I'd been searching for is a reality. Romanello's words flood back to me: \"We are incredibly lucky. We have a little piece of paradise.\"\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram."
  },
  {
    "slug": "how-to-plan-an-extremely-last-minute-trip",
    "title": "How to plan an extremely last-minute trip",
    "category": "Stories",
    "date": "2025-09-01",
    "author": "AventurOO Editorial",
    "source": "https://www.bbc.com/travel/article/20250825-how-to-plan-an-extremely-last-minute-trip?ocid=global_travel_rss",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lyz47b.jpg",
    "excerpt": "--- title: Forget planning: Three expert tips to take a last-minute break for less author: Lynn Brown url: https://www.bbc.com/travel/article/20250825-how-to-plan-an-extremely-last-minute-trip hostname: bbc.com description: Being willing to switch when, where and how you travel can still land you affordable trips on a week's notice. sitename: BBC date: 2025-08-27 --- Forget planning: Three expert tips to take a last-minute break for less Being willing to switch when, where and how you travel can still land you affordable trips on a week's notice. It's happened to us all. You go in to work on a Monday morning to find your colleagues gleefully discussing their plans for the upcoming long weekend – the long weekend you completely forgot was coming up. You're desperately in need of a break, but it seems too late to make plans now…. or is it? No need to settle for another weekend in your pyjamas watching The White Lotus for the seventh time. While planning ahead – ideally two weeks or more – is best in terms of both cost and availability, it's still possible to organise a reasonably priced holiday with less than a week's notice. Here are some expert tips on how to do it. Flexibility is key Flights are usually the hardest (and priciest) aspect of a super last-minute trip. \"Airlines tend to increase fares as the flight approaches,\" said Rachel Mumford, UK travel expert at KAYAK. \"So, while booking flights as early as possible is typically the best way to secure deals, that's not always possible.\" Mumford and other experts stressed that flexibility is the key to overcoming this hurdle. \"For travellers booking within the week, flexibility is your superpower,\" Jesse Neugarten, founder and CEO of Dollar Flight Club, told the BBC. \"When you're planning a trip just days in advance, the more flexible you are on dates, times and even destinations, the more likely you are to score a great deal.\" You can also look for a package: \"Pick a destination that is easy to get to and offers plenty of experiences that can be arranged on short notice,\" suggested Tania Humana, director of sales at Banyan Tree Mayakob in the Riviera Maya. \"Looking for packages that combine accommodation and activities will help you get the most out of your trip.\" If you're just happy to get out of town, search engines like Google Travel and KAYAK let you search for flights to \"anywhere\", a bonus when looking for cheap last-minute deals. You may end up in Cartegena instead of Capri, but it's a great opportunity to explore a destination you may not have thought of. Neugarten also suggests travelling on low traffic days, like a Wednesday or Thursday – your wallet will thank you.…",
    "content": "---\ntitle: Forget planning: Three expert tips to take a last-minute break for less\nauthor: Lynn Brown\nurl: https://www.bbc.com/travel/article/20250825-how-to-plan-an-extremely-last-minute-trip\nhostname: bbc.com\ndescription: Being willing to switch when, where and how you travel can still land you affordable trips on a week's notice.\nsitename: BBC\ndate: 2025-08-27\n---\nForget planning: Three expert tips to take a last-minute break for less\nBeing willing to switch when, where and how you travel can still land you affordable trips on a week's notice.\nIt's happened to us all. You go in to work on a Monday morning to find your colleagues gleefully discussing their plans for the upcoming long weekend – the long weekend you completely forgot was coming up. You're desperately in need of a break, but it seems too late to make plans now…. or is it?\nNo need to settle for another weekend in your pyjamas watching The White Lotus for the seventh time. While planning ahead – ideally two weeks or more – is best in terms of both cost and availability, it's still possible to organise a reasonably priced holiday with less than a week's notice. Here are some expert tips on how to do it.\nFlexibility is key\nFlights are usually the hardest (and priciest) aspect of a super last-minute trip. \"Airlines tend to increase fares as the flight approaches,\" said Rachel Mumford, UK travel expert at KAYAK. \"So, while booking flights as early as possible is typically the best way to secure deals, that's not always possible.\"\nMumford and other experts stressed that flexibility is the key to overcoming this hurdle. \"For travellers booking within the week, flexibility is your superpower,\" Jesse Neugarten, founder and CEO of Dollar Flight Club, told the BBC. \"When you're planning a trip just days in advance, the more flexible you are on dates, times and even destinations, the more likely you are to score a great deal.\"\nYou can also look for a package: \"Pick a destination that is easy to get to and offers plenty of experiences that can be arranged on short notice,\" suggested Tania Humana, director of sales at Banyan Tree Mayakob in the Riviera Maya. \"Looking for packages that combine accommodation and activities will help you get the most out of your trip.\"\nIf you're just happy to get out of town, search engines like Google Travel and KAYAK let you search for flights to \"anywhere\", a bonus when looking for cheap last-minute deals. You may end up in Cartegena instead of Capri, but it's a great opportunity to explore a destination you may not have thought of. Neugarten also suggests travelling on low traffic days, like a Wednesday or Thursday – your wallet will thank you.\nSkip the flight\nAnother option is to stay closer to home. Road trips and staycations are tailor-made for last-minute escapes, and buses are one of the most underrated budget hacks.\n\"Even closer to departure, buses often remain far more affordable than booking a last-minute flight or renting a car,\" said Matt Schoolfield, travel insights expert at Flixbus North America. \"If you're flexible with your day and time, you can often find a very good fare, even a day or two before you leave.\"\nHe suggests looking at high-frequency routes, such as New York to Philadelphia, Los Angeles to San Diego or Toronto to Ottawa, for the best last-minute deals, as these are more likely to have plenty of availability at a moment's notice.\nFor short jaunts, buses can be even faster and more comfortable than flying. \"When you factor in the trip to the airport, time spent in security lines and waiting at the gate, a direct bus between city centres can be the quicker and far less stressful option,\" said Schoolfield.\nAnd don't dismiss bus travel as a gruelling ordeal – today's buses are often more comfortable than economy flights, with more legroom and reclining space, plus free luggage storage, Wi-Fi and power outlets, all included.\nWhere to stay\nOnce you've decided how to get to your destination, finding somewhere to stay should be a breeze. According to Neugarten, securing last-minute accommodation tends to be less stressful on the wallet: \"Hotels are different [from airlines]. Last-minute can work in your favour. Hotels are generally more likely to discount rooms last-minute to avoid them sitting empty, especially in big cities or during off-peak seasons.\"\nMore like this:\n• Eight ways to travel more sustainably in 2025\n• Why 'best time to visit' no longer applies\n• The new tourist fines sweeping Europe\nHe suggests using apps like HotelTonight, which specialises in discounted last-minute stays; or Hopper, which predicts when hotel rates are about to drop. Another option is calling the hotel directly – front desk staff sometimes have access to exclusive rates to help fill empty rooms. And as with flights, booking a mid-week stay can lead to more availability and better savings.\nOverall, the key to planning a last-minute trip is all about embracing the adventure. Relinquish as much control as possible and allow the Universe – or at least the price point – dictate where and when you'll travel. The more flexible and open you are to the unexpected, the more likely you'll be able to create an escape where the only stressful part is your last-minute packing.\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram."
  },
  {
    "slug": "pay-what-you-can-for-a-michelin-starred-meal",
    "title": "'Pay what you can' for a Michelin-starred meal",
    "category": "Stories",
    "date": "2025-09-01",
    "author": "AventurOO Editorial",
    "source": "https://www.bbc.com/travel/article/20250825-pay-what-you-can-for-a-michelin-starred-meal?ocid=global_travel_rss",
    "cover": "https://ychef.files.bbci.co.uk/144x81/p0lyzlkq.jpg",
    "excerpt": "--- title: 'Eat What You Want, Pay What You Can' at restaurants across Mexico City author: Lynn Brown url: https://www.bbc.com/travel/article/20250825-pay-what-you-can-for-a-michelin-starred-meal hostname: bbc.com description: Michelin-starred Masala y Maiz hopes to spread the trend across Mexico and around the world. sitename: BBC date: 2025-08-26 --- 'Eat What You Want, Pay What You Can' at restaurants across Mexico City Michelin-starred Masala y Maiz hopes to spread the trend across Mexico and around the world. When Norma Listman and Saqib Keval, owners and chefs at one of Mexico City's most popular restaurants, Masala y Maiz, won their first Michelin star, they were in New York City at a party for a fellow chef. \"Our team was calling us, and we weren't answering the phone,\" explains Listman with a laugh. \"And then the nerdiest of our managers, the most serious one calls, and I was like, he never calls unless something is wrong. Turns out that we were live on the stage [at the Michelin awards].\" The couple, known for establishing the restaurant's groundbreaking \"Eat What You Want, Pay What You Can\" initiative, is much more passionate about supporting community than prestigious accolades. Spending time celebrating a fellow chef they admire instead of attending an awards ceremony in honour of themselves is much more in Listman and Keval's wheelhouse. Take, for example, the pay-what-you-can model that has made Masala y Maiz so popular. Several times a year, restaurant-goers are offered a menu of the restaurant's signature Mexican, African and Indian-fusion dishes alongside an envelope in which to leave whatever payment they have available or deem acceptable. There is no bill and no reservations, guests must line up for a first-come, first-served experience. But there is one requirement: diners must write how much of what they've left is intended for the staff rather than the restaurant itself. The practice is intended to ensure that everyone in the city, regardless of their economic status, can enjoy the dishes prepared here: Camarones pa'pelar, a shrimp dish cooked with vanilla, lime and ghee, and the Kuku Poussin, a small fried chicken served with cheese, lettuce and a tamarind dressing. They are prepared exactly the same as on a normal day in both size and quality, but with no price tag attached. The couple says they don't lose money on the event. Most visitors give something, even if it's only original art for the staff, while others have paid more, they say, sometimes as much as three times the usual cost. For the owners, it's a particularly poignant move in a city struggling with issues of gentrification and overtourism. \"There's a lot of class discrepancies, there's a lot of economic discrepancies in the city,\" says Listman. \"There are people who…",
    "content": "---\ntitle: 'Eat What You Want, Pay What You Can' at restaurants across Mexico City\nauthor: Lynn Brown\nurl: https://www.bbc.com/travel/article/20250825-pay-what-you-can-for-a-michelin-starred-meal\nhostname: bbc.com\ndescription: Michelin-starred Masala y Maiz hopes to spread the trend across Mexico and around the world.\nsitename: BBC\ndate: 2025-08-26\n---\n'Eat What You Want, Pay What You Can' at restaurants across Mexico City\nMichelin-starred Masala y Maiz hopes to spread the trend across Mexico and around the world.\nWhen Norma Listman and Saqib Keval, owners and chefs at one of Mexico City's most popular restaurants, Masala y Maiz, won their first Michelin star, they were in New York City at a party for a fellow chef.\n\"Our team was calling us, and we weren't answering the phone,\" explains Listman with a laugh. \"And then the nerdiest of our managers, the most serious one calls, and I was like, he never calls unless something is wrong. Turns out that we were live on the stage [at the Michelin awards].\"\nThe couple, known for establishing the restaurant's groundbreaking \"Eat What You Want, Pay What You Can\" initiative, is much more passionate about supporting community than prestigious accolades. Spending time celebrating a fellow chef they admire instead of attending an awards ceremony in honour of themselves is much more in Listman and Keval's wheelhouse.\nTake, for example, the pay-what-you-can model that has made Masala y Maiz so popular. Several times a year, restaurant-goers are offered a menu of the restaurant's signature Mexican, African and Indian-fusion dishes alongside an envelope in which to leave whatever payment they have available or deem acceptable. There is no bill and no reservations, guests must line up for a first-come, first-served experience. But there is one requirement: diners must write how much of what they've left is intended for the staff rather than the restaurant itself.\nThe practice is intended to ensure that everyone in the city, regardless of their economic status, can enjoy the dishes prepared here: Camarones pa'pelar, a shrimp dish cooked with vanilla, lime and ghee, and the Kuku Poussin, a small fried chicken served with cheese, lettuce and a tamarind dressing. They are prepared exactly the same as on a normal day in both size and quality, but with no price tag attached. The couple says they don't lose money on the event. Most visitors give something, even if it's only original art for the staff, while others have paid more, they say, sometimes as much as three times the usual cost.\nFor the owners, it's a particularly poignant move in a city struggling with issues of gentrification and overtourism. \"There's a lot of class discrepancies, there's a lot of economic discrepancies in the city,\" says Listman. \"There are people who are making all the money and people doing all the work. This is going to bridge that class divide and that economic divide and make restaurants accessible for everyone – at least for one day.\"\nThough the ceremony wasn't their cup of tea, Listman and Keval recognised how a Michelin star could benefit their community, raising awareness of this idea beyond their own prospective diners and to other restaurants across Mexico City. This year, for the first time, 20 additional Mexico City eateries will participate in a \"Eat What You Want, Pay What You Can Day\" on 27 August based on the Masala y Maiz model. The event is to be the first of what Keval hopes will become a tradition around the world.\n\"We've had people from Chile reach out, from Colombia, from other parts of Mexico, from Peru that want to join,\" he told the BBC. \"And I don't see why this couldn't be like 'pay what you can international.'\"\nThis year, participating businesses range from small family-owned bakeries called panaderías like Panadería Valle Luna in the Colonia Juarez, to Expendio de Maíz, another of the city's Michelin-starred spots, which serves traditional Mexican dishes with an emphasis on corn. There are more than 20 restaurants in total participating in the event, which Listman and Keval expect will only grow next year.\n\"We were primarily motivated by community building,\" said Ximena Igartúa, of Loup Bar in the Cuauhtémoc District, which is participating in the event. \"It's a collective message of unity and solidarity, and an invitation to try to break preconceived ideas. It's also a way of giving back to our customers for everything we receive.\"\nKeval hopes the event could spark a larger worldwide trend, a dream which may already be in motion. There are already other pay what you can schemes elsewhere, such as Annalakshmi Restaurant in Singapore or Rethink Cafe in Brooklyn, NY, independent of the Mexico City initiative.\nAs for the owners of Masala y Maiz, the hope is that more restaurants – and more people – will be able to benefit from a great meal at any price.\n\"Restaurant work is so demanding and the returns on it are so diminishing. The margins are so tight that it's hard to have space to dream,\" Keval says. \"[But] this is something that can be done.\"\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news, delivered to your inbox twice a week.\nFor more Travel stories from the BBC, follow us on Facebook and Instagram."
  },
  {
    "slug": "the-artist-whose-fauci-portraits-enraged-the-white-house",
    "title": "The Artist Whose Fauci Portraits Enraged the White House",
    "category": "Culture",
    "date": "2025-09-01",
    "author": "Isa Farfan",
    "source": "https://hyperallergic.com/1038060/hugo-crosthwaite-artist-whose-fauci-portraits-enraged-the-white-house/",
    "cover": "assets/img/cover-fallback.jpg",
    "excerpt": "--- title: The Artist Whose Fauci Portraits Enraged the White House author: Isa Farfan url: https://hyperallergic.com/1038060/hugo-crosthwaite-artist-whose-fauci-portraits-enraged-the-white-house/ hostname: hyperallergic.com description: Hugo Crosthwaite, whose stop-motion animation about the scientist was targeted by the Trump administration, talks to Hyperallergic about the work’s backstory. sitename: Hyperallergic date: 2025-08-31 categories: ['Features'] tags: ['Anthony Fauci', 'National Portrait Gallery', 'Trump Administration'] --- In 2019, Hugo Crosthwaite became the first Latino artist to win the Smithsonian National Portrait Gallery’s (NPG) prestigious triennial Outwin Boochever Portrait Competition. The Tijuana-born and San Diego-based illustrator received the contest’s grand prize: $25,000 and a portrait commission for the museum’s permanent collection. He chose to depict Anthony Fauci, then the director of the National Institute of Allergy and Infectious Diseases (NIAID), in a stop-motion format that captures the nuances of his complicated legacy, including his criticized and then celebrated oversight of the HIV/AIDs epidemic. Last week, Crosthwaite found his hard-won commission on a list of Smithsonian items that the White House found objectionable. He was one of at least three Mexican-born artists whose work was included on Trump’s art hit list, along with illustrator Rigoberto González and painter Felipe Galindo Gómez. “My first reaction was surprise,” Crosthwaite shared in an interview with Hyperallergic. “But then later on, [I] felt a bit of pride to be included in this list of other wonderful artists and wonderful projects that talk about the diversity of the United States’ history.” In 2022, after winning the Outwin competition, Crosthwaite and the NPG considered a list of individuals for a portrait. They agreed on Fauci as the commission’s subject. At the time, the infectious disease specialist was a polarized figure: a revered pandemic hero and a detested political opponent of the right. “I jumped at the chance of doing this because it was 2022, we were in the middle of the COVID-19 pandemic,” Crosthwaite told Hyperallergic. “He became a symbol of this fight between science and truth, against conspiracy theories; Dr. Fauci kind of epitomizes the nation’s current political divide.” The five-minute stop motion animation, “A Portrait of Dr. Anthony Fauci” (2022), begins by portraying him as a young scientist in a lab. Later, a man infected by an unnamed virus becomes emaciated until he disappears into a black hole that morphs into a scene from ACT UP protests. Men carry signs that read “Silence = Death” and “Killed by the System.” Behind them, skeletons look to the sky. The artwork references the AIDs memorial quilt before transitioning into a segment about the COVID-19 pandemic, in which a woman’s lungs explode into tiny bits of paper. Fauci is portrayed next to the White House press briefing room podium, where he often gave virus updates alongside Trump. Crosthwaite included a…",
    "content": "---\ntitle: The Artist Whose Fauci Portraits Enraged the White House\nauthor: Isa Farfan\nurl: https://hyperallergic.com/1038060/hugo-crosthwaite-artist-whose-fauci-portraits-enraged-the-white-house/\nhostname: hyperallergic.com\ndescription: Hugo Crosthwaite, whose stop-motion animation about the scientist was targeted by the Trump administration, talks to Hyperallergic about the work’s backstory.\nsitename: Hyperallergic\ndate: 2025-08-31\ncategories: ['Features']\ntags: ['Anthony Fauci', 'National Portrait Gallery', 'Trump Administration']\n---\nIn 2019, Hugo Crosthwaite became the first Latino artist to win the Smithsonian National Portrait Gallery’s (NPG) prestigious triennial Outwin Boochever Portrait Competition. The Tijuana-born and San Diego-based illustrator received the contest’s grand prize: $25,000 and a portrait commission for the museum’s permanent collection. He chose to depict Anthony Fauci, then the director of the National Institute of Allergy and Infectious Diseases (NIAID), in a stop-motion format that captures the nuances of his complicated legacy, including his criticized and then celebrated oversight of the HIV/AIDs epidemic.\nLast week, Crosthwaite found his hard-won commission on a list of Smithsonian items that the White House found objectionable. He was one of at least three Mexican-born artists whose work was included on Trump’s art hit list, along with illustrator Rigoberto González and painter Felipe Galindo Gómez.\n“My first reaction was surprise,” Crosthwaite shared in an interview with Hyperallergic. “But then later on, [I] felt a bit of pride to be included in this list of other wonderful artists and wonderful projects that talk about the diversity of the United States’ history.”\nIn 2022, after winning the Outwin competition, Crosthwaite and the NPG considered a list of individuals for a portrait. They agreed on Fauci as the commission’s subject. At the time, the infectious disease specialist was a polarized figure: a revered pandemic hero and a detested political opponent of the right.\n“I jumped at the chance of doing this because it was 2022, we were in the middle of the COVID-19 pandemic,” Crosthwaite told Hyperallergic. “He became a symbol of this fight between science and truth, against conspiracy theories; Dr. Fauci kind of epitomizes the nation’s current political divide.”\nThe five-minute stop motion animation, “A Portrait of Dr. Anthony Fauci” (2022), begins by portraying him as a young scientist in a lab. Later, a man infected by an unnamed virus becomes emaciated until he disappears into a black hole that morphs into a scene from ACT UP protests. Men carry signs that read “Silence = Death” and “Killed by the System.” Behind them, skeletons look to the sky.\nThe artwork references the AIDs memorial quilt before transitioning into a segment about the COVID-19 pandemic, in which a woman’s lungs explode into tiny bits of paper. Fauci is portrayed next to the White House press briefing room podium, where he often gave virus updates alongside Trump. Crosthwaite included a thumbs-up icon moving erratically up and down behind the podium, and Fauci off to the side. He also captured anti-Fauci sentiment and the right-wing rejection of vaccines, at one point portraying the scientist with devil horns. The stop-motion sequence ends with a woman receiving a vaccine, which cuts to a portrait of an aging Fauci.\nCrosthwaite told Hyperallergic that he doubts the Trump administration actually watched the video, instead targeted the work because of his identity. He rebuffed the White House’s Smithsonian list as a mediocre attempt to win a culture war, and said being included on the list was a badge of honor.\n“The portrait was done from the perspective of a Mexican-American artist, someone who’s cognizant of the impact of age and COVID-19 on my community, which is presented in the animation … the diverse people who are being attacked by viruses,” he said.\nThe artworks that Crosthwaite initially submitted to the Outwin competition had nothing to do with Fauci. In fact, the work that secured his national win was a different stop-motion animation, telling the story of a woman he met who had crossed the US-Mexico border illegally.\nCrosthwaite commended the Outwin prize’s capacity to open doors for artists like himself. Any artist residing in the United States who is at least 18 years old is eligible to submit to the competition. For Crosthwaite, it was life-changing.\n“Getting the commission to do the portrait of Dr. Fauci is actually a great honor — being part of the Smithsonian,” Crosthwaite told Hyperallergic. “My piece is part of the record of American history.”"
  },
  {
    "slug": "the-shocking-allure-of-erotic-abstraction",
    "title": "The Shocking Allure of Erotic Abstraction",
    "category": "Culture",
    "date": "2025-09-01",
    "author": "Olivia McEwan",
    "source": "https://hyperallergic.com/1035805/the-shocking-allure-of-erotic-abstraction-courtauld-gallery/",
    "cover": "assets/img/cover-fallback.jpg",
    "excerpt": "--- title: The Shocking Allure of Erotic Abstraction author: Olivia McEwan url: https://hyperallergic.com/1035805/the-shocking-allure-of-erotic-abstraction-courtauld-gallery/ hostname: hyperallergic.com description: A show on Louise Bourgeois, Eva Hesse, and Alice Adams gives a sense of how different, even alarming, these pieces would have been to viewers in the 1960s. sitename: Hyperallergic date: 2025-08-31 categories: ['Art Review'] tags: ['Courtauld Gallery', 'London', 'Sculpture'] --- LONDON — Some of the Courtauld’s previous exhibitions have suffered from insufficient curation. Abstract Erotic: Louise Bourgeois, Alice Adams, Eva Hesse, on the other hand, strikes the exact right balance. Drawing on scholar Jo Applin’s research, curator Alexandra Gerstein has taken as a starting point the work of feminist curator and critic Lucy Lippard, who coined the titular term to describe this sensuous strand of art emerging in 1960s New York. Making perhaps the best use yet of the Courtauld’s teeny exhibition spaces next to the permanent collection, this small but unstuffed show gives proper breathing space for artistic dialogue and, crucially, for the viewer to engage in exploring differences and similarities between works and practices for themselves. In 1966, Lippard curated the exhibition Eccentric Abstraction to capture a new wave of sculptures created from unusual, pliable materials like wire, plastic mesh, netting, and latex, which evoked tactile organic forms and, by extension, the human body. This is the Courtauld’s first show devoted to standalone sculpture, and the contrast between these blob-like forms and its Impressionist-heavy permanent collection may go some way to recreate just how different — even alarming — these pieces will have appeared to 1960s audiences just getting over the shock of Abstract Expressionism’s rehauling of formalist painting. The three artists are each afforded an introductory caption presenting historical context. No direct written comparisons are made between them, nor any attempt to force commonality, for historically, there is none other than their working in generally the same space and time. This is good curating: The show allows viewers to ask and think for themselves. Its skill lies in making suggestions via the pieces selected for display, allowing for robust visual comparison. Viewers won’t be able to ignore the strain of eroticism that stems from their irresistible tactility, which is both alluring and fear-inducing, nor their uncanny resemblance to certain human appendages (ahem). Applin and Gerstein do point out that all three artists’ experimentation with latex marked a turning point in their explorations of eroticism and the unconscious. The exhibition’s most well-known artist, Bourgeois, was born in Paris in 1911 and moved to New York in 1938. Duly included here is her “Filette (Sweeter Version)” (1968–99/ 2006), unmistakably an erect penis (or, more accurately, one yanked upwards by string) in urethane rubber, given the ambiguous French title “Little Girl.” Adams graduated…",
    "content": "---\ntitle: The Shocking Allure of Erotic Abstraction\nauthor: Olivia McEwan\nurl: https://hyperallergic.com/1035805/the-shocking-allure-of-erotic-abstraction-courtauld-gallery/\nhostname: hyperallergic.com\ndescription: A show on Louise Bourgeois, Eva Hesse, and Alice Adams gives a sense of how different, even alarming, these pieces would have been to viewers in the 1960s.\nsitename: Hyperallergic\ndate: 2025-08-31\ncategories: ['Art Review']\ntags: ['Courtauld Gallery', 'London', 'Sculpture']\n---\nLONDON — Some of the Courtauld’s previous exhibitions have suffered from insufficient curation. Abstract Erotic: Louise Bourgeois, Alice Adams, Eva Hesse, on the other hand, strikes the exact right balance. Drawing on scholar Jo Applin’s research, curator Alexandra Gerstein has taken as a starting point the work of feminist curator and critic Lucy Lippard, who coined the titular term to describe this sensuous strand of art emerging in 1960s New York. Making perhaps the best use yet of the Courtauld’s teeny exhibition spaces next to the permanent collection, this small but unstuffed show gives proper breathing space for artistic dialogue and, crucially, for the viewer to engage in exploring differences and similarities between works and practices for themselves.\nIn 1966, Lippard curated the exhibition Eccentric Abstraction to capture a new wave of sculptures created from unusual, pliable materials like wire, plastic mesh, netting, and latex, which evoked tactile organic forms and, by extension, the human body. This is the Courtauld’s first show devoted to standalone sculpture, and the contrast between these blob-like forms and its Impressionist-heavy permanent collection may go some way to recreate just how different — even alarming — these pieces will have appeared to 1960s audiences just getting over the shock of Abstract Expressionism’s rehauling of formalist painting.\nThe three artists are each afforded an introductory caption presenting historical context. No direct written comparisons are made between them, nor any attempt to force commonality, for historically, there is none other than their working in generally the same space and time. This is good curating: The show allows viewers to ask and think for themselves. Its skill lies in making suggestions via the pieces selected for display, allowing for robust visual comparison. Viewers won’t be able to ignore the strain of eroticism that stems from their irresistible tactility, which is both alluring and fear-inducing, nor their uncanny resemblance to certain human appendages (ahem).\nApplin and Gerstein do point out that all three artists’ experimentation with latex marked a turning point in their explorations of eroticism and the unconscious. The exhibition’s most well-known artist, Bourgeois, was born in Paris in 1911 and moved to New York in 1938. Duly included here is her “Filette (Sweeter Version)” (1968–99/ 2006), unmistakably an erect penis (or, more accurately, one yanked upwards by string) in urethane rubber, given the ambiguous French title “Little Girl.” Adams graduated from Columbia University with a degree in Fine Arts in 1953 before becoming an accomplished weaver. Her foray into obscure materials is here represented by such pieces as the nearby “Expanded Cylinder” (1970), in which she allowed latex foam to expand and set into a constricting tube of chain link, producing a regular weave-like texture while maintaining a phallic, slippery form. Finally, Hesse, born in 1936 in Hamburg before settling in New York, made sculptures of forms bound, twisted, and caught in netting. Applin and Gerstein draw out the latex connection again via the caption, which quotes Hesse on the material’s inevitable deterioration: “Art doesn’t last; life doesn’t last.” Fittingly, though unfortunately, there are no latex examples here.\nIt is also unfortunate that this small but perfectly formed show was relatively empty on a weekend. The scrappy, experimental mark-making explored by these three pioneering artists is one important strain in the development of feminist art. Their unsettling forms provoke, titillate, and amuse — welcome responses to female voices and artistic expression. Perhaps it is reflective of trends in audience attention that a solid academic show like this should be less visited than the packed-out recent exhibitions on Peter Doig or yet more Impressionism. We all know sex sells: Does the marketing perhaps need to shout “Eroticism!” or “Rubber penises!” to get punters through the door these days?\nAbstract Erotic: Louise Bourgeois, Eva Hesse, Alice Adams continues at the Courtauld Gallery (Somerset House, London) through September 14. The exhibition was curated by Alexandra Gerstein based on the research of Jo Applin."
  },
  {
    "slug": "reclaiming-a-whitewashed-history-of-the-great-depression",
    "title": "Reclaiming a Whitewashed History of the Great Depression",
    "category": "Culture",
    "date": "2025-09-01",
    "author": "Monica Uszerowicz",
    "source": "https://hyperallergic.com/1038134/reclaiming-a-whitewashed-history-of-the-great-depression-museum-art-light-kansas/",
    "cover": "assets/img/cover-fallback.jpg",
    "excerpt": "--- title: Reclaiming a Whitewashed History of the Great Depression author: Monica Uszerowicz url: https://hyperallergic.com/1038134/reclaiming-a-whitewashed-history-of-the-great-depression-museum-art-light-kansas/ hostname: hyperallergic.com description: A new exhibition focuses on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, and Ben Shahn. sitename: Hyperallergic date: 2025-08-31 categories: ['Features'] tags: ['Photography', 'Previews'] --- When the United States Department of Agriculture established the Farm Security Administration (FSA) in 1937, hoping to provide aid to rural communities affected by the Great Depression, it also implemented a photography project headed by government official Roy Stryker. The photographs were meant to generate support for the agency, allowing the public to witness the impacts of the Depression for themselves. Made by recruited photographers and then selected by Stryker for inclusion in traveling exhibitions and news outlets, the chosen images overwhelmingly depicted White families — a narrow and literally whitewashed view of rural America. Crafting Sanctuaries: Black Spaces of the Black Great Depression South, a new exhibition at the Museum of Art and Light in Manhattan, Kansas, showcases a broader view of FSA imagery, focusing on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, Russell Lee, Marion Post Wolcott, Arthur Rothstein, Ben Shahn, and Jack Delano across six states: Alabama, Georgia, Louisiana, Florida, Mississippi, and Missouri. Presented in partnership with Art Bridges Foundation, the photos highlight the intimacy of life among one’s community — private quarters, public gathering spaces — and the care taken to build one together. The exhibition, curator Tamir Williams told Hyperallergic, “is an examination of the significance of Black Southerners investing in their spatial worlds — and more largely in beauty — while living through this intense period of economic hardship and racial violence.” During the summer of 2023, Ashley Holland, curator and director of Curatorial Initiatives for the Art Bridges Foundation, approached Williams to curate its first in-house traveling exhibition, drawing from the FSA photography collection. At the time, they’d just begun a job there as a curatorial research assistant. “I came across Nicholas Natanson’s The Black Image in the New Deal: The Politics of FSA Photography (1992) and Sarah Boxer’s ‘Whitewashing the Great Depression’ (2020) for The Atlantic,” Williams said. “I knew that I wanted to focus on this issue of the absence of Black and other non-White persons from the larger visual memory of the Great Depression — and specifically explore how and why this exclusion happened and how it could be redressed.” Williams spent a week at the Library of Congress poring over the digital FSA collection. They were drawn to images of small homes built by both White and Black laborers, particularly in La Forge, Missouri. Curious about “what home and homemaking might have looked like for other Black persons and families…",
    "content": "---\ntitle: Reclaiming a Whitewashed History of the Great Depression\nauthor: Monica Uszerowicz\nurl: https://hyperallergic.com/1038134/reclaiming-a-whitewashed-history-of-the-great-depression-museum-art-light-kansas/\nhostname: hyperallergic.com\ndescription: A new exhibition focuses on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, and Ben Shahn.\nsitename: Hyperallergic\ndate: 2025-08-31\ncategories: ['Features']\ntags: ['Photography', 'Previews']\n---\nWhen the United States Department of Agriculture established the Farm Security Administration (FSA) in 1937, hoping to provide aid to rural communities affected by the Great Depression, it also implemented a photography project headed by government official Roy Stryker. The photographs were meant to generate support for the agency, allowing the public to witness the impacts of the Depression for themselves. Made by recruited photographers and then selected by Stryker for inclusion in traveling exhibitions and news outlets, the chosen images overwhelmingly depicted White families — a narrow and literally whitewashed view of rural America.\nCrafting Sanctuaries: Black Spaces of the Black Great Depression South, a new exhibition at the Museum of Art and Light in Manhattan, Kansas, showcases a broader view of FSA imagery, focusing on Black Southerners documented by photographers like Walker Evans, Dorothea Lange, Russell Lee, Marion Post Wolcott, Arthur Rothstein, Ben Shahn, and Jack Delano across six states: Alabama, Georgia, Louisiana, Florida, Mississippi, and Missouri.\nPresented in partnership with Art Bridges Foundation, the photos highlight the intimacy of life among one’s community — private quarters, public gathering spaces — and the care taken to build one together. The exhibition, curator Tamir Williams told Hyperallergic, “is an examination of the significance of Black Southerners investing in their spatial worlds — and more largely in beauty — while living through this intense period of economic hardship and racial violence.”\nDuring the summer of 2023, Ashley Holland, curator and director of Curatorial Initiatives for the Art Bridges Foundation, approached Williams to curate its first in-house traveling exhibition, drawing from the FSA photography collection. At the time, they’d just begun a job there as a curatorial research assistant.\n“I came across Nicholas Natanson’s The Black Image in the New Deal: The Politics of FSA Photography (1992) and Sarah Boxer’s ‘Whitewashing the Great Depression’ (2020) for The Atlantic,” Williams said. “I knew that I wanted to focus on this issue of the absence of Black and other non-White persons from the larger visual memory of the Great Depression — and specifically explore how and why this exclusion happened and how it could be redressed.”\nWilliams spent a week at the Library of Congress poring over the digital FSA collection. They were drawn to images of small homes built by both White and Black laborers, particularly in La Forge, Missouri. Curious about “what home and homemaking might have looked like for other Black persons and families beyond La Forge,” they expanded their research.\nThe exhibition’s photographs are reverent, offering glimpses into otherwise unseen instances of Black domesticity and community. “I find Jack Delano’s ‘Negro tenant family near Greensboro, Alabama’ (1941) to be incredibly striking,” shared Javier Rivero Ramos, associate curator at Art Bridges. In the image, a young family poses in their home, the walls and ceilings plastered and reinforced with newspaper clippings, a kitten at their feet. “It seems like every conceivable emotion, thought, and event unfolding through the country is somehow refracted in the image,” Ramos added. Ibby Ouweleen, Art Bridges curatorial associate, said she was “taken by Marion Post Wolcott’s interior scene of three children and a dog in their family home, which feels sort of magical and mundane at once.”\nThe exhibition is displayed in tandem with Sanctuary in Motion, a companion installation developed in collaboration with the Yuma Street Cultural Center. Kristy Peterson, vice president of Learning, Engagement, and Visitor Experiences at the museum, pointed to the history of the site.\n“Manhattan, Kansas, has a rich history as a town site established by abolitionist settlers, circa 1855,” Peterson told Hyperallergic. “Sanctuary in Motion shares information about Manhattan’s history and community, and tells the story of Yuma Street [part of the city’s Historic District] … and its significance as a sanctuary where families made something out of nothing.”\nCrafting Sanctuaries, which runs through next spring, is both a corrective and a meditation. “It is my hope that these photographs allow viewers to see and witness how Black Southerners adopted expansive definitions of beauty to craft personal and communal sanctuaries and spaces of respite,” Williams said."
  },
  {
    "slug": "art-dealers-get-candid-ahead-of-the-armory-show",
    "title": "Art Dealers Get Candid Ahead of the Armory Show",
    "category": "Culture",
    "date": "2025-09-01",
    "author": "Aaron Short",
    "source": "https://hyperallergic.com/1038050/new-york-art-dealers-get-candid-ahead-of-the-armory-show-2025/",
    "cover": "assets/img/cover-fallback.jpg",
    "excerpt": "--- title: Art Dealers Get Candid Ahead of the Armory Show author: Aaron Short url: https://hyperallergic.com/1038050/new-york-art-dealers-get-candid-ahead-of-the-armory-show-2025/ hostname: hyperallergic.com description: Amid market unease and slimmer blue-chip participation, some galleries see an opportunity to cultivate collectors at the mammoth Manhattan fair. sitename: Hyperallergic date: 2025-08-31 categories: ['News'] tags: ['Armory Week', 'Featured', 'New York', 'The Armory Show'] --- Joe Amrhein and Susan Swenson were going to sit out the Armory Show this fall for the first time in a quarter century until they got a call last month from the fair’s director. The owners of Pierogi Gallery in Brooklyn’s Williamsburg neighborhood initially did not apply this year due to the show’s rising booth costs, which can exceed tens of thousands of dollars. Pierogi is planning the next phase of its business, which could include relocating to Lower Manhattan. But Armory executives Kyla McMillan and J. Tyler Woodall appealed to Pierogi and the fair’s shared history — in 2016, Amrhein suggested the Armory use an empty space to display Jonathan Schipper’s installation of a Volkswagen Golf crashing into a wall; the presentation of large-scale art has since become a cornerstone of the show. They recently negotiated a smaller exhibition space for Pierogi with a lower rate, enabling the gallery to return. “We had been on the fence about it since the economy is very uncertain and it’s a big investment,” Swenson said. “We’re not one of the big box galleries. Some of them have their own economies now.” The Armory Show has come a long way from exhibiting several New York gallerists on three floors of the Gramercy Park Hotel in the mid-1990s. Since 2021, the fair has set up camp at the spacious Javits Center near Manhattan’s Hudson Yards, where it will host some 230 galleries from more than 35 countries from September 4 through 7. The show also has new owners. Two years after Frieze acquired the Armory Show and EXPO Chicago, its parent company, Endeavor Group Holdings, sold its roster of art fairs for $200 million to Hollywood superagent Ari Emmanuel. The former Endeavor CEO envisions Frieze as a key piece of a new global events company he formed this year, and perhaps one positioned to compete with Art Basel’s dominance in the contemporary art market. But with a reported downturn in the market, galleries have been weighing their options. Once mainstays at the Armory, blue-chip institutions have instead drifted toward Frieze’s spring fair, the Art Dealers Association of America’s (ADAA) Art Show (before it was abruptly canceled this year), or TEFAF New York — or they are skipping the New York fairs entirely. David Zwirner hasn’t exhibited at the Amory Show since 2022, and chose to show at ADAA several…",
    "content": "---\ntitle: Art Dealers Get Candid Ahead of the Armory Show\nauthor: Aaron Short\nurl: https://hyperallergic.com/1038050/new-york-art-dealers-get-candid-ahead-of-the-armory-show-2025/\nhostname: hyperallergic.com\ndescription: Amid market unease and slimmer blue-chip participation, some galleries see an opportunity to cultivate collectors at the mammoth Manhattan fair.\nsitename: Hyperallergic\ndate: 2025-08-31\ncategories: ['News']\ntags: ['Armory Week', 'Featured', 'New York', 'The Armory Show']\n---\nJoe Amrhein and Susan Swenson were going to sit out the Armory Show this fall for the first time in a quarter century until they got a call last month from the fair’s director.\nThe owners of Pierogi Gallery in Brooklyn’s Williamsburg neighborhood initially did not apply this year due to the show’s rising booth costs, which can exceed tens of thousands of dollars. Pierogi is planning the next phase of its business, which could include relocating to Lower Manhattan.\nBut Armory executives Kyla McMillan and J. Tyler Woodall appealed to Pierogi and the fair’s shared history — in 2016, Amrhein suggested the Armory use an empty space to display Jonathan Schipper’s installation of a Volkswagen Golf crashing into a wall; the presentation of large-scale art has since become a cornerstone of the show. They recently negotiated a smaller exhibition space for Pierogi with a lower rate, enabling the gallery to return.\n“We had been on the fence about it since the economy is very uncertain and it’s a big investment,” Swenson said. “We’re not one of the big box galleries. Some of them have their own economies now.”\nThe Armory Show has come a long way from exhibiting several New York gallerists on three floors of the Gramercy Park Hotel in the mid-1990s. Since 2021, the fair has set up camp at the spacious Javits Center near Manhattan’s Hudson Yards, where it will host some 230 galleries from more than 35 countries from September 4 through 7.\nThe show also has new owners. Two years after Frieze acquired the Armory Show and EXPO Chicago, its parent company, Endeavor Group Holdings, sold its roster of art fairs for $200 million to Hollywood superagent Ari Emmanuel. The former Endeavor CEO envisions Frieze as a key piece of a new global events company he formed this year, and perhaps one positioned to compete with Art Basel’s dominance in the contemporary art market.\nBut with a reported downturn in the market, galleries have been weighing their options.\nOnce mainstays at the Armory, blue-chip institutions have instead drifted toward Frieze’s spring fair, the Art Dealers Association of America’s (ADAA) Art Show (before it was abruptly canceled this year), or TEFAF New York — or they are skipping the New York fairs entirely. David Zwirner hasn’t exhibited at the Amory Show since 2022, and chose to show at ADAA several years before that. Pace Gallery’s last year at the Armory was 2021. Gagosian hasn’t shown at the Amory since 2020, back when it was held at Piers 92 and 94. Lisson hasn’t been at the fair since 2019.\nOthers are busy courting international buyers in Asia and the Middle East, where Art Basel Qatar will launch in Doha in February 2026. It doesn’t help that Frieze is competing against itself: Its three-year-old Frieze Seoul fair overlaps with Armory next week, forcing galleries to choose.\n“Everybody is asking where we should be investing our energy and time and our focus,” David Norr, partner at James Cohan Gallery, told Hyperallergic. “The cost of shipping, travel and built-in expenses in participation in these fairs continues to go up.”\nOthers are simply skipping the season altogether. Jack Shainman stepped back from showing at New York fairs in recent years to focus on its exhibitions in Chelsea and the newly renovated Clock Tower building in Civic Center. After wildfires ravaged Los Angeles in January, Night Gallery chose a gallery residency at Arsenal Contemporary instead of participating in several international art fairs.\n“This is both a result of the market and our ability to be in multiple places at once,” Night Gallery spokesperson Shy Watson said. “We are trying to create alternative models of exhibition, promotion, sales, and community.”\nThe Armory is used to a relatively high degree of churn. This year, 55 galleries are participating in the fair for the first time, with another 20 returning from a hiatus, roughly in line with figures from 2024, a fair spokesperson said.\nBut the relative lack of large commercial institutions at the show presents an opportunity for New York galleries to cultivate new collectors and promote their artists to a broader audience.\n“We feel like a large gallery there even though in most art fair contexts we’re very much in the middle,” said Norr of James Cohan. “It feels like you’re giving back some attention to a local ecosystem that’s not only familiar, but wants engagement.”\nSwivel Gallery owner Graham Wilson, who is participating for the first time, was excited that Armory reached out with an opportunity to showcase his roster of artists. Swivel will feature Alejandro García Contreras’s ceramics in the Presents section, which spotlights galleries under 10 years old, as well as an installation from multidisciplinary artist and filmmaker Simon Benjamin in the Platform section, this year curated by a nonprofit, the Georgia-based Souls Grown Deep Foundation.\n“The visibility of the fairs is 20 times more than an artist can get at a solo exhibition at a gallery,” Wilson said.\nThe draw of being able to meet new patrons so close to the city’s largest concentration of galleries remains a key appeal. Yancey Richardson, who is showing at Armory for the 16th year, appreciates that it’s only 12 blocks from her Chelsea gallery.\n“It’s nice to go and do a fair in another city or another country and develop a clientele there, but we also meet new clients here in New York,” she said. “Then those people will come often to visit the gallery during the year once they meet us.”\nAnat Ebgi opened a satellite location in Tribeca two years ago in part because of the success her Los Angeles-based gallery has had meeting clients at Armory, Moira Sims, the gallery’s New York director, told Hyperallergic.\n“A lot of clients come by on the first day and we see them at the gallery the second day, and then we see them back at the fair later in the week,” Sims said. “It feels like a prolonged engagement with clients at this fair in particular.”\nSometimes, it’s too hard to choose. Jennifer Carvalho, who owns Carvalho gallery in Brooklyn, had participated in South Korean art fairs for several years, but never with Frieze Seoul, and had a good experience at the Armory last year. Next week, she’s planning to fly to Seoul to install a solo exhibition for London-based artist Yulia Iosilzon and attend previews before getting on a 6am flight back to New York. She lands at JFK Airport at 11am on Thursday — just in time for the Armory’s VIP opening.\n“I’ve invested in a flatbed seat and I’m just going to drink as much water as possible,” Carvalho said. “My team said they’ll have green tea waiting for me. I have an exceptional team.”"
  },
  {
    "slug": "facing-15m-budget-deficit-calarts-lays-off-workers",
    "title": "Facing $15M Budget Deficit, CalArts Lays Off Workers",
    "category": "Culture",
    "date": "2025-09-01",
    "author": "Aaron Short",
    "source": "https://hyperallergic.com/1038229/facing-15m-budget-deficit-calarts-lays-off-workers/",
    "cover": "assets/img/cover-fallback.jpg",
    "excerpt": "--- title: Facing $15M Budget Deficit, CalArts Lays Off Workers author: Aaron Short url: https://hyperallergic.com/1038229/facing-15m-budget-deficit-calarts-lays-off-workers/ hostname: hyperallergic.com description: Faculty and union members are questioning the staff cuts, arguing that they will harm the school’s ability to nurture the next generation of artists. sitename: Hyperallergic date: 2025-08-29 categories: ['News'] tags: ['CalArts', 'Labor'] --- A round of layoffs at the California Institute of the Arts (CalArts) this summer is raising alarms at one of the best-known arts schools in the country as the institution grapples with rising costs. The Santa Clarita-based private arts school laid off nine administrative employees in July, including five unionized workers and four non-union workers, claiming in a schoolwide message that CalArts needed to cut expenses in the face of a projected $15 million deficit. “The nine staff positions, as well as about a dozen vacant staff positions, are being eliminated as part of a necessary workforce reduction, which will enable CalArts to address a structural deficit, prioritize student-facing services, and better align our staffing with current and projected enrollments to continue providing exceptional educational opportunities to our students,” a CalArts spokesperson told Hyperallergic. But faculty and staff members are questioning the administration’s decision, arguing that the layoffs could harm the school’s ability to train and nurture the next generation of artists. “Everyone was disappointed in this having to happen at all when we’re working so hard to try to better serve the population,” Emily Lytle-Painter, a web and digital media producer at CalArts and union member, told Hyperallergic. “When we were trying to go into discussions with the administration, we felt like there were other avenues.” Tensions between CalArts employees and school leadership have been simmering since last fall, when dozens of faculty and staff decided to form a union after enduring what they described as years of stagnant wages, increased workloads, and minimal benefits. In December, CalArts faculty delivered a letter to President Ravi Rajan announcing their intention to organize with United Auto Workers in a unit that would represent approximately 600 workers. They held elections in March and ratified the union a month later. At the same time, the school had been struggling with enrollment, which declined by about 12 percent since the pandemic, from 1,532 students in 2019 to 1,353 students in 2023 (tuition surpassed $60,000 per year in 2025–26). In an April 2024 interview, Rajan told Inside Higher Education that CalArts was “fiscally sound.” But the school proceeded with several budget cuts to reduce its operating costs, including tighter spending controls, hiring delays and travel limitations, and adjustments to admissions and financial aid packages. These measures, Rajan said in a schoolwide message, saved the school $5.5 million. This spring, CalArts sought to reduce…",
    "content": "---\ntitle: Facing $15M Budget Deficit, CalArts Lays Off Workers\nauthor: Aaron Short\nurl: https://hyperallergic.com/1038229/facing-15m-budget-deficit-calarts-lays-off-workers/\nhostname: hyperallergic.com\ndescription: Faculty and union members are questioning the staff cuts, arguing that they will harm the school’s ability to nurture the next generation of artists.\nsitename: Hyperallergic\ndate: 2025-08-29\ncategories: ['News']\ntags: ['CalArts', 'Labor']\n---\nA round of layoffs at the California Institute of the Arts (CalArts) this summer is raising alarms at one of the best-known arts schools in the country as the institution grapples with rising costs.\nThe Santa Clarita-based private arts school laid off nine administrative employees in July, including five unionized workers and four non-union workers, claiming in a schoolwide message that CalArts needed to cut expenses in the face of a projected $15 million deficit.\n“The nine staff positions, as well as about a dozen vacant staff positions, are being eliminated as part of a necessary workforce reduction, which will enable CalArts to address a structural deficit, prioritize student-facing services, and better align our staffing with current and projected enrollments to continue providing exceptional educational opportunities to our students,” a CalArts spokesperson told Hyperallergic.\nBut faculty and staff members are questioning the administration’s decision, arguing that the layoffs could harm the school’s ability to train and nurture the next generation of artists.\n“Everyone was disappointed in this having to happen at all when we’re working so hard to try to better serve the population,” Emily Lytle-Painter, a web and digital media producer at CalArts and union member, told Hyperallergic. “When we were trying to go into discussions with the administration, we felt like there were other avenues.”\nTensions between CalArts employees and school leadership have been simmering since last fall, when dozens of faculty and staff decided to form a union after enduring what they described as years of stagnant wages, increased workloads, and minimal benefits. In December, CalArts faculty delivered a letter to President Ravi Rajan announcing their intention to organize with United Auto Workers in a unit that would represent approximately 600 workers. They held elections in March and ratified the union a month later.\nAt the same time, the school had been struggling with enrollment, which declined by about 12 percent since the pandemic, from 1,532 students in 2019 to 1,353 students in 2023 (tuition surpassed $60,000 per year in 2025–26).\nIn an April 2024 interview, Rajan told Inside Higher Education that CalArts was “fiscally sound.” But the school proceeded with several budget cuts to reduce its operating costs, including tighter spending controls, hiring delays and travel limitations, and adjustments to admissions and financial aid packages. These measures, Rajan said in a schoolwide message, saved the school $5.5 million.\nThis spring, CalArts sought to reduce its headcount and sent voluntary separation and early retirement notices to between 50 and 60 faculty and staff, union leaders estimated. But only 32 employees, including 22 faculty and 10 staff, took the school’s offer and Rajan moved ahead with layoffs despite vociferous objections from the union.\n“I acknowledge how painful this news is,” Rajan wrote in a July 15 letter to faculty and staff reviewed by Hyperallergic. “These are not just abstract positions—they are roles held by our colleagues, teammates, and friends. I’m immensely grateful for their contributions and mindful of the weight of this moment for our community.”\nWhen the school announced layoffs, union leaders bargained with the administration for three months of severance, instead of two weeks of pay per year of service; three months of COBRA insurance; and priority rehiring in any vacant positions over the next two years for anyone who was laid off.\n“Everyone is understandably sad and worried, and there’s a general feeling of having to move forward with what we have,” Lytle-Painter said. “I personally was really proud of our bargaining team being able to bargain for increased benefits for those affected by the layoffs. That’s part of why we have a union.”\nThomas Leeb, an adjunct faculty member in the School of Music and union member, said he is approaching the next academic year that starts on September 8 with mixed emotions.\n“A lot of institutional knowledge has left with the voluntary separation program, and that’s sad and it hurts. At the same time, there’s a bit of optimism,” Leeb said, referencing the newly formed union. “Someone I spoke to who has been at CalArts for 25 years said this is the first time he felt protected.”\nEditor’s note 8/30/25 11am EST: A previous version of this article stated that 12 staffers were laid off. The story was updated to note that nine staffers were laid off and 12 vacant positions will not be filled. CalArts responded after publication."
  },
  {
    "slug": "the-2025-ny-art-book-fair-returns-to-moma-ps1",
    "title": "The 2025 NY Art Book Fair Returns to MoMA PS1",
    "category": "Culture",
    "date": "2025-09-01",
    "author": "Printed Matter, Inc.",
    "source": "https://hyperallergic.com/1037592/the-2025-ny-art-book-fair-returns-to-moma-ps1/",
    "cover": "assets/img/cover-fallback.jpg",
    "excerpt": "--- title: The 2025 NY Art Book Fair Returns to MoMA PS1 author: Printed Matter; Inc url: https://hyperallergic.com/1037592/the-2025-ny-art-book-fair-returns-to-moma-ps1/ hostname: hyperallergic.com description: This year’s fair features over 250 local and international artists’ book publishers, alongside a full weekend of programs and performances from September 11 through 14. sitename: Hyperallergic date: 2025-08-29 categories: ['Announcement'] tags: ['Event Announcement', 'New York'] --- Initiated in 2006, the NY Art Book Fair (NYABF) is a celebration and international gathering for artists’ book publishers to distribute their work, connect with broad audiences, and nurture new and longstanding relationships. This year’s fair marks an exciting and long-awaited return to MoMA PS1, Printed Matter’s venue partner from 2009–2019, a pivotal decade in expanding the fair’s reach and impact, establishing NYABF as a cornerstone for the distribution of artists’ books and the preeminent gathering point for celebrating the form. This partnership also exemplifies a shared commitment to creating spaces where audiences can engage with new ideas and perspectives, while reaffirming Printed Matter’s core mission dedicated to the dissemination, understanding, and appreciation of artists’ books. NYABF 2025 takes place from Thursday, September 11, through Sunday, September 14, and will feature a wide range of interdisciplinary artistic practices, including self-publishing artists, collectives, small presses, institutions, rare and out-of-print book dealers, and art book distributors. With each fair, Printed Matter continues to foreground programs that address the present moment, while also working to increase awareness around artists’ books by providing various access points for visitors to engage with printed material in enriching and discursive ways. This upcoming iteration of the fair includes special projects and installations by Boo-Hooray, Bread & Puppet Press, Corraini Edizioni, Hat & Beard Press, Special Special and 4N, Three Star Books, and an exhibition of archival material from The Detroit Printing Co-op. Two new screen-printed artist editions, “Untitled” (2025) by Huma Bhabha and “The 2nd Merlyn” (2025) by Richard Tuttle, will also be released during the fair. Join Printed Matter on Thursday, September 11, from 7–10 PM for the Opening Night celebration, with music from Lydo, Sydney Spann, and voyeur. The first five hundred guests will also receive a limited ticket edition by Lyric Shen. To learn more, visit pmabf.org.",
    "content": "---\ntitle: The 2025 NY Art Book Fair Returns to MoMA PS1\nauthor: Printed Matter; Inc\nurl: https://hyperallergic.com/1037592/the-2025-ny-art-book-fair-returns-to-moma-ps1/\nhostname: hyperallergic.com\ndescription: This year’s fair features over 250 local and international artists’ book publishers, alongside a full weekend of programs and performances from September 11 through 14.\nsitename: Hyperallergic\ndate: 2025-08-29\ncategories: ['Announcement']\ntags: ['Event Announcement', 'New York']\n---\nInitiated in 2006, the NY Art Book Fair (NYABF) is a celebration and international gathering for artists’ book publishers to distribute their work, connect with broad audiences, and nurture new and longstanding relationships. This year’s fair marks an exciting and long-awaited return to MoMA PS1, Printed Matter’s venue partner from 2009–2019, a pivotal decade in expanding the fair’s reach and impact, establishing NYABF as a cornerstone for the distribution of artists’ books and the preeminent gathering point for celebrating the form. This partnership also exemplifies a shared commitment to creating spaces where audiences can engage with new ideas and perspectives, while reaffirming Printed Matter’s core mission dedicated to the dissemination, understanding, and appreciation of artists’ books.\nNYABF 2025 takes place from Thursday, September 11, through Sunday, September 14, and will feature a wide range of interdisciplinary artistic practices, including self-publishing artists, collectives, small presses, institutions, rare and out-of-print book dealers, and art book distributors. With each fair, Printed Matter continues to foreground programs that address the present moment, while also working to increase awareness around artists’ books by providing various access points for visitors to engage with printed material in enriching and discursive ways.\nThis upcoming iteration of the fair includes special projects and installations by Boo-Hooray, Bread & Puppet Press, Corraini Edizioni, Hat & Beard Press, Special Special and 4N, Three Star Books, and an exhibition of archival material from The Detroit Printing Co-op. Two new screen-printed artist editions, “Untitled” (2025) by Huma Bhabha and “The 2nd Merlyn” (2025) by Richard Tuttle, will also be released during the fair.\nJoin Printed Matter on Thursday, September 11, from 7–10 PM for the Opening Night celebration, with music from Lydo, Sydney Spann, and voyeur. The first five hundred guests will also receive a limited ticket edition by Lyric Shen.\nTo learn more, visit pmabf.org."
  }
]